[[ "འདུལ་བ།"],
[ "1"],
[ "འདུལ་བ་གཞི།"],
[ "རབ་ཏུ་འབྱུང་བའི་གཞི་འཆད་པ།"],
[ "ཤཱ་རིའི་བུའི་སྡེ་ཚན"],
[ "མུ་སྟེགས་ཅན་གྱི་སྡེ་ཚན"],
[ "དགེ་ཚུལ་གཉིས་ཀྱི་སྡེ་ཚན"],
[ "བྱ་རོག་སྐྲོད་ཀྱི་སྡེ་ཚན"],
[ "དགྲ་བཅོམ་བསད་པའི་སྡེ་ཚན"],
[ "ལག་རྡུམ་གྱི་སྡེ་ཚན"],
[ "གསོ་སྦྱོང་གི་གཞི་འཆད་པ།"],
[ "མུ་སྟེགས་ཅན་གྱི་སྡེ་ཚན"],
[ "ཀ་བི་ནའི་སྡེ་ཚན"],
[ "གནས་ཀྱི་སྡེ་ཚན"],
[ "རྒྱལ་པོའི་སྡེ་ཚན"],
[ "སྦྱར་བ་མང་པོའི་སྡེ་ཚན"],
[ "དགག་དབྱེའི་གཞི་འཆད་པ།"],
[ "དགག་དབྱེའི་སྡེ་ཚན"],
[ "ཆོས་མིན་གྱི་སྡེ་ཚན"],
[ "དགེ་སློང་གི་སྡེ་ཚན"],
[ "ཟློས་པའི་སྡེ་ཚན"],
[ "དབྱར་གྱི་སྡེ་ཚན"],
[ "དབྱར་གནས་ཀྱི་གཞི་འཆད་པ།"],
[ "དབྱར་གནས་ཀྱི་སྡེ་ཚན"],
[ "ཟས་ཀྱི་སྡེ་ཚན"],
[ "དབྱར་རལ་བའི་སྡེ་ཚན"],
[ "ཀོ་ལྤགས་ཀྱི་གཞི་འཆད་པ།"],
[ "ལྔས་ནི་བསྙེན་པར་རྫོགས་པ་དང་ཞེས་པའི་སྡེ་ཚན"],
[ "གནས་མལ་ཆེ་བའི་སྡེ་ཚན།"],
[ "བེའུའི་སྡེ་ཚན།"],
[ "བཞོན་པའི་སྡེ་ཚན"],
[ "ཁྲུས་ཀྱི་སྡེ་ཚན"],
[ "བའི་མཇུག་མའི་སྡེ་ཚན།"],
[ "ཤིང་ལྷམ་རི་མོ་ཅན་གྱི་སྡེ་ཚན།"],
[ "སྨྱུག་མའི་ལོ་མ་སོགས་ཀྱི་སྡེ་ཚན"],
[ "མགུལ་ཆད་སོགས་ཀྱི་སྡེ་ཚན།"],
[ "སྨན་གྱི་གཞི་འཆད་པ།"],
[ "སྨན་གྱི་སྡེ་ཚན"],
[ "སྡེ་ཆེན་གྱི་སྡེ་ཚན"],
[ "ཁ"],
[ "བདེ་ཆེན་གྱི་སྡེ་ཚན"],
[ "རྒྱལ་པོའི་ཁབ་ཀྱི་སྡེ་ཚན"],
[ "ཀུ་ཤུའི་སྔེ་ཚན"],
[ "གདོལ་པའི་སྡེ་ཚན"],
[ "ལྷ་ཆེན་པོའི་སྡེ་ཚན"],
[ "རྒྱལ་པོ་མུ་ཁྱུད་ཀྱི་སྡེ་ཚན"],
[ "མེ་ལོང་གདོང་གི་སྡེ་ཚན"],
[ "ནོར་བཟང་གི་སྡེ་ཚན"],
[ "ཐམས་ཅད་སྒྲོལ་གྱི་སྡེ་ཚན"],
[ "འདུམ་བྱེད་ཀྱི་སྡེ་ཚན"],
[ "ནད་པའི་སྡེ་ཚན"],
[ "གཏམ་དུ་གྱུར་པའི་སྡེ་ཚན"],
[ "གླང་ཆེན་མཆེ་པ་དྲུག་ལྡན་སོགས་བསྟན་པ།"],
[ "སང་ས་རྒྱས་མང་པོའི་སྐབས་བསྟན་པ།"],
[ "སང་ས་རྒྱས་ཀྱི་མཚན་རྣམས་པསྟན་པ།"],
[ "ཤཱ་རིའི་བུ་དང་མོོད་གལ་གྱི་བུའི་ལེའུ"],
[ "དང་པོ། འོད་སྲུང་གི་ལེའུ"],
[ "གཉིས་པ། ཤཱ་རིའི་བུའི་ལེའུ"],
[ "གསུམ་པ། པང་ནས་སྐྱེས་ཀྱི་ལེའུ"],
[ "བཞི་པ། མཛེས་ལྡན་གྱི་ལེའུ"],
[ "ལྔ་པ། སྣ་མའི་མེ་ཏོག་གི་ལེའུ"],
[ "དྲུག་པ། བྱེ་བ་ཉི་ཤུ་པའི་ལེའུ"],
[ "བདུན་པ། ངག་ད་བང་གི་ལེའུ"],
[ "བརྒྱད་པ། བྷ་ར་དྷྭ་ཛ་བསོད་སྟོམས་ལེན་གྱི་ལེའུ"],
[ "དགུ་པ། ལེགས་འོངས་ཀྱི་ལེའུ"],
[ "བཅུ་པ། མ་འགགས་པའི་གྲོགས་པོ་དགའ་ཡོད་ཀྱི་ལེའུ"],
[ "བཅུ་གཅིག་པ། གནས་བརྟན་གྲགས་པའི་ལེའུ"],
[ "བཅུ་གཉིས་པ། དཔལ་སྐྱེད་ཀྱི་ལེའུ"],
[ "བཅུ་གསུམ་པ། བ་ཀྐུ་ལའི་ལེའུ"],
[ "བཅུ་བཞི་པ། གནས་བརྟན་གནས་བརྟན་ཞེས་པའི་ལེའུ"],
[ "བཅུ་ལྔ་པ། ག་ཡཱ་འོད་སྲུང་རྣམས་ཀྱི་ལེའུ"],
[ "བཅུ་དྲུག་པ། གནས་བརྟན་གྲགས་པའི་ལེའུ"],
[ "བཅུ་བདུན་པ། མེ་སྐྱེས་ཀྱི་ལེའུ"],
[ "བཅུ་བརྒྱད་པ། ཡུལ་འཁོར་སྐྱོང་གི་ལེའུ"],
[ "བཅུ་དགུ་པ། ས་གའི་ལེའུ"],
[ "ཉི་ཤུ་པ། འོད་སུང་བྱིན་པ་ཅན་གྱི་ལེའུ"],
[ "ཉི་ཤུ་རྩ་གཅིག་པ། ལམ་ཕྲན་བསྟན་གྱི་ལེའུ"],
[ "ཉི་ཤུ་རྩ་གཉིས་པ། སྤྲུལ་ཁོལ་གྱི་ལེའུ"],
[ "ཉི་ཤུ་རྩ་གསུམ་པ། མ་འགགས་པའི་ལེའུ"],
[ "ཉི་ཤུ་རྩ་བཞི་པ། རི་དྭགས་འཛིན་གྱི་བུ་ནག་པོའི་ལེའུ"],
[ "ཉི་ཤུ་རྩ་ལྔ་པ། སྒྲ་ཅན་ཟིན་གྱི་ལེའུ"],
[ "ཉི་ཤུ་རྩ་དྲུག་པ། དགའ་བོའི་ལེའུ"],
[ "ཉི་ཤུ་རྩ་བདུན་པ། གྱད་བུ་ནོར་གྱི་ལེའུ"],
[ "ཉི་ཤུ་རྩ་བརྒྱད་པ། ཉེ་སྡེའི་ལེའུ"],
[ "ཉི་ཤུ་རྩ་དགུ་པ། ཤཱཀྱའི་རྒྱལ་པོ་བཟང་ལྡན་གྱི་ལེའུ"],
[ "སུམ་ཅུ་པ། མཛེས་བཟང་གི་ལེའུ"],
[ "སུམ་ཅུ་རྩ་གཅིག་པ། གནས་འཇོག་སྦྲང་རྩི་ཅན་གྱི་ལེའུ"],
[ "སུམ་ཅུ་རྩ་གཉིས་པ། གནས་བརྟན་རྒྱུ་ཅན་གྱི་ལེའུ"],
[ "སུམ་ཅུ་རྩ་གསུམ་པ། ཀོོཎྚི་ནྱའི་ལེའུ"],
[ "སུམ་ཅུ་རྩ་བཞི་པ། ཉེ་བ་འཁོར་གྱི་ལེའུ"],
[ "སུམ་ཅུ་རྩ་ལྔ་པ། འོད་བྲེད་ཀྱི་ལེའུ"],
[ "སུམ་ཅུ་རྩ་དྲུག་པ། ནམ་གྲུའི་ལེའུ"],
[ "སུམ་ཅུ་རྩ་བདུན་པ། དེ་བཞིན་གཤེགས་པའི་ལེའུ(སྟོད)"],
[ "ག"],
[ "སུམ་བཅུ་སོ་བདུན་པ། དེ་བཞིན་གཤེགས་པའི་ལེའུ།(སྨད)"],
[ "ནོར་ཅན་སོགས་བསྟན་པ།"],
[ "སྡེའི་སྡེ་ཚན"],
[ "ནད་བུ་ཅན་སོགས་བསྟན་པ།"],
[ "ཀེ་ནའི་བུ་ཡིས་བཏུང་བ་བླང་ས་པ་བསྟན་པ།"],
[ "ཀ་ཤིའི་ཚོང་རྡལ་ནས་ནས་ཐུག་བླངས་པ་སོགས་བསྟན་པ།"],
[ "གོས་ཀྱི་གཞི་འཆད་པ།"],
[ "འཚོ་བྱེད་ཀྱི་སྡེ་ཚན"],
[ "གསོ་རས་ཀྱི་སྡེ་ཚན"],
[ "ཁ་ཚར་རིང་པོའི་སྡེ་ཚན"],
[ "དབྱར་རལ་བར་ནི་རིག་བྱ་དང་ཞེས་པའི་སྡེ་ཚན"],
[ "ཤི་བའི་དུས་ཀྱི་སྡེ་ཚན"],
[ "ཉེ་དགའི་སྡེ་ཚན"],
[ "ནད་པའི་སྡེ་ཚན"],
[ "སྲ་བརྐྱང་གི་གཞི་འཆད་པ།"],
[ "གན་ས་བཅས་ཀྱི་སྡེ་ཚན"],
[ "རྡོལ་པའི་སྡེ་ཚན"],
[ "བླིངས་པའི་སྡེ་ཚན"],
[ "དུས་ཀྱི་སྡེ་ཚན།"],
[ "གང་ཟག་མ་མོའི་གཞིའི་སྡེ་ཚན"],
[ "ཉི་ཤུའི་སྡེ་ཚན"],
[ "བཅུ་གཉིས་ཀྱི་སྡེ་ཚན"],
[ "ཀཽ་ཤྭམྦཱིའི་གཞི་འཆད་པ།"],
[ "ལས་ཀྱི་གཞི་འཆད་པ།"],
[ "དམར་སེར་ཅན་གྱི་གཞི་འཆད་པ།"],
[ "དམར་སེར་ཅན་གྱི་ལྡེ་ཚན"],
[ "ལེགས་ལྡན་གྱི་སྡེ་ཚན"],
[ "འགྲོ་མགྱོགས་དང་ནབ་སོའི་སྡེ་ཚན"],
[ "ཆུ་སྟོད་ཀྱི་སྡེ་ཚན"],
[ "འདུན་པའི་སྡེ་ཚན"],
[ "འཆི་ལྟས་ཀྱི་སྡེ་ཚན"],
[ "འཆར་ཀའི་སྡེ་ཚན"],
[ "གང་ཟག་གི་གཞི་འཆད་པ།"],
[ "འཆར་ཀའི་སྡེ་ཚན"],
[ "བཏུས་པའི་སྡེ་ཚན"],
[ "མཐའི་སྡེ་ཚན"],
[ "གཞན་གྱིས་དང་ཞེས་པའི་སྡེ་ཚན"],
[ "སྤོ་བའི་གཞི་འཆད་པ།"],
[ "གསོ་སྦྱོང་བཞག་པའི་གཞི་འཆད་པ།"],
[ "གནས་མལ་གྱི་གཞི་འཆད་པ།"],
[ "རྩོད་པའི་གཞི་འཆད་པ།"],
[ "དགེ་འདུན་དབྱེན་གྱི་གཞི་འཆད་པ།"],
[ "མང་པོས་བཀུར་བ་ལ་སོགས་པའི་སྡེ་ཚན་།(སྟོད)"],
[ "ང"],
[ "མང་པོས་བཀྱུར་བ་ལ་སོགས་པའི་སྡེ་ཚན།(སྨད)"],
[ "འཁོར་གྱི་སྡེ་ཚན"],
[ "ཀཽཎྜི་ནྱའི་སྡེ་ཚན"],
[ "རྫུ་འཕྲུལ་གྱི་སྡེ་ཚན"],
[ "ཀཽ་ཤི་ཀའི་སྡེ་ཚན"],
[ "ངང་པའི་སྡེ་ཚན"],
[ "མནར་མེད་ཀྱི་སྡེ་ཚན"],
[ "ཅ"],
[ "སོ་སོ་ཐར་པའི་མདོ"],
[ "སོ་སོར་ཐར་པའི་མདོ་གདོན་པའི་གླེང་གཞི་བཤད་པ།"],
[ "བཅུ་ཚན་གཉིས་པ། ས་བོན་ལ་སོགས་པ་བཤད་པ།"],
[ "བཅུ་ཚན་གསུམ་པ། མ་བསྐོས་པ་ལ་སོགས་པ་བཤད་པ།"],
[ "བཅུ་ཚན་བཞི་པ། ཡང་ཡང་ལ་སོགས་པ་བཤད་པ།"],
[ "བཅུ་ཚན་ལྔ་པ། སྲོག་ཆགས་དང་བཅས་པའི་ཆུ་སོགས་བཤད་པ།"],
[ "བཅུ་ཚན་དྲུག་པ། བདེ་དང་མེ་ལ་སོགས་པ་བཤད་པ།"],
[ "བཅུ་ཚན་བདུན་པ། བསམས་བཞིན་དུ་དུད་འགྲོ་གསོད་པ་སོགས་བཤད་པ།"],
[ "བཅུ་ཚན་བརྒྱད་པ། མགྲོན་མང་རྐུན་མ་སོགས་བཤད་པ།"],
[ "བཅུ་ཚན་དགུ་པ། ཟས་བཅས་སྐྱ་རེངས་སོགས་བཤད་པ།"],
[ "སོ་སོར་བཤགས་པར་བྱ་བའི་ཆོས་བཞི་བཤད་པ།"],
[ "བསླབ་པའི་ཆོས་མང་པོ་བཤད་པ།"],
[ "རྩོད་པ་ཞི་བར་བྱ་བའི་ཆོས་བདུན་བཤད་པ།"],
[ "འདུལ་བ་རྣམ་པར་འབྱེད་པ།"],
[ "འདུལ་བ་ལ་བསྟོད་པ།"],
[ "ཕམ་པར་འགྱུར་བའི་ཆོས་རྣམས་བཤད་པ།"],
[ "ཕམ་པར་འགྱུར་བ་དང་པོ་བཤད་པ།"],
[ "ཕམ་པར་འགྱུར་བ་གཉིས་པ་བཤད་པ།"],
[ "ཕམ་པར་འགྱུར་བ་གསུམ་པ་བཤད་པ།"],
[ "ཕམ་པར་འགྱུར་བ་བཞི་པ་བཤད་པ།"],
[ "དགེ་འདུན་ལྷག་མའི་སྡེ་བཤད་པ།"],
[ "དང་པོ། ཁུ་བ་འབྱིན་པའི་དགེ་འདུན་ལྷག་མ་བཤད་པ།"],
[ "གཉིས་པ། ལུས་ཀྱིས་རེག་པའི་དགེ་འདུན་ལྷག་མ་པཤད་པ།"],
[ "གསུམ་པ། འཁྲིག་པ་དང་ལྡན་པ་སྨྲ་བའི་དགེ་འདུན་ལྷག་མ་བཤད་པ།"],
[ "བཞི་པ། བསྙེན་བཀུར་བསྔགས་པའི་དགེ་འདུན་ལྷག་མ་བཤད་པ།"],
[ "ལྔ་པ། སྨྱན་བྱེད་པའི་དགེ་འདུན་ལྷག་མ་བཤད་པ།"],
[ "དྲུག་པ། ཁང་པའི་དགེ་འདུན་ལྷག་མ་བཤད་པ།"],
[ "བདུན་པ། གཙུག་ལག་ཁང་གི་དགེ་འདུན་ལྷག་མ་བཤད་པ།"],
[ "བརྒྱད་པ། གཞི་མེད་པར་སྐུར་པ་འདེབས་པའི་དགེ་འདུན་ལྷག་མ་བཤད་པ།"],
[ "དགུ་པ། གཞན་གྱི་ཆ་མ་ཡིན་པ་དང་མཐུན་པའི་དགེ་འདུན་ལྷག་མ་བཤད་པ།"],
[ "བཅུ་པ། ད་གེ་འདུན་གྱི་དབྱེན་བྱེད་པའི་དགེ་འདུན་ལྷག་མ་བཤད་པ། (སྟོད)"],
[ "ཆ"],
[ "བཅུ་པ། དགེ་འདུན་གྱི་དབྱེན་བྱེད་པའི་ད་གེ་འདུན་ལྷག་མ་བཤད་པ། (སྨད)"],
[ "བཅུ་གཅིག་པ། རྗེས་སུ་ཕྱོགས་པའི་ལྷག་མ་བཤད་པ།"],
[ "བཅུ་གཉིས་པ། ཁྱིམ་སུན་འབྱིན་པའི་ལྷག་མ་བཤད་པ།"],
[ "བཅུ་གསུམ་པ། བཀའ་བློ་མི་བདེ་བའི་ལྷག་མ་བཤད་པ།"],
[ "མ་ངེས་པའི་ཆོས་བཤད་པ།"],
[ "མ་ངེས་པའི་ཆོས་དང་པོ་བཤད་པ།"],
[ "མ་ངེས་པའི་ཆོས་གཉིས་པ་བཤད་པ།"],
[ "སྤང་བའི་ལྟུང་བྱེད་སུམ་ཅུ་བཤད་པ།"],
[ "དང་པོ། འཆང་བའི་སྤང་བ་བསྟན་པ།"],
[ "གཉིས་པ། འབྲལ་བའི་སྤང་བ་བསྟན་པ།"],
[ "གསུམ་པ། འཇོག་པའི་སྤང་བ་བསྟན་པ།"],
[ "བཞི་པ། འཁྲུར་འཇུག་པའི་སྤང་བ་བསྟན་པ།"],
[ "ལྔ་པ། ལེན་པའི་སྤང་བ་བསྟན་པ།"],
[ "དྲུག་པ། སློང་བའི་སྤང་བ་བསྟན་པ།"],
[ "བདུན་པ། སློང་བར་རིགས་པའི་སྤང་བ་བསྟན་པ།"],
[ "བརྒྱད་པ། སྤགས་པ་ལས་ལྷག་པ་སློང་བའི་སྤང་བ་བསྟན་པ།"],
[ "དགུ་པ། སོ་སོ་ནས་སྤགས་པ་ལས་ལྷག་པ་སློང་བའི་སྤང་བ་བསྟན་པ།"],
[ "བཅུ་པ། བསྐུར་བའི་སྤང་བ་བསྟན་པ།"],
[ "བཅུ་གཅིག་པ། སྲིན་བལ་གྱི་སྤང་བ་བསྟན་པ།"],
[ "བཅུ་གཉིས་པ། བལ་ནག་པོ་འབའ་ཞིག་གི་སྤང་བ་བསྟན་པ།"],
[ "བཅུ་གསུམ་པ། ཆ་གཉིས་བསྲེས་པའི་སྤང་བ་བསྟན་པ།"],
[ "བཅུ་བཞི་པ། ལོ་དྲུག་ཏུ་བཅང་བའི་སྤང་བ་བསྟན་པ།"],
[ "བཅོ་ལྔ་པ། མཐོ་གང་གི་སྤང་བ་བསྟན་པ།"],
[ "བཅུ་དྲུག་པ། བལ་ཐོགས་པའི་སྤང་བ་བསྟན་པ།"],
[ "བཅུ་བདུན་པ། བལ་རྨེལ་དུ་འཇུག་པའི་སྤང་བ་བསྟན་པ།"],
[ "བཅོ་བརྒྱད་པ། གསེར་དངུལ་ལ་རེག་པའི་སྤང་བ་བསྟན་པ།"],
[ "བཅུ་དགུ་པ། མངོན་མཚན་ཅན་གྱིས་སྦྱོད་པའི་སྤང་བ་བསྟན་པ།"],
[ "ཉི་ཤུ་པ། ཉོ་འཚོང་བྱེད་པའི་སྤང་བ་བསྟན་པ།"],
[ "ཉི་ཤུ་གཅིག་པ། ལྷུང་བཟེད་འཆང་བའི་སྤང་བ་བསྟན་པ།"],
[ "ཉི་ཤུ་གཉིས་པ། ལྷུང་བཟེད་ཚོལ་བའི་སྤང་བ་བསྟན་པ།"],
[ "ཉི་ཤུ་གསུམ་པ། འཐག་ཏུ་འཇུད་པའི་སྤང་བ་བསྟན་པ།"],
[ "ཉི་ཤུ་བཞི་པ། འཐག་པ་སྐྱེད་པའི་སྤང་བ་བསྟན་པ།"],
[ "ཉི་ཤུ་ལྔ་པ། འཕྲོག་པའི་སྤང་བ་བསྟན་པ།"],
[ "ཉི་ཤུ་དྲུག་པ། བརྟད་པ་ལས་བྱུང་བ་སྤང་བ་བསྟན་པ།"],
[ "ཉི་ཤུ་བདུན་པ། ཞག་བདུན་གྱིས་འབྲལ་བ་སྤང་བ་བསྟན་པ།"],
[ "ཉི་ཤུ་བརྒྱད་པ། དབྱར་གྱི་རས་ཆེན་གྱི་སྤང་བ་བསྟན་པ།"],
[ "ཉི་ཤུ་དགུ་པ། བསྔོས་པ་ལས་བསྒྱུར་པའི་སྤང་བ་བསྟན་པ།"],
[ "སུམ་ཅུ་པ། གསོག་འཇོག་གི་སྤང་བ་བསྟན་པ།"],
[ "ལྟུང་བྱེད་ཀྱི་སྡེ་རྣམས་བཤད་པ།"],
[ "བཅུ་ཚན་དང་པོ། ཤེས་བཞིན་ལ་སོགས་པའི་སྡེ་ཚན"],
[ "དང་པོ། བརྫུན་དུ་སྨྲ་བའི་ལྟུང་བྱེད"],
[ "གཉིས་པ། མིའི་སྐྱོན་ནས་སྨྲ་བའི་ལྟུང་བྱེད"],
[ "གསུམ་པ། དགེ་སློང་ལ་ཕྲ་མ་བྱེད་པའི་ལྟུང་བྱེད"],
[ "བཞི་པ། སྐྱོ་སྔོགས་བྱེད་པའི་ལྟུང་བྱེད"],
[ "ལྔ་པ། སྟོན་པའི་ལྟུང་བྱེད"],
[ "དྲུག་པ། འདོན་པའི་ལྟུང་བྱེད"],
[ "བདུན་པ། གནས་ངན་ལེན་བརྗོད་པའི་ལྟུང་བྱེད"],
[ "བརྒྱད་པ། མིའི་ཆོས་བླ་མ་བརྗོད་པའི་ལྟུང་བྱེད"],
[ "དགུ་པ། སྐུར་བ་འདེབས་བའི་ལྟུང་བྱེད"],
[ "བཅུ་པ། བསླབ་པ་ཁྱད་དུ་གསོད་པའི་ལྟུང་བྱེད"],
[ "བཅུ་ཚན་གཉིས་པ། ས་བོན་ལ་སོགས་པའི་སྡེ་ཚན"],
[ "བཅུ་གཅིག་པ། ས་བོན་དང་སྐྱེ་བ་འཇིག་པའི་ལྟུང་བྱེད"],
[ "ཇ"],
[ "བཅུ་གཉིས་པ། འཕྱ་བའི་ལྟུང་བྱེད"],
[ "བཅུ་གསུམ་པ། བསྒོ་བ་རྣ་ལ་གཟོན་པའི་ལྟུང་བྱེད"],
[ "བཅུ་བཞི་པ། གནས་མལ་གྱི་ལྟུང་བྱེད"],
[ "བཅོ་ལྔ་པ། གདིང་བའི་ལྟུང་བྱེད"],
[ "བཅུ་དྲུག་པ། སྐྲོད་པའི་ལྟུང་བྱེད"],
[ "བཅུ་བདུན་པ། ཕྱིས་གནོན་གྱི་ལྟུང་བྱེད"],
[ "བཅོ་བརྒྱད་པ། རྩ་བ་འབྱུང་བ་ལ་འདུག་པའི་ལྟུང་བྱེད"],
[ "བཅུ་དགུ་པ། སྲོག་ཆགས་དང་བཅས་པ་ལ་སྤྱོད་པའི་ལྟུང་བྱེད"],
[ "ཉི་ཤུ་པ། གཙུག་ལག་ཁང་གི་ལྟུང་བྱེད"],
[ "བཅུ་ཚན་གསུམ་པ། མ་བསྐོས་པ་ལ་སོགས་པའི་སྡེ་ཚན"],
[ "ཉི་ཤུ་གཅིག་པ། མ་བསྐོས་པར་སྟོན་པའི་ལྟུང་བྱེད"],
[ "ཉི་ཤུ་གཉིས་པ། ཉི་མ་ནུབ་ཀྱི་བར་དུ་སྟོན་པའི་ལྟུང་བྱེད"],
[ "ཉི་ཤུ་གསུམ་པ། ཟས་ཅུང་ཟད་ཙམ་གྱི་ཕྱིར་སྟོན་པའི་ལྟུང་བྱེད"],
[ "ཉི་ཤུ་བཞི་པ། གོས་སྤྱིན་པའི་ལྟུང་བྱེད"],
[ "ཉི་ཤུ་ལྔ་པ། གོས་བྱེད་པའི་ལྟུང་བྱེད"],
[ "ཉི་ཤུ་དྲུག་པ། དགེ་སློང་མ་དང་ལྷན་ཅིག་འགྲོན་ལམ་དུ་འཇུག་པའི་ལྷུང་བྱེད"],
[ "ཉི་ཤུ་བདུན་པ། དགེ་སློང་མ་དང་ལྷན་ཅིག་གྲུར་འཇུག་པའི་ལྟུང་བྱེད"],
[ "ཉི་ཤུ་བརྒྱད་པ། གཅིག་པུ་འདུག་པའི་ལྟུང་བྱེད"],
[ "ཉི་ཤུ་དགུ་པ། གཅིག་པུ་འགྲེང་བའི་ལྟུང་བྱེད"],
[ "སུམ་བཅུ་པ། དགེ་སློང་མས་སྦྱོར་དུ་བཅུག་པ་ཟ་བའི་ལྟུང་བྱེད"],
[ "བཅུ་ཚན་བཞི་པ། ཡང་ཡང་ཟ་བ་ལ་སོགས་པའི་སྡེ་ཚན"],
[ "སུམ་བཅུ་རྩ་གཅིག་པ། ཡང་ཡང་ཟ་བའི་ལྟུང་བྱེད"],
[ "སུམ་བཅུ་རྩ་གཉིས་པ། འདུག་གནས་གཅིག་ཏུ་ཟ་བའི་ལྟུང་བྱེད"],
[ "སུམ་བཅུ་རྩ་གསུམ་པ། ལྷུང་བཟེད་དོ་གསུམ་ཙམ་ལས་ལྷག་པར་ལེན་པའི་ལྟུང་བྱེད"],
[ "སུམ་བཅུ་རྩ་བཞི་པ། སྟན་གཅིག་པའི་ཟས་ཀྱི་ལྟུང་བྱེད"],
[ "སུམ་བཅུ་རྩ་ལྔ་པ། སྤང་ས་པ་ལ་སྟོབས་པའི་ལྟུང་བྱེད"],
[ "སུམ་བཅུ་རྩ་དྲུག་པ། འདུས་ཤིང་ཟ་བའི་ལྟུང་བྱེད།"],
[ "སུམ་བཅུ་རྩ་བདུན་པ། དུས་མ་ཡིན་པར་ཟ་བའི་ལྟུང་བྱེད"],
[ "སུམ་བཅུ་རྩ་བརྒྱད་པ། གསོག་འཇོག་གི་ལྟུང་བྱེད།"],
[ "སུམ་བཅུ་རྩ་དགུ་པ། བྱིན་ལེན་མ་བྱས་པར་ཟ་བའི་ལྟུང་བྱེད།"],
[ "བཞི་བཅུ་པ། བསོད་པ་སློང་བའི་ལྟུང་བྱེད"],
[ "བཅུ་ཚན་ལྔ་པ། ཆུ་ལ་སོགས་པའི་སྡེ་ཚན"],
[ "བཞི་བཅུ་རྩ་གཅིག་པ། སྲོག་ཆགས་དང་བཅས་པའི་ཆུ་ལ་སྤྱོད་པའི་ལྟུང་བྱེད"],
[ "བཞི་བཅུ་རྩ་གཉིས་པ། ཉལ་པོ་བྱེད་པར་ཤོམ་པའི་ཁྱིམ་ན་འདུག་པའི་ལྟུང་བྱེད"],
[ "བཞི་བཅུ་རྩ་གསུམ་པ། ཉལ་པོ་བྱེད་པར་ཤོམ་པའི་ཁྱིམ་ན་འགྲེང་བའི་ལྟུང་བྱེད"],
[ "བཞི་བཅུ་རྩ་བཞི་པ། གཅེར་བུ་པ་ལ་སྦྱིན་པའི་ལྟུང་བྱེད"],
[ "བཞི་བཅུ་རྩ་ལྔ་པ། དམག་ལ་ལྟ་བའི་ལྟུང་བྱེད"],
[ "བཞི་བཅུ་རྩ་དྲུག་པ། དམག་གི་ནང་ན་གནས་པའི་ལྟུང་བྱེད"],
[ "བཞི་བཅུ་རྩ་བདུན་པ། དཔུང་གི་ཡན་ལག་ཉམས་སུ་མྱོང་བར་བྱེད་པའི་ལྟུང་བྱེད"],
[ "བཞི་བཅུ་རྩ་བརྒྱད་པ། རྡེག་པའི་ལྟུང་བྱེད"],
[ "བཞི་བཅུ་རྩ་དགུ་པ། གཟས་པའི་ལྟུང་བྱེད"],
[ "ལྔ་བཅུ་པ། གནས་ངན་ལེན་འཆབ་པའི་ལྟུང་བྱེད"],
[ "བཅུ་ཚན་དྲུག་པ། ཁྱིམ་ལ་སོགས་པའི་སྡེ་ཚན"],
[ "ལྔ་བཅུ་རྩ་གཅིག་པ། ཟན་གཅོད་དུ་འཇུད་པའི་ལྟུང་བྱེད"],
[ "ལྔ་བཅུ་རྩ་གཉིས་པ། མེ་ལ་རེག་པའི་ལྟུང་བྱེད"],
[ "ལྔ་བཅུ་རྩ་གསུམ་པ། འདུན་པ་ཕྱིར་སྒྱུར་བའི་ལྟུང་བྱེད"],
[ "ལྔ་བཅུ་རྩ་བཞི་པ། རྫོགས་པར་མ་བསྙེན་པ་དང་ལྷན་ཅིག་ཉལ་བའི་ལྟུང་བྱེད"],
[ "ལྔ་བཅུ་རྩ་ལྔ་པ། ལྟ་བའི་རྣམ་པ་མི་གཏོང་བའི་ལྟུང་བྱེད"],
[ "ལྔ་བཅུ་རྩ་དྲུག་པ། སྤངས་པའི་རྗེས་སུ་ཕྱོགས་པའི་ལྟུང་བྱེད"],
[ "ལྔ་བཅུ་རྩ་བདུན་པ། བསྙིལ་བ་སྡུད་པའི་ལྟུང་བྱེད"],
[ "ལྔ་བཅུ་རྩ་བརྒྱད་པ། ཁ་མ་བསྒྱུར་བའི་གོས་གྱོན་པའི་ལྟུང་བྱེད"],
[ "ལྔ་བཅུ་རྩ་དགུ་པ། ལོངས་པའི་གཞིར་གཏོགས་པའི་ལྟུང་བྱེད"],
[ "དྲུག་བཅུ་པ། ཁྲུས་བྱེད་པའི་ལྟུང་བྱེད"],
[ "བཅུ་ཚན་བདུན་པ། བསམས་བཞིན་ལ་སོགས་པའི་སྡེ་ཚན"],
[ "དྲུག་བཅུ་རྩ་གཅིག་པ། དུད་འགྲོ་གསོད་པའི་ལྟུང་བྱེད"],
[ "དྲུག་བཅུ་རྩ་གཉིས་པ། འགྱོད་པ་སྐྱེད་པའི་ལྟུང་བྱེད"],
[ "དྲུག་བཅུ་རྩ་གསུམ་པ། ག་ག་ཚིལ་བྱེད་པའི་ལྟུང་བྱེད"],
[ "དྲུག་བཅུ་རྩ་བཞི་པ། ཆུ་ལ་རྩེ་བའི་ལྟུང་བྱེད"],
[ "དྲུག་བཅུ་རྩ་ལྔ་པ། བུད་མེད་དང་ལྷན་ཅིག་ཉལ་བའི་ལྟུང་བྱེད"],
[ "དྲུག་བཅུ་རྩ་དྲུག་པ། སྔངས་པར་བྱེད་པའི་ལྟུང་བྱེད"],
[ "དྲུག་བཅུ་རྩ་བདུན་པ། སྦེད་པའི་ལྟུང་བྱེད"],
[ "དྲུག་བཅུ་རྩ་བརྒྱད་པ། བྱིན་པས་ཉེ་བར་འཚོ་བའི་ལྟུང་བྱེད"],
[ "དྲུག་བཅུ་རྩ་དགུ་པ། སྐུར་པ་འདེབས་པའི་ལྟུང་བྱེད"],
[ "བདུན་བཅུ་པ། བུད་མེད་དང་ལྷན་ཅིག་འགྲོ་བའི་ལྟུང་བྱེད"],
[ "བཅུ་ཚན་བདུན་པ། འགྲོན་མང་རྐུན་མ་སོགས་ཀྱི་སྡེ་ཚན"],
[ "བདུན་བཅུ་རྩ་གཅིག་པ། རྐུན་མ་དང་ལྷན་ཅིག་འགྲོ་བའི་ལྟུང་བྱེད"],
[ "བདུན་བཅུ་རྩ་གཉིས་པ། ལོ་ཉི་ཤུ་མ་ལོན་པར་རྫོགས་པར་བསྙེན་པར་བྱེད་པའི་ལྷུང་བྱེད"],
[ "ཉ"],
[ "བདུན་བཅུ་རྩ་གསུམ་པ། ས་རྐོ་བའི་ལྟུང་བྱེད"],
[ "བདུན་བཅུ་རྩ་བཞི་པ། མགྲོན་དུ་གཉེར་བ་ལས་རིང་དུ་འདུག་པའི་ལྟུང་བྱེད"],
[ "བདུན་བཅུ་རྩ་ལྔ་པ། བསླབ་པ་ལ་ཉེ་བར་འཇོག་པའི་ལྟུང་བྱེད"],
[ "བདུན་བཅུ་རྩ་དྲུག་པ། ཉན་རྣ་ལས་གྱུར་པའི་ལྟུང་བྱེད"],
[ "བདུན་བཅུ་རྩ་བདུན་པ། མི་སྨྲ་བར་འགྲོ་བའི་ལྟུང་བྱེད"],
[ "བདུན་བཅུ་རྩ་བརྒྱད་པ། མ་གུས་པའི་ཚུལ་གྱི་ལྟུང་བྱེད"],
[ "བདུན་བཅུ་རྩ་དགུ་པ། མྱོས་པར་འགྱུར་བ་འཐུང་བའི་ལྟུང་བྱེད"],
[ "བརྒྱད་བཅུ་པ། དུས་མ་ཡིན་པར་འགྲོ་བའི་ལྟུང་བྱེད"],
[ "བཅུ་ཚན་བརྒྱད་པ། མཆོད་སྟོན་ལ་སོགས་པའི་སྡེ་ཚན"],
[ "བརྒྱད་བཅུ་རྩ་གཅིག་པ། གྲོང་དུ་རྒྱུ་བའི་ལྟུང་བྱེད"],
[ "བརྒྱད་བཅུ་རྩ་གཉིས་པ། རྒྱལ་པོའི་ཕོ་བྲང་དུ་ནུབ་མོ་འགྲོ་བའི་ལྟུང་བྱེད"],
[ "བརྒྱད་བཅུ་རྩ་གསུམ་པ། བསླབ་པའི་གཞིའི་དངོས་པོ་ལ་ཁྱད་དུ་གསོད་པའི་ལྟུང་བྱེད"],
[ "བརྒྱད་བཅུ་རྩ་བཞི་པ། ཁབ་རལ་འཆོས་པའི་ལྟུང་བྱེད"],
[ "བརྒྱད་བཅུ་རྩ་ལྔ་པ། ཁྲི་རྐང་འཆོས་པའི་ལྟུང་བྱེད"],
[ "བརྒྱད་བཅུ་རྩ་དྲུག་པ། ཤིང་བལ་གྱིས་གོས་པར་བྱས་པའི་ལྟུང་བྱེད"],
[ "བརྒྱད་བཅུ་རྩ་བདུན་པ། གདིང་བ་ལས་གྱུར་པའི་ལྟུང་བྱེད"],
[ "བརྒྱད་བཅུ་རྩ་བརྒྱད་པ། གཡན་པ་དགབ་པ་ལས་གྱུར་པའི་ལྟུང་བྱེད"],
[ "བརྒྱད་བཅུ་རྩ་དགུ་པ། དབྱར་གྱི་རས་ཆེན་ལས་གྱུར་པའི་ལྟུང་བྱེད"],
[ "དགུ་བཅུ་པ། བདེ་བར་གཤེགས་པའི་ཆོས་གོས་ཀྱི་ཚད་ལས་གྱུར་པའི་ལྟུང་བྱེད"],
[ "སོ་སོར་བཤགས་པར་བྱ་བའི་སྡེ་བཤད་པ།"],
[ "དང་པོ། དགེ་སློང་མ་ལས་ཟས་ལེན་པའི་སོ་སོར་བཤགས་པར་བྱ་བ"],
[ "གཉིས་པ། གྲལ་རིམས་སུ་མ་ཕེབས་པར་འབྲིམ་དུ་འཇུག་པ་མ་བཟློག་པར་ཟ་བའི་བའི་སོ་སོར་བཤགས་པར་བྱ་བ"],
[ "གསུམ་པ། བསླབ་པ་དྲལ་ཏེ་ཁྱིམ་དུ་འཇུག་པའི་སོ་སོར་བཤགས་པར་བྱ་བ"],
[ "བཞི་པ། ནགས་བརྟག་པ་ལས་གྱུར་པའི་སོ་སོར་བཤགས་པར་བྱ་བ"],
[ "བསླབ་པའི་ཆོས་མང་པོ་བཤད་པ།"],
[ "རྩོད་པ་ཞི་བར་བྱ་བའི་ཆོས་བདུན་བཤད་པ།"],
[ "ཏ"],
[ "དགེ་སློང་མའི་སོ་སོར་ཐར་པའི་མདོ།"],
[ "སོ་སོར་ཐར་པའི་མདོ་གདོན་པའི་གླེང་གཞི"],
[ "ཕམ་པར་འགྱུར་བའི་ཆོས་བརྒྱད་འཆད་པ།"],
[ "དགེ་འདུན་ལྷག་མའི་ཆོས་ཉི་ཤུ་འཆད་པ།"],
[ "སྤང་བའི་ལྟུང་བྱེད་སུམ་ཅུ་རྩ་གསུམ་འཆད་པ།"],
[ "ལྟུང་བྱེད་ཀྱི་ཆོས་བརྒྱ་དང་བརྒྱད་ཅུ་འཆད་པ།"],
[ "བརྫུན་སྐྱོན་སོགས་འཆད་པ།"],
[ "ས་བོན་སོགས་འཆད་པ།"],
[ "འདུག་གནས་སོགས་འཆད་པ།"],
[ "སྲོག་ཆགས་སོགས་འཆད་པ།"],
[ "བདེ་བ་སོགས་འཆད་པ།"],
[ "དུད་འགྲོ་སོགས་འཆད་པ།"],
[ "རྐུ་བ་སོགས་འཆད་པ།"],
[ "ཟས་དང་བཅས་པ་སོགས་འཆད་པ།"],
[ "ལོ་བཅུ་གཉིས་མ་ལོན་པ་སོགས་འཆད་པ།"],
[ "འདྲིད་པ་སོགས་འཆད་པ།"],
[ "ནད་གཡོག་སོགས་འཆད་པ།"],
[ "ཉན་པ་སོགས་འཆད་པ།"],
[ "ཁྲི་གཅིག་ལ་ཉལ་བ་སོགས་འཆད་པ།"],
[ "པུ་ཤེལ་ཙི་སོགས་འཆད་པ།"],
[ "མཆིལ་ལྷམ་སོགས་འཆད་པ།"],
[ "སྒོག་སྐྱ་སོགས་འཆད་པ།"],
[ "ཆོས་ལ་སེར་སྣ་བྱེད་པ་སོགས་འཆད་པ།"],
[ "འདུན་པ་སོགས་འཆད་པ།"],
[ "མི་འགྲོ་བ་སོགས་འཆད་པ།"],
[ "སོ་སོར་བཤགས་པར་བྱ་བའི་ཆོས་བཅུ་གཅིག་འཆད་པ།"],
[ "བསླབ་པར་བྱ་བའི་ཆོས་མང་པོ་འཆད་པ།"],
[ "རྩོད་པ་ཞི་བར་བྱ་བའི་ཆོས་བདུན་འཆད་པ།"],
[ "དགེ་སློང་མའི་འདུལ་བ་རྣམ་པར་འབྱེད་པ"],
[ "ཕམ་པར་འགྱུར་བའི་ཆོས་བརྒྱད་འཆད་པ།"],
[ "ཕས་ཕམ་པར་གྱུར་པ་དང་པོ་འཆད་པ།"],
[ "ཕས་ཕམ་པར་གྱུར་པ་གཉིས་པ་འཆད་པ།"],
[ "ཕས་ཕམ་པར་གྱུར་པ་གསུམ་པ་འཆད་པ།"],
[ "ཕས་ཕམ་པར་གྱུར་པ་བཞི་པ་འཆད་པ།"],
[ "ཕས་ཕམ་པར་གྱུར་པ་ལྔ་པ་འཆད་པ།"],
[ "ཕས་ཕམ་པར་གྱུར་པ་དྲུག་པ་འཆད་པ།"],
[ "ཕས་ཕམ་པར་གྱུར་པ་བདུན་པ་འཆད་པ།"],
[ "ཕས་ཕམ་པར་གྱུར་པ་བརྒྱད་པ་འཆད་པ།"],
[ "དགེ་འདུན་ལྷག་མའི་ཆོས་ཉི་ཤུ་འཆད་པ།"],
[ "དགེ་འདུན་ལྷག་མ་དང་པོ་འཆད་པ།"],
[ "དགེ་འདུན་ལྷག་མ་གཉིས་པ་འཆད་པ།"],
[ "དགེ་འདུན་ལྷག་མ་གསུམ་པ་འཆད་པ།"],
[ "དགེ་འདུན་ལྷག་མ་བཞི་པ་འཆད་པ།"],
[ "དགེ་འདུན་ལྷག་མ་ལྔ་པ་འཆད་པ།"],
[ "དགེ་འདུན་ལྷག་མ་དྲུག་པ་འཆད་པ།"],
[ "དགེ་འདུན་ལྷག་མ་བདུན་པ་འཆད་པ།"],
[ "དགེ་འདུན་ལྷག་མ་བརྒྱད་པ་འཆད་པ།"],
[ "ད་གེ་འདུན་ལྷག་མ་དགུ་པ་འཆད་པ།"],
[ "ད་གེ་འདུན་ལྷག་མ་བཅུ་པ་འཆད་པ།"],
[ "དགེ་འདུན་ལྷག་མ་བཅུ་གཅིག་པ་འཆད་པ།"],
[ "དགེ་འདུན་ལྷག་མ་བཅུ་གཉིས་པ་འཆད་པ།"],
[ "དགེ་འདུན་ལྷག་མ་བཅུ་གསུམ་པ་འཆད་པ།"],
[ "དགེ་འདུན་ལྷག་མ་བཅུ་བཞི་པ་འཆད་པ།"],
[ "དགེ་འདུན་ལྷག་མ་བཅྭ་ལྔ་པ་འཆད་པ།"],
[ "དགེ་འདུན་ལྷག་མ་བཅུ་དྲུག་པ་འཆད་པ།"],
[ "ད་གེ་འདུན་ལྷག་མ་བཅུ་བདུན་པ་འཆད་པ།"],
[ "དགེ་འདུན་ལྷག་མ་བཅྭ་བརྒྱད་པ་འཆད་པ།"],
[ "དགེ་འདུན་ལྷག་མ་བཅུ་དགུ་པ་འཆད་པ།"],
[ "དགེ་འདུན་ལྷག་མ་ཉི་ཤུ་པ་འཆད་པ།"],
[ "སྤང་བའི་ལྟུང་བྱེད་སུམ་ཅུ་རྩ་གསུམ་འཆད་པ།"],
[ "སྤང་བའི་ལྟུང་བྱེད་དང་པོ་འཆད་པ།"],
[ "སྤང་བའི་ལྟུང་བྱེད་གཉིས་པ་འཆད་པ།"],
[ "སྤང་བའི་ལྟུང་བྱེད་གསུམ་པ་འཆད་པ།"],
[ "སྤང་བའི་ལྟུང་བྱེད་བཞི་པ་འཆད་པ།"],
[ "སྤང་བའི་ལྟུང་བྱེད་ལྔ་པ་འཆད་པ།"],
[ "སྤང་བའི་ལྟུང་བྱེད་དྲུག་པ་འཆད་པ།"],
[ "སྤང་བའི་ལྟུང་བྱེད་བདུན་པ་འཆད་པ།"],
[ "སྤང་བའི་ལྟུང་བྱེད་བརྒྱད་པ་འཆད་པ།"],
[ "སྤང་བའི་ལྟུང་བྱེད་དགུ་པ་འཆད་པ།"],
[ "སྤང་བའི་ལྟུང་བྱེད་བཅུ་པ་འཆད་པ།"],
[ "སྤང་བའི་ལྟུང་བྱེད་བཅུ་གཅིག་པ་འཆད་པ།"],
[ "སྤང་བའི་ལྟུང་བྱེད་བཅུ་གཉིས་པ་འཆད་པ།"],
[ "སྤང་བའི་ལྟུང་བྱེད་བཅུ་གསུམ་པ་འཆད་པ།"],
[ "སྤང་བའི་ལྟུང་བྱེད་བཅུ་བཞི་པ་འཆད་པ།"],
[ "སྤང་བའི་ལྟུང་བྱེད་བཅྭ་ལྔ་པ་འཆད་པ།"],
[ "སྤང་བའི་ལྟུང་བྱེད་བཅུ་དྲུག་པ་འཆད་པ།"],
[ "སྤང་བའི་ལྟུང་བྱེད་བཅུ་བདུན་པ་འཆད་པ།"],
[ "སྤང་བའི་ལྟུང་བྱེད་བཅྭ་བརྒྱད་པ་འཆད་པ།"],
[ "སྤང་བའི་ལྟུང་བྱེད་བཅུ་དགུ་པ་འཆད་པ།"],
[ "སྤང་བའི་ལྟུང་བྱེད་ཉི་ཤུ་པ་འཆད་པ།"],
[ "སྤང་བའི་ལྟུང་བྱེད་ཉི་ཤུ་གཅིག་པ་འཆད་པ།"],
[ "སྤང་བའི་ལྟུང་བྱེད་ཉི་ཤུ་གཉིས་པ་འཆད་པ།"],
[ "སྤང་བའི་ལྟུང་བྱེད་ཉི་ཤུ་གསུམ་པ་འཆད་པ།"],
[ "སྤང་བའི་ལྟུང་བྱེད་ཉི་ཤུ་བཞི་པ་འཆད་པ།"],
[ "སྤང་བའི་ལྟུང་བྱེད་ཉི་ཤུ་ལྔ་པ་འཆད་པ།"],
[ "སྤང་བའི་ལྟུང་བྱེད་ཉི་ཤུ་དྲུག་པ་འཆད་པ།"],
[ "སྤང་བའི་ལྟུང་བྱེད་ཉི་ཤུ་བདུན་པ་འཆད་པ།"],
[ "སྤང་བའི་ལྟུང་བྱེད་ཉི་ཤུ་བརྒྱད་པ་འཆད་པ།"],
[ "སྤང་བའི་ལྟུང་བྱེད་ཉི་ཤུ་ད་གུ་པ་འཆད་པ།"],
[ "སྤང་བའི་ལྟུང་བྱེད་སུམ་བཅུ་པ་འཆད་པ།"],
[ "སྤང་བའི་ལྟུང་བྱེད་སུམ་བཅུ་གཉིས་པ་འཆད་པ།"],
[ "སྤང་བའི་ལྟུང་བྱེད་སུམ་བཅུ་གསུམ་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་ཀྱི་ཆོས་བརྒྱ་དང་བརྒྱད་ཅུ་འཆད་པ།"],
[ "ལྟུང་བྱེད་དང་པོ་འཆད་པ།"],
[ "ལྟུང་བྱེད་གཉིས་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་གསུམ་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་བཞི་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་ལྔ་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་དྲུག་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་བདུན་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་བརྒྱད་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་དགུ་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་དང་པོའི་ཚིགས་སུ་བཅད་པའི་སྡོམ་འཆད་པ།"],
[ "ལྟུང་བྱེད་གཉིས་པའི་དང་པོ་འཆད་པ།"],
[ "ལྟུང་བྱེད་གཉིས་པའི་གཉིས་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་གཉིས་པའི་གསུམ་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་གཉིས་པའི་བཞི་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་གཉིས་པའི་ལྔ་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་གཉིས་པའི་དྲུག་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་གཉིས་པའི་བདུན་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་གཉིས་པའི་བརྒྱད་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་གཉིས་པའི་དགུ་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་གཉིས་པའི་བཅུ་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་གསུམ་པའི་དང་པོ་འཆད་པ།"],
[ "ལྟུང་བྱེད་གསུམ་པའི་གཉིས་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་གསུམ་པའི་གསུམ་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་གསུམ་པའི་བཞི་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་གསུམ་པའི་ལྔ་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་གསུམ་པའི་དྲུག་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་གསུམ་པའི་བདུན་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་གསུམ་པའི་བརྒྱད་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་གསུམ་པའི་དགུ་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་གསུམ་པའི་བཅུ་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་གསུམ་པའི་བཅུ་གཅིག་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་གསུམ་པའི་བཅུ་གཉིས་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་བཞི་པའི་དང་པོ་འཆད་པ།"],
[ "ལྟུང་བྱེད་བཞི་པའི་གཉིས་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་བཞི་པའི་གསུམ་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་བཞི་པའི་བཞི་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་བཞི་པའི་ལྔ་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་བཞི་པའི་དྲུག་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་བཞི་པའི་བདུན་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་བཞི་པའི་བརྒྱད་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་བཞི་པའི་དགུ་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་བཞི་པའི་བཅུ་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་བཞི་པའི་བཅུ་གཅིག་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་བཞི་པའི་བཅུ་གཉིས་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་བཞི་པའི་ཚིགས་སུ་བཅད་པའི་སྡོམ་འཆད་པ།"],
[ "ལྟུང་བྱེད་ལྔ་པའི་དང་པོ་འཆད་པ།"],
[ "ལྟུང་བྱེད་ལྔ་པའི་གཉིས་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་ལྔ་པའི་གསུམ་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་ལྔ་པའི་བཞི་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་ལྔ་པའི་ལྔ་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་ལྔ་པའི་དྲུག་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་ལྔ་པའི་བདུན་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་ལྔ་པའི་བརྒྱད་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་ལྔ་པའི་དགུ་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་ལྔ་པའི་བཅུ་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་ལྔ་པའི་བཅུ་གཅིག་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་ལྔ་པའི་བཅུ་གཉིས་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་དྲུག་པའི་དང་པོ་འཆད་པ།"],
[ "ལྟུང་བྱེད་དྲུག་པའི་གཉིས་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་དྲུག་པའི་གསུམ་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་དྲུག་པའི་བཞི་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་དྲུག་པའི་ལྔ་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་དྲུག་པའི་དྲུག་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་དྲུག་པའི་བདུན་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་དྲུག་པའི་བརྒྱད་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་དྲུག་པའི་ད་གུ་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་དྲུག་པའི་ཚིགས་སུ་བཅད་པའི་སྡོམ་འཆད་པ།"],
[ "ལྟུང་བྱེད་བདུན་པའི་དང་པོ་འཆད་པ།"],
[ "ལྟུང་བྱེད་བདུན་པའི་གཉིས་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་བདུན་པའི་གསུམ་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་བདུན་པའི་བཞི་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་བདུན་པའི་ལྔ་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་བདུན་པའི་དྲུག་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་བདུན་པའི་བདུན་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་བདུན་པའི་བརྒྱད་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་བདུན་པའི་ཚིགས་སུ་བཅད་པའི་སྡོམ་འཆད་པ།"],
[ "ལྟུང་བྱེད་བརྒྱད་པའི་དང་པོ་འཆད་པ།"],
[ "ལྟུང་བྱེད་བརྒྱད་པའི་གཉིས་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་བརྒྱད་པའི་གསུམ་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་བརྒྱད་པའི་ཚིགས་སུ་བཅད་པའི་སྡོམ་འཆད་པ།"],
[ "ལྟུང་བྱེད་དགུ་པའི་དང་པོ་འཆད་པ།"],
[ "ལྟུང་བྱེད་དགུ་པའི་གཉིས་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་དགུ་པའི་གསུམ་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་དགུ་པའི་ཚིགས་སུ་བཅད་པའི་སྡོམ་འཆད་པ།"],
[ "ལྟུང་བྱེད་བཅུ་པའི་དང་པོ་འཆད་པ།"],
[ "ལྟུང་བྱེད་བཅུ་པའི་གཉིས་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་བཅུ་པའི་གསུམ་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་བཅུ་པའི་བཞི་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་བཅུ་པའི་ཚིགས་སུ་བཅད་པའི་སྡོམ་འཆད་པ།"],
[ "ལྟུང་བྱེད་བཅུ་གཅིག་པའི་དང་པོ་འཆད་པ།"],
[ "ལྟུང་བྱེད་བཅུ་གཅིག་པའི་གཉིས་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་བཅུ་གཅིག་པའི་གསུམ་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་བཅུ་གཅིག་པའི་བཞི་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་བཅུ་གཅིག་པའི་ཚིགས་སུ་བཅད་པའི་སྡོམ་འཆད་པ།"],
[ "ལྟུང་བྱེད་བཅུ་གཉིས་པའི་དང་པོ་འཆད་པ།"],
[ "ལྟུང་བྱེད་བཅུ་གཉིས་པའི་གཉིས་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་བཅུ་གཉིས་པའི་གསུམ་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་བཅུ་གཉིས་པའི་བཞི་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་བཅུ་གཉིས་པའི་ཚིགས་སུ་བཅད་པའི་སྡོམ་འཆད་པ།"],
[ "ལྟུང་བྱེད་བཅུ་གསུམ་པའི་དང་པོ་འཆད་པ།"],
[ "ལྟུང་བྱེད་བཅུ་གསུམ་པའི་གཉིས་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་བཅུ་གསུམ་པའི་གསུམ་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་བཅུ་གསུམ་པའི་བཞི་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་བཅུ་གསུམ་པའི་ཚིགས་སུ་བཅད་པའི་སྡོམ་འཆད་པ།"],
[ "ལྟུང་བྱེད་བཅུ་བཞི་པའི་དང་པོ་འཆད་པ།"],
[ "ལྟུང་བྱེད་བཅུ་བཞི་པའི་གཉིས་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་བཅུ་བཞི་པའི་གསུམ་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་བཅུ་བཞི་པའི་བཞི་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་བཅུ་བཞི་པའི་ལྔ་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་བཅུ་བཞི་པའི་ཚིགས་སུ་བཅད་པའི་སྡོམ་འཆད་པ།"],
[ "ལྟུང་བྱེད་བཅྭ་ལྔ་པའི་དང་པོ་འཆད་པ།"],
[ "ལྟུང་བྱེད་བཅྭ་ལྔ་པའི་གཉིས་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་བཅྭ་ལྔ་པའི་གསུམ་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་བཅྭ་ལྔ་པའི་ཚིགས་སུ་བཅད་པའི་སྡོམ་འཆད་པ།"],
[ "ལྟུང་བྱེད་བཅུ་དྲུག་པའི་དང་པོ་འཆད་པ།"],
[ "ལྟུང་བྱེད་བཅུ་དྲུག་པའི་གཉིས་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་བཅུ་དྲུག་པའི་གསུམ་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་བཅུ་དྲུག་པའི་བཞི་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་བཅུ་དྲུག་པའི་ལྔ་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་བཅུ་དྲུག་པའི་ཚིགས་སུ་བཅད་པའི་སྡོམ་འཆད་པ།"],
[ "ལྟུང་བྱེད་བཅུ་བདུན་པའི་དང་པོ་འཆད་པ།"],
[ "ལྟུང་བྱེད་བཅུ་བདུན་པའི་གཉིས་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་བཅུ་བདུན་པའི་གསུམ་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་བཅུ་བདུན་པའི་བཞི་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་བཅུ་བདུན་པའི་ཚིགས་སུ་བཅད་པའི་སྡོམ་འཆད་པ།"],
[ "ལྟུང་བྱེད་བཅྭ་བརྒྱད་པའི་དང་པོ་འཆད་པ།"],
[ "ལྟུང་བྱེད་བཅྭ་བརྒྱད་པའི་གཉིས་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་བཅྭ་བརྒྱད་པའི་གསུམ་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་བཅྭ་བརྒྱད་པའི་ཚིགས་སུ་བཅད་པའི་སྡོམ་འཆད་པ།"],
[ "ལྟུང་བྱེད་བཅུ་དགུ་པའི་དང་པོ་འཆད་པ།"],
[ "ལྟུང་བྱེད་བཅུ་དགུ་པའི་གཉིས་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་བཅུ་དགུ་པའི་གསུམ་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་བཅུ་དགུ་པའི་བཞི་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་བཅུ་དགུ་པའི་ལྔ་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་བཅུ་དགུ་པའི་ཚིགས་སུ་བཅད་པའི་སྡོམ་འཆད་པ།"],
[ "ལྟུང་བྱེད་ཉི་ཤུ་པའི་དང་པོ་འཆད་པ།"],
[ "ལྟུང་བྱེད་ཉི་ཤུ་པའི་གཉིས་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་ཉི་ཤུ་པའི་བཞི་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་ཉི་ཤུ་པའི་ལྔ་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་ཉི་ཤུ་པའི་དྲུག་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་ཉི་ཤུ་པའི་བདུན་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་ཉི་ཤུ་པའི་བརྒྱད་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་ཉི་ཤུ་པའི་ཚིགས་སུ་བཅད་པའི་སྡོམ་འཆད་པ།"],
[ "ལྟུང་བྱེད་ཉི་ཤུ་གཅིག་པའི་དང་པོ་འཆད་པ།"],
[ "ལྟུང་བྱེད་ཉི་ཤུ་གཅིག་པའི་གཉིས་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་ཉི་ཤུ་གཅིག་པའི་གསུམ་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་ཉི་ཤུ་གཅིག་པའི་ཚིགས་སུ་བཅད་པའི་སྡོམ་འཆད་པ།"],
[ "ལྟུང་བྱེད་ཉི་ཤུ་གཉིས་པའི་དང་པོ་འཆད་པ།"],
[ "ལྟུང་བྱེད་ཉི་ཤུ་གཉིས་པའི་གཉིས་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་ཉི་ཤུ་གཉིས་པའི་གསུམ་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་ཉི་ཤུ་གཉིས་པའི་བཞི་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་ཉི་ཤུ་གཉིས་པའི་ཚིགས་སུ་བཅད་པའི་སྡོམ་འཆད་པ།"],
[ "ལྟུང་བྱེད་ཉི་ཤུ་གསུམ་པའི་དང་པོ་འཆད་པ།"],
[ "ལྟུང་བྱེད་ཉི་ཤུ་གསུམ་པའི་གཉིས་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་ཉི་ཤུ་གསུམ་པའི་གསུམ་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་ཉི་ཤུ་གསུམ་པའི་བཞི་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་ཉི་ཤུ་གསུམ་པའི་ཚིགས་སུ་བཅད་པའི་སྡོམ་འཆད་པ།"],
[ "ལྟུང་བྱེད་ཉི་ཤུ་བཞི་པའི་དང་པོ་འཆད་པ།"],
[ "ལྟུང་བྱེད་ཉི་ཤུ་བཞི་པའི་གཉིས་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་ཉི་ཤུ་བཞི་པའི་གསུམ་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་ཉི་ཤུ་བཞི་པའི་ཚིགས་སུ་བཅད་པའི་སྡོམ་འཆད་པ།"],
[ "ལྟུང་བྱེད་ཉི་ཤུ་ལྔ་པའི་དང་པོ་འཆད་པ།"],
[ "ལྟུང་བྱེད་ཉི་ཤུ་ལྔ་པའི་གཉིས་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་ཉི་ཤུ་ལྔ་པའི་གསུམ་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་ཉི་ཤུ་ལྔ་པའི་བཞི་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་ཉི་ཤུ་ལྔ་པའི་ཚིགས་སུ་བཅད་པའི་སྡོམ་འཆད་པ།"],
[ "ལྟུང་བྱེད་ཉི་ཤུ་དྲུག་པའི་དང་པོ་འཆད་པ།"],
[ "ལྟུང་བྱེད་ཉི་ཤུ་དྲུག་པའི་གཉིས་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་ཉི་ཤུ་དྲུག་པའི་གསུམ་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་ཉི་ཤུ་དྲུག་པའི་བཞི་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་ཉི་ཤུ་དྲུག་པའི་ཚིགས་སུ་བཅད་པའི་སྡོམ་འཆད་པ།"],
[ "ལྟུང་བྱེད་ཉི་ཤུ་བདུན་པའི་དང་པོ་འཆད་པ།"],
[ "ལྟུང་བྱེད་ཉི་ཤུ་བདུན་པའི་གསུམ་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་ཉི་ཤུ་བདུན་པའི་བཞི་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་ཉི་ཤུ་བདུན་པའི་ལྔ་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་ཉི་ཤུ་བདུན་པའི་དྲུག་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་ཉི་ཤུ་བདུན་པའི་བདུན་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་ཉི་ཤུ་བདུན་པའི་བརྒྱད་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་ཉི་ཤུ་བདུན་པའི་དགུ་པ་འཆ་ད་པ།"],
[ "ལྟུང་བྱེད་ཉི་ཤུ་བདུན་པའི་བཅུ་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་ཉི་ཤུ་བདུན་པའི་བཅུ་གཅིག་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་ཉི་ཤུ་བདུན་པའི་ཚིགས་སུ་བཅད་པའི་སྡོམ་འཆད་པ།"],
[ "ལྟུང་བྱེད་ཉི་ཤུ་བརྒྱད་པའི་དང་པོ་འཆད་པ།"],
[ "ལྟུང་བྱེད་ཉི་ཤུ་བརྒྱད་པའི་གཉིས་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་ཉི་ཤུ་བརྒྱད་པའི་གསུམ་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་ཉི་ཤུ་བརྒྱད་པའི་བཞི་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་ཉི་ཤུ་བརྒྱད་པའི་ལྔ་པ་འཆད་པ།"],
[ "ལྟུང་བྱེད་ཉི་ཤུ་བརྒྱད་པའི་ཚིགས་སུ་བཅད་པའི་སྡོམ་འཆད་པ།"],
[ "སོ་སོར་བཤགས་པར་བྱ་བའི་ཆོས་བཅུ་གཅིག་འཆད་པ།"],
[ "སོ་སོར་བཤགས་པར་བྱ་བ་དང་པོ་འཆད་པ།"],
[ "སོ་སོར་བཤགས་པར་བྱ་བ་གཉིས་པ་འཆད་པ།"],
[ "སོ་སོར་བཤགས་པར་བྱ་བ་གསུམ་པ་འཆད་པ།"],
[ "སོ་སོར་བཤགས་པར་བྱ་བ་བཞི་པ་འཆད་པ།"],
[ "སོ་སོར་བཤགས་པར་བྱ་བ་ལྔ་པ་འཆད་པ།"],
[ "སོ་སོར་བཤགས་པར་བྱ་བ་དྲུག་པ་འཆད་པ།"],
[ "སོ་སོར་བཤགས་པར་བྱ་བ་བདུན་པ་འཆད་པ།"],
[ "སོ་སོར་བཤགས་པར་བྱ་བ་བརྒྱད་པ་འཆད་པ།"],
[ "སོ་སོར་བཤགས་པར་བྱ་བ་དགུ་པ་འཆད་པ།"],
[ "སོ་སོར་བཤགས་པར་བྱ་བ་བཅུ་པ་འཆད་པ།"],
[ "སོ་སོར་བཤགས་པར་བྱ་བ་བཅུ་གཅིག་པ་འཆད་པ།"],
[ "བསླབ་པར་བྱ་བའི་ཆོས་མང་པོ་འཆད་པ།"],
[ "རྩོད་པ་ཞི་བར་བྱ་བའི་ཆོས་བདུན་འཆད་པ།"],
[ "ཐ"],
[ "འདུལ་བ་ཕྲན་ཚེགས་ཀྱི་གཞི།"],
[ "ཕྲ་མོའི་སྒོ་དང་པོ། སོ་ཕག་གི་སྡེ་ཚན"],
[ "སོ་ཕག་སོགས་བཤད་པ།"],
[ "སེན་མོ་བཅོས་པ་སོགས་བཤད་པ།"],
[ "ལྷུང་བཟེད་སོགས་བཤད་པ།"],
[ "མེ་ལོང་སྐྱེས་སོགས་བཤད་པ།"],
[ "ཡན་ལག་སོགས་བཤད་པ།"],
[ "ལམ་ཕྲན་སོགས་བཤད་པ།"],
[ "ཆུ་ཚགས་སོགས་བཤད་པ།"],
[ "མོན་སྲན་སྡེའུ་སོགས་བཤད་པ།"],
[ "རྐང་པ་བཀྲུ་བ་སོགས་བཤད་པ།"],
[ "གོས་མདུད་པ་སོགས་བཤད་པ།"],
[ "ཕྲ་མོའི་སྒོ་གཉིས་པ། ཆན་པའི་སྡེ་ཚན"],
[ "ཆན་པས་འདྲེག་སོགས་བཤད་པ།"],
[ "གདུགས་སོགས་བཤད་པ།"],
[ "བེའུ་རས་སོགས་བཤད་པ།"],
[ "རྒྱན་སྤེལ་མ་སོགས་བཤད་པ།"],
[ "ལེན་པ་སོགས་བཤད་པ།"],
[ "ཚོགས་དང་ཁྲུས་ལ་སོགས་པ་བཤད་པ།"],
[ "གཅིན་ལ་སོགས་པ་བཤད་པ།"],
[ "སྒོ་འཕར་བཤད་པ།"],
[ "གསོར་ལ་སོགས་པ་བཤད་པ།"],
[ "སྟེའུ་སོགས་བཤད་པ།"],
[ "ཕྲ་མོའི་སྒོ་གསུམ་པ། ཆོས་གོས་ཀྱི་སྡེཚན"],
[ "ཆོས་གོས་ཀྱི་གདང་སོགས་བཤད་པ།"],
[ "ནང་དང་ཕྱི་རོལ་སོགས་བཤད་པ།"],
[ "བསྐྲད་པ་སོགས་བཤད་པ།"],
[ "ཁང་བཟངས་སོགས་བཤད་པ།"],
[ "ལན་ཚྭ་སོགས་བཤད་པ།"],
[ "གདོང་ཕྱིས་སོགས་བཤད་པ།"],
[ "ཕྱི་བ་སོགས་བཤད་པ།"],
[ "མཁར་ལེན་སོགས་བཤད་པ།"],
[ "སྟན་སོགས་བཤད་པ།"],
[ "སྤུ་གྲི་སོགས་བཤད་པ།"],
[ "ཕྲ་མོའི་སྒོ་བཞི་པ། གནས་བརྟན་གྱི་སྡེཚན"],
[ "གནས་བརྟན་སོགས་བཤད་པ།"],
[ "ར་བ་སོགས་བཤད་པ།"],
[ "ལྷན་པ་སོགས་བཤད་པ།"],
[ "ནད་པ་སོགས་བཤད་པ།"],
[ "རིགས་ངན་སོགས་བཤད་པ།"],
[ "ཕག་སོགས་བཤད་པ།"],
[ "རི་མོ་སོགས་བཤད་པ།"],
[ "ལྷུང་བཟེད་མེད་པ་སོགས་བཤད་པ།"],
[ "གནས་བཅའ་བ་སོགས་བཤད་པ།"],
[ "ཤིང་བསྐྱེད་པ་སོགས་བཤད་པ།"],
[ "ཕྲ་མོའི་སྒོ་ལྔ་པ། ལུས་ཀྱི་སྡེ་ཚན"],
[ "རོ་བསྲེག་པར་བྱ་བ་སོགས་བཤད་པ།"],
[ "གླེང་བ་སོགས་བཤད་པ།"],
[ "སངས་རྒྱས་མཚན་ནས་སྨོས་པ་སོགས་བཤད་པ།"],
[ "སྤང་བ་སོགས་བཤད་པ།"],
[ "ང་འདས་ནས་འདི་ལ་བྱིན་ཅིག་སོགས་བཤད་པ།"],
[ "མཚམས་ཀྱི་ཕྱི་རོལ་སོགས་བཤད་པ།"],
[ "དགེ་སློང་བགྲང་བར་བྱ་བ་སོགས་བཤད་པ།"],
[ "དགེ་ཚུལ་གྱི་ཁྲིའུ་སོགས་བཤད་པ།"],
[ "ཚུལ་ཤིང་བྲིམས་པ་སོགས་བཤད་པ།"],
[ "རུང་བ་མི་ཡིན་པ་ལྔ་སོགས་བཤད་པ།"],
[ "ཕྲ་མོའི་སྒོ་དྲུག་པ། རྒྱུས་པའི་སྡེ་ཚན"],
[ "རྒྱུས་པ་སོགས་བཤད་པ།"],
[ "རབ་སྣང་སོགས་བཤད་པ།"],
[ "འཚོ་བྱེད་སོགས་བཤད་པ།"],
[ "ཞི་བ་སོགས་བཤད་པ།"],
[ "བ་ལང་སྐྱོང་སོགས་བཤད་པ།"],
[ "ད"],
[ "བ་ལང་སྐྱོང་སོགས་བཤད་པ།(སྨད)"],
[ "དྲག་ཤུལ་ཅན་སོགས་བཤད་པ།"],
[ "བྲན་ཅན་སོགས་བཤད་པ།"],
[ "བཙའ་ཞུགས་པ་སོགས་བཤད་པ།"],
[ "འཕྱན་པ་སོགས་བཤད་པ།"],
[ "མདུན་དུ་འགྲོ་བར་མི་བྱ་བ་སོགས་བཤད་པ།"],
[ "ཚོང་དཔོན་གྱིས་ཀྱང་ཟས་ལྷག་མ་ཞེས་སོགས་བཤད་པ"],
[ "དགེ་སློང་ལྷག་མ་མི་རུང་སྟེ་ཞེས་སོགས་བཤད་པ།"],
[ "བཙོག་པའི་གནས་སུ་མི་དོར་བ་སོགས་བཤད་པ།"],
[ "ཕྲ་མོའི་སྒོ་བདུན་པ། འགྱོད་པའི་སྡེ་ཚན"],
[ "ཐེ་ཚོམ་སོགས་བཤད་པ།"],
[ "སང་ཀཱག་ཀྵི་སོགས་བཤད་པ།"],
[ "མཚན་གཉིས་སོགས་བཤད་པ།"],
[ "མཚན་མ་ཙམ་སོགས་བཤད་པ།"],
[ "དགེ་སློང་ཕས་ལས་བརྗོད་པ་སོགས་བཤད་པ།"],
[ "ཆང་འཚོང་མ་སོགས་བཤད་པ།"],
[ "དགེ་སློང་མ་ལས་དགེ་སློང་ནང་དུ་བཞག་པ་སོགས་བཤད་པ།"],
[ "ཕྱི་རོལ་དགེ་སློང་བཟོད་མི་གསོལ་ཞེས་སོགས་བཤད་པ།"],
[ "ལུས་ལ་ཕ་གུས་ཕྱི་བར་མི་བྱ་བ་སོགས་བཤད་པ།"],
[ "ཕྲ་མོའི་སྒོ་བརྒྱད་པ། དབྱུང་བའི་སྡེ་ཚན"],
[ "དགེ་སློང་མ་ཡི་བཀུར་སྟི་བྲི་བ་སོགས་བཤད་པ།"],
[ "དགེ་སློང་མས་བཟོད་པ་གསོལ་པ་སོགས་བཤད་པ།"],
[ "སྒོ་ཡི་དྲུང་ན་འཁོད་པ་སོགས་བཤད་པ།"],
[ "མི་འབྲོས་པར་བསྒོ་བ་སོགས་བཤད་པ།"],
[ "ཁར་བའི་སྣོད་སོགས་བཤད་པ།"],
[ "བུད་མེད་ཆུ་འགྲམ་ཕྱེ་མས་མིན་ཞེས་སོགས་བཤད་པ།"],
[ "བུད་མེད་གར་དང་བྲེལ་བ་དང་ཞེས་སོགས་བཤད་པ།"],
[ "བརྟགས་ནས་འགྲོ་བར་བྱ་བ་སོགས་བཤད་པ།"],
[ "སྣམ་སྦྱར་ཅི་རིགས་བགོ་བ་སོགས་བཤད་པ།"],
[ "མལ་ན་སྦྲུལ་ནག་ཉལ་བ་སོགས་བཤད་པ།"],
[ "ངག་ལྡན་གྱིས་ཞུས་པ་སོགས་བཤད་པ།"],
[ "སྟོན་པ་དང་འདུལ་བ་སོགས་བཤད་པ།"],
[ "ཙ་པ་ལ་སོགས་བཤད་པ།"],
[ "ན"],
[ "འདུལ་བ་གཞུང་བླ་མ།"],
[ "ཕམ་པ་འཆད་པ"],
[ "མི་ཚངས་པར་སྤྱོད་པའི་ཕམ་པ"],
[ "མ་བྱིན་པར་ལེན་པའི་ཕམ་པ"],
[ "སྲོག་གཅོད་པའི་ཕམ་པ"],
[ "མིའི་ཆོས་བླ་མར་གྱུར་པའི་ཕམ་པ"],
[ "དགེ་འདུན་ལྷག་མ་འཆད་པ"],
[ "ཁུ་བ་འབྱིན་པའི་དགེ་འདུན་ལྷག་མ"],
[ "རེག་པའི་དགེ་འདུན་ལྷག་མ"],
[ "གནས་ངན་ལེན་གྱི་ཚིག་སྨྲ་བ་དང་བསྙིན་བཀུར་བསྔགས་པའི་དགེ་འདུན་ལྷག་མ"],
[ "སྨྱན་བྱེད་པའི་དགེ་འདུན་ལྷག་མ"],
[ "ཁང་པ་དང་གཙུག་ལག་ཁང་གི་དགེ་འདུན་ལྷག་མ"],
[ "གཞི་མེད་པར་སྐུར་པ་འདེབས་པ་དང་གཞན་གྱི་ཆ་དང་མཐུན་པ་མ་ཡིན་པའི་དགེ་འདུན་ལྷག་མ"],
[ "དབྱེན་བྱེད་པའི་དགེ་འདུན་ལྷག་མ"],
[ "མ་ངེས་པ་དང་ལྡན་པ་འཆད་པ"],
[ "སྤང་བའི་ལྟུང་བྱེད་འཆད་པ"],
[ "འཆང་བའི་སྤང་བའི་ལྟུང་བྱེད"],
[ "འབྲལ་བའི་སྤང་བའི་ལྟུང་བྱེད"],
[ "འཇོག་པའི་སྤང་བའི་ལྟུང་བྱེད"],
[ "འཁྲུར་འཇུག་པའི་སྤང་བའི་ལྟུང་བྱེད"],
[ "ལེན་པའི་སྤང་བའི་ལྟུང་བྱེད"],
[ "སློང་བའི་སྤང་བའི་ལྟུང་བྱེད"],
[ "སློང་བར་རིགས་པའི་སྤང་བའི་ལྟུང་བྱེད"],
[ "སྤགས་པ་སློང་བའི་སྤང་བའི་ལྟུང་བྱེད"],
[ "སོ་སོ་ནས་སྤགས་པ་སློང་བའི་སྤང་བའི་ལྟུང་བྱེད"],
[ "སྐུར་པའི་སྤང་བའི་ལྟུང་བྱེད"],
[ "སྲིན་བལ་གྱི་སྤང་བའི་ལྟུང་བྱེད"],
[ "བལ་ན་ག་པོ་འབའ་ཞིག་དང་ཆ་གཉིས་བསྲེས་པའི་སྤང་བའི་ལྟུང་བྱེད"],
[ "ལོ་དྲུག་ཏུ་བཅང་བའི་སྤང་བའི་ལྟུང་བྱེད"],
[ "མཐོ་གང་གི་སྤང་བའི་ལྟུང་བྱེད"],
[ "བལ་ཐོགས་པའི་སྤང་བའི་ལྟུང་བྱེད"],
[ "བལ་རྣེལ་དུ་འཇུག་པའི་སྤང་བའི་ལྟུང་བྱེད"],
[ "གསེར་དངུལ་ལ་རེག་པའི་སྤང་བའི་ལྟུང་བྱེད"],
[ "མངོན་མཚན་ཅན་གྱི་སྤྱོད་པ་དང་ཉོ་ཚོང་བྱེད་པའི་སྤང་བའི་ལྟུང་བྱེད"],
[ "ལྷུང་བཟེད་འཆང་བའི་སྤང་བའི་ལྟུང་བྱེད"],
[ "ལྷུང་བཟེད་འཚོལ་བའི་སྤང་བའི་ལྟུང་བྱེད"],
[ "འཐག་ཏུ་འཇུག་པའི་སྤང་བའི་ལྟུང་བྱེད"],
[ "འཐག་པ་བསྐྱེད་པའི་སྤང་བའི་ལྟུང་བྱེད"],
[ "འཕྲོག་པའི་སྤང་བའི་ལྟུང་བྱེད"],
[ "བརྟད་པ་ལས་བྱུང་བའི་སྤང་བའི་ལྟུང་བྱེད"],
[ "ཞག་བདུན་ལ་འབྲལ་བའི་སྤང་བའི་ལྟུང་བྱེད"],
[ "དབྱར་གྱི་རས་ཆེན་གྱི་སྤང་བའི་ལྟུང་བྱེད"],
[ "བསྔོས་པ་ལས་བསྒྱུར་བའི་སྤང་བའི་ལྟུང་བྱེད"],
[ "གསོག་འཇོག་གི་སྤང་བའི་ལྟུང་བྱེད"],
[ "ལྟུང་བྱེད་འབའ་ཞིག་པ་འཆད་པ"],
[ "བརྫུན་དུ་སྨྲ་བའི་ལྟུང་བྱེད"],
[ "སྐྱོན་ནས་སྨྲ་བ་དང་ཕྲ་མ་བྱེད་པའི་ལྟུང་བྱེད"],
[ "སྐྲོ་སྔོགས་བྱེད་པའི་ལྟུང་བྱེད"],
[ "སྟོན་པའི་ལྟུང་བྱེད"],
[ "འདོན་པའི་ལྟུང་བྱེད"],
[ "གནས་ངན་ལེན་དང་མིའི་ཆོས་བླ་མ་བརྫོད་པའི་ལྟུང་བྱེད"],
[ "སྐུར་པ་འདེབས་པའི་ལྟུང་བྱེད"],
[ "ཁྱད་དུ་གསོད་པའི་ལྟུང་བྱེད"],
[ "ས་བོན་དང་སྐྱེ་བ་འཇིག་པའི་ལྟུང་བྱེད"],
[ "འཕྱ་བའི་ལྟུང་བྱེད"],
[ "བསྒོ་བ་རྣ་ལ་གཟོན་པའི་ལྟུང་བྱེད"],
[ "གནས་མལ་དང་གདིང་བའི་ལྟུང་བྱེད"],
[ "སྐྲོད་པའི་ལྟུང་བྱེད"],
[ "ཕྱིས་གནོན་གྱི་ལྟུང་བྱེད"],
[ "རྩ་བ་འབྱུང་བ་ལ་འདུག་པ་དང་སྲོག་ཆགས་དང་བཅས་པ་ལ་སྦྱོད་པའི་ལྟུང་བྱེད"],
[ "གཙུག་ལག་ཁང་གི་ལྟུང་བྱེད"],
[ "འདུལ་བ་གཞུང་དམ་པ།"],
[ "ཕམ་པར་འགྱུར་བ་རྣམས་བཤད་པ"],
[ "མི་ཚངས་པར་སྤྱོད་པའི་ཕམ་པ"],
[ "མ་བྱིན་ལེན་གྱི་ཕམ་པ"],
[ "གསོད་པའི་ཕམ་པ"],
[ "བརྫུན་དུ་སྨྲ་བའི་ཕམ་པ"],
[ "དགེ་འདུན་ལྷག་མ་རྣམས་བཤད་པ"],
[ "ཁུ་བ་འབྱིན་པའི་དགེ་འདུན་ལྷག་མ"],
[ "ལུས་ཀྱིས་རེག་པའི་དགེ་འདུན་ལྷག་མ"],
[ "སྤྲོད་པ་ལས་བྱུང་བ་དང་ལྡན་པ་སྨྲ་བ་དང་ཀུན་ཏུ་སྦྱོད་པས་བསྔགས་པའི་དགེ་འདུན་ལྷག་མ"],
[ "སྨྱན་བྱེད་པའི་དགེ་འདུན་ལྷག་མ"],
[ "ཁང་པ་དང་གཙུག་ལག་ཁང་གི་དགེ་འདུན་ལྷག་མ"],
[ "གཞི་མེད་པར་སྐུར་པ་འདེབས་པ་དང་གཞན་གྱི་ཆ་མ་ཡིན་པ་དང་མཐུན་པའི་དགེ་འདུན་ལྷག་མ"],
[ "བཀའ་བློ་མི་བདེ་བའི་དགེ་འདུན་ལྷག་མ"],
[ "མ་ངེས་པའི་ཆོས་གཉིས་བཤད་པ"],
[ "སྤང་བའི་ལྟུང་བྱེད་རྣམས་བཤད་པ"],
[ "འཆང་བའི་སྤང་བ"],
[ "འབྲལ་བའི་སྤང་བ"],
[ "འཇོག་པའི་སྤང་བ"],
[ "འཁྲུར་འཇུག་པའི་སྤང་བ"],
[ "ལེན་པའི་སྤང་བ"],
[ "སློང་བའི་སྤང་བ"],
[ "སློང་བར་རིགས་པའི་སྤང་བ"],
[ "སྤགས་པ་ལས་ལྷག་པ་སློང་བའི་སྤང་བ"],
[ "སོ་སོ་ནས་སྤགས་པ་ལས་ལྷག་པ་སློང་བའི་སྤང་བ"],
[ "སྐུར་པའི་སྤང་བ"],
[ "སྲིན་བལ་གྱི་སྤང་བ་དང་བལ་ནག་པོ་འབའ་ཞིག་དང་ཆ་གཉིས་བསྲེ་བའི་སྤང་བ"],
[ "ལོ་དྲུག་ཏུ་བ་ཅང་བའི་སྤང་བ"],
[ "མཐོ་གང་གི་སྤང་བ"],
[ "བལ་ཐོགས་པའི་སྤང་བ"],
[ "བལ་མེལ་དུ་འཇུག་པའི་སྤང་བ"],
[ "གསེར་དངུལ་ལ་རེག་པའི་སྤང་བ"],
[ "མངོན་མཚན་ཅན་གྱི་སྤང་བ་དང་ཉོ་ཆོང་བྱེད་པའི་སྤང་བ"],
[ "ལྷུང་བཟེད་འཆང་བའི་སྤང་བ"],
[ "ལྷུང་བཟེད་ཆོལ་བའི་སྤང་བ"],
[ "འཐག་ཏུ་འཇུག་པའི་སྤང་བ"],
[ "འཐག་པ་བསྐྱེད་པའི་སྤང་བ"],
[ "འཕྲོག་པའི་སྤང་བ"],
[ "བརྟད་པ་ལས་བྱུང་བའི་སྤང་བ"],
[ "ཞག་བདུན་གྱི་འབྲལ་བའི་སྤང་བ"],
[ "དབྱར་གྱི་རས་ཆེན་གྱི་སྤང་བ"],
[ "བསྔོས་པ་ལས་བསྒྱུར་བའི་སྤང་བ"],
[ "གསོག་འཇོག་གི་སྤང་བ"],
[ "ལྟུང་བྱེད་འབའ་ཞིག་ཏུ་འགྱུར་བ་རྣམས་བཤད་པ"],
[ "བརྫུན་དུ་སྨྲ་བའི་ལྟུང་བྱེད"],
[ "མིའི་སྐྱོན་ནས་སྨྲ་བ་དང་དགེ་སློང་ལ་ཕྲ་མ་བྱེད་པའི་ལྟུང་བྱེད"],
[ "སྐྱོ་སྡོགས་བྱེད་པའི་ལྟུང་བྱེད"],
[ "སྟོན་པའི་ལྟུང་བྱེད"],
[ "འདོན་པའི་ལྟུང་བྱེད"],
[ "གནས་ངན་ལེན་དང་མིའི་མཆོག་བླ་མ་བརྫོད་པའི་ལྟུང་བྱེད"],
[ "སྐུར་པ་འདེབས་པའི་ལྟུང་བྱེད"],
[ "བསླབ་པ་ཁྱད་དུ་གསོད་པའི་ལྟུང་བྱེད"],
[ "ས་བོན་དང་སྐྱེ་བ་འཇིག་པའི་ལྟུང་བྱེད"],
[ "འཕྱ་བའི་ལྟུང་བྱེད"],
[ "བསྒོ་བ་རྣལ་གཟོན་པའི་ལྟུང་བྱེད"],
[ "གནས་མལ་དང་འདིང་བའི་ལྟུང་བྱེད"],
[ "སྐྲོད་པའི་ལྟུང་བྱེད"],
[ "ཕྱིས་གནོན་གྱི་ལྟུང་བྱེད"],
[ "རྩ་བ་འབྱུང་བ་ལ་འདུག་པ་དང་སྲོག་ཆགས་དང་བཅས་པ་ལ་སྦྱོད་པའི་ལྟུང་བྱེད"],
[ "གཙུག་ལག་ཁང་གི་ལྟུང་བྱེད"],
[ "མ་བསྐོས་པར་སྟོན་པའི་ལྟུང་བྱེད"],
[ "ཉི་མ་ནུབ་ཀྱི་བར་དུ་སྟོན་པའི་ལྟུང་བྱེད"],
[ "ཟས་ཅུང་ཟད་ཙམ་གྱི་ཕྱིར་སྟོན་པའི་ལྟུང་བྱེད"],
[ "གོས་སྦྱིན་པའི་ལྟུང་བྱེད"],
[ "གོས་བྱེད་པའི་ལྟུང་བྱེད"],
[ "དགེ་སློང་མ་དང་འགྲོན་ལམ་དུ་འཇུག་པ་དང་ལྷན་ཅིག་གྲུར་འཇུག་པའི་ལྟུང་བྱེད"],
[ "གཅིག་པུ་འདུག་པ་དང་གཅིག་པུ་འགྲེང་བའི་ལྟུང་བྱེད"],
[ "དགེ་སློང་མས་སྦྱོར་དུ་བཅུག་པ་ཟ་བའི་ལྟུང་བྱེད"],
[ "ཡང་ཡང་ཟ་བའི་ལྟུང་བྱེད"],
[ "འདུག་གནས་སུ་ཟ་བའི་ལྟུང་བྱེད"],
[ "ལྷུང་བཟེད་དོ་གསུམ་ཙམ་ལས་ལྷག་པར་ལེན་པའི་ལྟུང་བྱེད"],
[ "སྟན་གཅིག་པའི་ཟས་ཀྱི་ལྟུང་བྱེད"],
[ "སྤངས་པ་ལ་སྟོབས་པའི་ལྟུང་བྱེད"],
[ "འདུས་ཤིང་ཟ་བའི་ལྟུང་བྱེད"],
[ "དུས་མ་ཡིན་པར་ཟ་བའི་ལྟུང་བྱེད"],
[ "གསོག་འཇོག་གི་ལྟུང་ཁྱེད"],
[ "བྱིན་ལེན་མ་བྱས་པར་ཟ་བའི་ལྟུང་བྱེད"],
[ "བསོད་པ་སློང་བ་དང་སྲོག་ཆགས་དང་བ་ཅས་པའི་ཆུ་ལ་སྤྱོད་པའི་ལྟུང་བྱེད"],
[ "ཉལ་པོ་བྱེད་པར་ཤོམ་པའི་ཁྱིམ་ན་འདུག་པ་དང་འགྲེང་བའི་ལྟུང་བྱེད"],
[ "གཅེར་བུ་ལ་སྦྱིན་པའི་ལྟུང་བྱེད"],
[ "དམག་ལ་ལྟ་བ་དང་དམག་གི་ནང་ན་གནས་པ་དང་དཔུང་གི་ཡན་ལག་ཉམས་སུ་མྱོང་བར་བྱེད་པའི་ལྟུང་བྱེད"],
[ "རྡེག་པ་དང་གཟས་པའི་ལྟུང་བྱེད"],
[ "གནས་ངན་ལེན་འཆབ་པའི་ལྟུང་བྱེད"],
[ "ཟན་གཅོད་དུ་འཇུད་པའི་ལྟུང་བྱེད"],
[ "མེ་ལ་རེག་པའི་ལྟུང་བྱེད"],
[ "འདུན་པ་ཕྱིར་བསྒྱུར་བའི་ལྟུང་བྱེད"],
[ "རྫོགས་པར་མ་བསྙིན་པ་དང་ལྷན་ཅིག་ཉལ་བའི་ལྟུང་བྱེད"],
[ "ལྟ་བའི་རྣམ་པ་མི་གཏོང་བའི་ལྟུང་བྱེད"],
[ "སྤངས་པའི་རྗེས་སུ་ཕྱོགས་པ་དང་བསྙིལ་བ་སྡུད་པའི་ལྟུང་བྱེད"],
[ "ཁ་མ་བསྒྱུར་བའི་གོས་རྒྱོན་པའི་ལྟུང་བྱེད"],
[ "ལོངས་པའི་གཞིར་གཏོགས་པའི་ལྟུང་བྱེད"],
[ "ཁྲུས་བྱེད་པ་དང་དུད་འགྲོ་གསོད་པའི་ལྟུང་བྱེད"],
[ "འརྒྱོད་པ་སྐྱེས་པའི་ལྟུང་བྱེད"],
[ "ག་ག་ཚིལ་བྱེད་པའི་ལྟུང་བྱེད"],
[ "ཆུ་ལ་རྩེ་བའི་ལྟུང་བྱེད"],
[ "བུད་མེད་དང་ལྷན་ཅིག་ཉལ་བའི་ལྟུང་བྱེད"],
[ "སྔངས་པར་བྱེད་པའི་ལྟུང་བྱེད"],
[ "སྤེད་པའི་ལྟུང་བྱེད"],
[ "བྱིན་པ་ལ་ཉེ་བར་འཚོ་བ་དང་སྐུར་པ་འདེབས་པའི་ལྟུང་བྱེད"],
[ "བུད་མེད་དང་ལྷན་ཅིག་འགྲོ་བའི་ལྟུང་བྱེད"],
[ "རྐུན་མ་དང་ལྷན་ཅིག་འགྲོ་བའི་ལྟུང་བྱེད"],
[ "མ་ལོན་པར་རྫོགས་པར་བསྙིན་པར་བྱེད་པའི་ལྟུང་བྱེད"],
[ "ས་རྐོ་བའི་ལྟུང་བྱེད"],
[ "མགྲོན་དུ་གཉེར་བ་ལས་རིང་དུ་འདུག་པའི་ལྟུང་བྱེད"],
[ "བསླབ་པ་ལ་ཉེ་བར་འཇོག་པའི་ལྟུང་བྱེད"],
[ "ཉན་རྣ་བ་ལས་གྱུར་པའི་ལྟུང་བྱེད"],
[ "མི་སྨྲ་བར་འགྲོ་བའི་ལྟུང་བྱེད"],
[ "མ་གུས་པའི་ཚུལ་གྱི་ལྟུང་བྱེད"],
[ "མྱོས་པར་འགྱུར་བ་འཐུང་བའི་ལྟུང་བྱེད"],
[ "དུས་མ་ཡིན་པར་འགྲོ་བའི་ལྟུང་བྱེད"],
[ "གྲོང་རྒྱུ་བའི་ལྟུང་བྱེད"],
[ "རྒྱལ་པོའི་ཕོ་བྲང་དུ་ནུབ་མོ་འགྲོ་བའི་ལྟུང་བྱེད"],
[ "བསླབ་པའི་གཞིའི་དངོས་པོ་ལ་ཁྱད་དུ་གསོད་པའི་ལྟུང་བྱེད"],
[ "ཁབ་རལ་བཅོས་པའི་ལྟུང་བྱེད"],
[ "ཁྲི་རྐང་འཆོས་པ་དང་ཤིང་བལ་གྱི་གོས་པར་བྱས་པ་གདིང་བ་ལས་གྱུར་པ་གཡན་པ་དགབ་པ་ལས་གྱུར་པ་དབྱར་གྱི་རས་ཆེན་ལས་གྱུར་པ་བདེ་བར་གཤེགས་པའི་ཆོས་གོས་ཀྱི་ཚད་ལས་གྱུར་པ་ལ་སོགས་པའི་ལྟུང་བྱེད"],
[ "སོ་སོར་བཤགས་པར་བྱ་བ་ནམས་བཤད་པ"],
[ "སོ་སོར་བཤགས་པར་བྱ་བ་དང་པོ"],
[ "སོ་སོར་བཤགས་པར་བྱ་བ་གཉིས་པ"],
[ "སོ་སོར་བཤགས་པར་བྱ་བ་གསུམ་པ"],
[ "སོ་སོར་བཤགས་པར་བྱ་བ་བཞི་པ"],
[ "བསྙེན་པར་རྗོགས་པའི་དངོས་པ་བཤད་པ"],
[ "གསོ་སྦྱོང་གི་དངོས་པོ་བཤད་པ"],
[ "སྐབས་འབྱེད་པའི་དངོས་པོ་བཤད་པ"],
[ "དབྱར་གྱི་དངོས་པོ་བཤད་པ"],
[ "པགས་པའི་དངོས་པོ་བཤད་པ"],
[ "སྨན་གྱི་དངོས་པོ་བཤད་པ"],
[ "གོས་ཀྱི་དངོས་པོ་བཤད་པ"],
[ "གཏན་པའི་དངོས་པོ་བཤད་པ"],
[ "ཡུལ་ཀཽ་ཤམྦཱི་ཀའི་དངོས་པོ་བཤད་པ"],
[ "དམར་སྐྱའི་དངོས་པོ་བཤད་པ"],
[ "གང་ཟག་གི་དངོས་པོ་དང་། ཆད་པའི་དངོས་པོ་བཤད་པ"],
[ "གསོ་སྦྱོང་དགག་པའི་དངོས་པོ་བཤད་པ"],
[ "མལ་སྟན་གྱི་དངོས་པོ་བཤད་པ"],
[ "རྩོད་བའི་དངོས་པོ་བཤད་པ"],
[ "དགེ་འདུན་གྱི་དབྱེན་གྱི་དངོས་པོ་བཤད་པ"],
[ "འདུལ་བར་བྱེད་པ་བཤད་པ།(སྟོད)"],
[ "པ"],
[ "འདུལ་བར་བྱེད་པ་བཤད་པ།(སྨད)"],
[ "གཅིག་ནས་འཛེགས་པ་བཤད་པ"],
[ "གཅིག་པ་བཤད་པ"],
[ "འདུལ་བ་གཅིག་པོ་ཡན་ཆད་པའི་སྒོ་དང་པོ་བཤད་པཤད་པ"],
[ "སྒོ་གཉིས་པ་བཤད་པ"],
[ "སྒོ་གསུམ་པ་བཤད་པ"],
[ "ལྔ་ཚན་སྐོར་བཤད་པ"],
[ "འདུལ་བ་ལས་བྱུང་བ་རྣམ་པ་བཅུ་དྲུག་བཤད་པ"],
[ "གླེང་གཞི་རྣམས་བཤད་པ"],
[ "གླེང་གཞིའི་སྒོ་དང་པོ་བཤད་པ"],
[ "གླེང་གཞིའི་སྒོ་ཐོག་མའི་ཚིགས་སུ་བཅད་པ་དང་པོ་བཤད་པ"],
[ "གླེང་གཞིའི་སྒོ་དང་པོའི་ཚིགས་སུ་བཅད་པ་གཉིས་པ་བཤད་པ"],
[ "གླེང་གཞིའི་སྒོ་དང་པོའི་ཚིགས་སུ་བཅད་པ་གསུམ་པ་བཤད་པ"],
[ "གླེང་གཞིའི་སྒོ་དང་པོའི་ཚིགས་སུ་བཅད་པ་བཞི་པ་བཤད་པ"],
[ "གླེང་གཞིའི་སྒོ་དང་པོའི་ཚིགས་སུ་བཅད་པ་ལྔ་པ་བཤད་པ"],
[ "གླེང་གཞིའི་སྒོ་དང་པོའི་ཚིགས་སུ་བཅད་པ་དྲུག་པ་བཤད་པ"],
[ "གླེང་གཞིའི་སྒོ་དང་པོའི་ཚིགས་སུ་བཅད་པ་བདུན་པ་བཤད་པ"],
[ "གླེང་གཞིའི་སྒོ་དང་པོའི་ཚིགས་སུ་བཅད་པ་བརྒྱད་པ་བཤད་པ"],
[ "གླེང་གཞིའི་སྒོ་དང་པོའི་ཚིགས་སུ་བཅད་པ་དགུ་པ་བཤད་པ"],
[ "གླེང་གཞིའི་སྒོ་དང་པོའི་ཚིགས་སུ་བཅད་པ་བཅུ་པ་བཤད་པ"],
[ "གླེང་གཞིའི་སྒོ་གཉིས་པ་བཤད་པ"],
[ "གླེང་གཞིའི་སྒོ་གཉིས་པ་སྟེ་ཚིགས་སུ་བཅད་པ་དང་པོ་བཤད་པ"],
[ "གླེང་གཞིའི་སྒོ་གཉིས་པའི་མདོའི་ཚིགས་སུ་བཅད་པ་གཉིས་པ་བཤད་པ"],
[ "གླེང་གཞིའི་སྒོ་གཉིས་པའི་མདོའི་ཚིགས་སུ་བཅད་པ་གསུམ་པ་བཤད་པ"],
[ "གླེང་གཞིའི་སྒོ་གཉིས་པའི་མདོའི་ཚིགས་སུ་བཅད་པ་བཞི་པ་བཤད་པ"],
[ "གླེང་གཞིའི་སྒོ་གཉིས་པའི་མདོའི་ཚིགས་སུ་བཅད་པ་ལྔ་པ་བཤད་པ"],
[ "གླེང་གཞིའི་སྒོ་གཉིས་པའི་མདོའི་ཚིགས་སུ་བཅད་པ་དྲུག་པ་བཤད་པ"],
[ "གླེང་གཞིའི་སྒོ་གཉིས་པའི་མདོའི་ཚིགས་སུ་བཅད་པ་བརྒྱད་པ་བཤད་པ"],
[ "གླེང་གཞིའི་སྒོ་གཉིས་པ་སྟེ་ཚིགས་ས་བཅད་པ་དགུ་པ་བཤད་པ།"],
[ "གླེང་གཞིའི་སྒོ་གཉིས་པའི་མདོའི་ཚིགས་སུ་བཅད་པ་བཅུ་པ་བཤད་པ"],
[ "གླེང་གཞིའི་སྒོ་གསུམ་པ་བཤད་པ"],
[ "གླེང་གཞིའི་སྒོ་གསུམ་པའི་མདོའི་ཚིགས་སུ་བཅད་པ་དང་པོ་བཤད་པ"],
[ "གླེང་གཞིའི་སྒོ་གསུམ་པའི་མདོའི་ཚིགས་སུ་བཅད་པ་གཉིས་པ་བཤད་པ"],
[ "གླེང་གཞིའི་སྒོ་གསུམ་པའི་མདོའི་ཚིགས་སུ་བཅད་པ་གསུམ་པ་བཤད་པ"],
[ "གླེང་གཞིའི་སྒོ་གསུམ་པའི་མདོའི་ཚིགས་སུ་བཅད་པ་བཞི་པ་བཤད་པ"],
[ "གླེང་གཞིའི་སྒོ་གསུམ་པའི་མདོའི་ཚིགས་སུ་བཅད་པ་ལྔ་པ་བཤད་པ"],
[ "གླེང་གཞིའི་སྒོ་གསུམ་པའི་མདོའི་ཚིགས་སུ་བཅད་པ་དྲུག་པ་བཤད་པ"],
[ "གླེང་གཞིའི་ནང་ནས་སྒོ་གསུམ་པའི་མདོའི་ཚིགས་སུ་བཅད་པ་བདུན་པ་བཤད་པ"],
[ "གླེང་གཞིའི་ནང་ནས་སྒོ་གསུམ་པའི་མདོའི་ཚིགས་སུ་བཅད་པ་བརྒྱད་པ་བཤད་པ"],
[ "གླེང་གཞིའི་ནང་ནས་སྒོ་གསུམ་པའི་མདོའི་ཚིགས་སུ་བཅད་པ་དགུ་པ་བཤད་པ"],
[ "གླེང་གཞིའི་ནང་ནས་སྒོ་གསུམ་པའི་མདོའི་ཚིགས་སུ་བཅད་པ་བཅུ་པ་བཤད་པ།"],
[ "གླེང་གཞིའི་སྒོ་བཞི་པ་བཤད་པ"],
[ "གླེང་གཞིའི་ནང་ནས་སྒོ་བཞི་པའི་མདོའི་ཚིགས་སུ་བཅད་པ་དང་པོ་བཤད་པ"],
[ "གླེང་གཞིའི་ནང་ནས་སྒོ་བཞི་པའི་མདོའི་ཚིགས་སུ་བཅད་པ་གཉིས་པ་བཤད་པ"],
[ "གླེང་གཞིའི་ནང་ནས་སྒོ་བཞི་པའི་མདོའི་ཚིགས་སུ་བཅད་པ་གསུམ་པ་བཤད་པ"],
[ "གླེང་གཞིའི་ནང་ནས་སྒོ་བཞི་པའི་མདོའི་ཚིགས་སུ་བཅད་པ་བཞི་པ་བཤད་པ"],
[ "གླེང་གཞིའི་ནང་ནས་སྒོ་བཞི་པའི་མདོའི་ཚིགས་སུ་བཅད་པ་ལྔ་པ་བཤད་པ"],
[ "གླེང་གཞིའི་ནང་ནས་སྒོ་བཞི་པའི་མདོའི་ཚིགས་སུ་བཅད་པ་དྲུག་པ་བཤད་པ"],
[ "གླེང་གཞིའི་ནང་ནས་སྒོ་བཞི་པའི་མདོའི་ཚིགས་སུ་བཅད་པ་བདུན་པ་བཤད་པ"],
[ "གླེང་གཞིའི་སྒོ་བཞི་པའི་མདོའི་ཚིགས་སུ་བཅད་པ་བརྒྱད་པ་བཤད་པ"],
[ "གླེང་གཞིའི་སྒོ་བཞི་པའི་མདོའི་ཚིགས་སུ་བཅད་པ་དགུ་པ་བཤད་པ"],
[ "གླེང་གཞིའི་སྒོ་བཞི་པའི་མདོའི་ཚིགས་སུ་བཅད་པ་བཅུ་པ་བཤད་པ"],
[ "གླེང་གཞིའི་སྒོ་ལྔ་པ་བཤད་པ"],
[ "གླེང་གཞིའི་སྒོ་ལྔ་པའི་མདོའི་ཚིགས་སུ་བཅད་པ་དང་པོ་བཤད་པ"],
[ "གླེང་གཞིའི་སྒོ་ལྔ་པའི་མདོའི་ཚིགས་སུ་བཅད་པ་གཉིས་པ་བཤད་པ"],
[ "གླེང་གཞིའི་སྒོ་ལྔ་པའི་མདོའི་ཚིགས་སུ་བཅད་པ་གསུམ་པ་བཤད་པ"],
[ "གླེང་གཞིའི་སྒོ་ལྔ་པའི་མདོའི་ཚིགས་སུ་བཅད་པ་བཞི་པ་བཤད་པ"],
[ "གླེང་གཞིའི་སྒོ་ལྔ་པའི་མདོའི་ཚིགས་སུ་བཅད་པ་ལྔ་པ་བཤད་པ"],
[ "གླེང་གཞིའི་སྒོ་ལྔ་པའི་མདོའི་ཚིགས་སུ་བཅད་པ་ལདྲུག་པ་བཤད་པ"],
[ "རྐྱང་པའི་སྒོ་བཤད་པ"],
[ "རྐྱང་པའི་སྒོ་དང་པོ་བཤད་པ"],
[ "རྐྱང་པའི་སྒོ་དང་པོའི་མདོའི་ཚིགས་སུ་བཅད་པ་ཐོག་མ་བཤད་པ"],
[ "རྐྱང་པའི་ནང་ནས་སྒོ་དང་པོའི་མདོའི་ཚིགས་སུ་བཅད་པ་གཉིས་པ་བཤད་པ"],
[ "རྐྱང་པའི་སྒོ་དང་པོའི་མདོའི་ཚིགས་སུ་བཅད་པ་གསུམ་པ་བཤད་པ"],
[ "རྐྱང་པའི་སྒོ་དང་པོའི་མདོའི་ཚིགས་སུ་བཅད་པ་བཞི་པ་བཤད་པ"],
[ "རྐྱང་པའི་སྒོ་དང་པོའི་མདོའི་ཚིགས་སུ་བཅད་པ་ལྔ་པ་བཤད་པ"],
[ "རྐྱང་པའི་སྒོ་དང་པོའི་མདོའི་ཚིགས་སུ་བཅད་པ་དྲུག་པ་བཤད་པ"],
[ "རྐྱང་པའི་སྒོ་དང་པོའི་མདོའི་ཚིགས་སུ་བཅད་པ་བདུན་པ་བཤད་པ"],
[ "རྐྱང་པའི་སྒོ་དང་པོའི་མདོའི་ཚིགས་སུ་བཅད་པ་བརྒྱད་པ་བཤད་པ"],
[ "རྐྱང་པའི་སྒོ་དང་པོའི་མདོའི་ཚིགས་སུ་བཅད་པ་དགུ་པ་བཤད་པ"],
[ "རྐྱང་པའི་སྒོ་དང་པོའི་མདོའི་ཚིགས་སུ་བཅད་པ་བཅུ་པ་བཤད་པ"],
[ "རྐྱང་པའི་སྒོ་གཉིས་པ་བཤད་པ"],
[ "རྐྱང་པའི་སྒོ་གཉིས་པའི་མདོའི་ཚིགས་སུ་བཅད་པ་དང་པོ་བཤད་པ"],
[ "རྐྱང་པའི་སྒོ་གཉིས་པའི་མདོའི་ཚིགས་སུ་བཅད་པ་གཉིས་པ་བཤད་པ"],
[ "རྐྱང་པའི་སྒོ་གཉིས་པའི་མདོའི་ཚིགས་སུ་བཅད་པ་གསུམ་པ་བཤད་པ"],
[ "རྐྱང་པའི་སྒོ་གཉིས་པའི་མདོའི་ཚིགས་སུ་བཅད་པ་བཞི་པ་བཤད་པ"],
[ "རྐྱང་པའི་སྒོ་གཉིས་པའི་མདོའི་ཚིགས་སུ་བཅད་པ་ལྔ་པ་བཤད་པ"],
[ "རྐྱང་པའི་སྒོ་གཉིས་པའི་མདོའི་ཚིགས་སུ་བཅད་པ་དྲུག་པ་བཤད་པ"],
[ "རྐྱང་པའི་སྒོ་གཉིས་པའི་མདོའི་ཚིགས་སུ་བཅད་པ་བདུན་པ་བཤད་པ"],
[ "རྐྱང་པའི་སྒོ་གཉིས་པའི་མདོའི་ཚིགས་སུ་བཅད་པ་བརྒྱད་པ་བཤད་པ"],
[ "རྐྱང་པའི་སྒོ་གཉིས་པའི་མདོའི་ཚིགས་སུ་བཅད་པ་དགུ་པ་བཤད་པ"],
[ "རྐྱང་པའི་སྒོ་གཉིས་པའི་མདོའི་ཚིགས་སུ་བཅད་པ་བཅུ་པ་བཤད་པ"],
[ "རྐྱང་པའི་སྒོ་གསུམ་པ་བཤད་པ"],
[ "རྐྱང་པའི་སྒོ་གསུམ་པའི་མདོའི་ཚིགས་སུ་བཅད་པ་དང་པོ་བཤད་པ"],
[ "རྐྱང་པའི་སྒོ་གསུམ་པའི་མདོའི་ཚིགས་སུ་བཅད་པ་གཉིས་པ་བཤད་པ"],
[ "རྐྱང་པའི་སྒོ་གསུམ་པའི་མདོའི་ཚིགས་སུ་བཅད་པ་གསུམ་པ་བཤད་པ"],
[ "རྐྱང་པའི་སྒོ་གསུམ་པའི་མདོའི་ཚིགས་སུ་བཅད་པ་བཞི་པ་བཤད་པ"],
[ "རྐྱང་པའི་སྒོ་གསུམ་པའི་མདོའི་ཚིགས་སུ་བཅད་པ་ལྔ་པ་བཤད་པ"],
[ "རྐྱང་པའི་སྒོ་གསུམ་པའི་མདོའི་ཚིགས་སུ་བཅད་པ་དྲུག་པ་བཤད་པ"],
[ "རྐྱང་པའི་སྒོ་གསུམ་པའི་མདོའི་ཚིགས་སུ་བཅད་པ་བདུན་པ་བཤད་པ"],
[ "རྐྱང་པའི་སྒོ་གསུམ་པའི་མདོའི་ཚིགས་སུ་བཅད་པ་བརྒྱད་པ་བཤད་པ"],
[ "རྐྱང་པའི་སྒོ་གསུམ་པའི་མདོའི་ཚིགས་སུ་བཅད་པ་དགུ་པ་བཤད་པ"],
[ "རྐྱང་པའི་སྒོ་གསུམ་པའི་མདོའི་ཚིགས་སུ་བཅད་པ་བཅུ་པ་བཤད་པ"],
[ "རྐྱང་པའི་སྒོ་བཞི་པ་བཤད་པ"],
[ "རྐྱང་པའི་སྒོའི་མདོ་བཞི་པའི་ཚིགས་སུ་བཅད་པ་དང་པོ་བཤད་པ"],
[ "རྐྱང་པའི་སྒོ་བཞི་པའི་མདོའི་ཚིགས་སུ་བཅད་པ་གཉིས་པ་བཤད་པ"],
[ "རྐྱང་པའི་སྒོ་བཞི་པའི་མདོའི་ཚིགས་སུ་བཅད་པ་གསུམ་པ་བཤད་པ"],
[ "རྐྱང་པའི་སྒོ་བཞི་པའི་མདོའི་ཚིགས་སུ་བཅད་པ་བཞི་པ་བཤད་པ"],
[ "རྐྱང་པའི་སྒོ་བཞི་པའི་མདོའི་ཚིགས་སུ་བཅད་པ་ལྔ་པ་བཤད་པ"],
[ "རྐྱང་པའི་སྒོ་བཞི་པའི་མདོའི་ཚིགས་སུ་བཅད་པ་དྲུག་པ་བཤད་པ།"],
[ "རྐྱང་པའི་སྒོ་བཞི་པའི་མདོའི་ཚིགས་སུ་བཅད་པ་བདུན་པ་བཤད་པ"],
[ "རྐྱང་པའི་སྒོ་བཞི་པའི་མདོའི་ཚིགས་སུ་བཅད་པ་བརྒྱད་པ་བཤད་པ"],
[ "རྐྱང་པའི་སྒོ་བཞི་པའི་མདོའི་ཚིགས་སུ་བཅད་པ་དགུ་པ་བཤད་པ"],
[ "རྐྱང་པའི་སྒོ་བཞི་པའི་མདོའི་ཚིགས་སུ་བཅད་པ་བཅུ་པ་བཤད་པ"],
[ "འདུལ་བ་གཞུང་དམ་པ་ལས་གཏམ་གྱི་དངོས་པོ་བཤད་པ"],
[ "འདུལ་བ་གཞུང་དམ་པ་ལས་མ་ན་བི་ཀ་ཞེས་བྱ་བ་བཤད་པ"],
[ "འདུལ་བ་གཞུང་དམ་པ་ལས་མ་ན་བི་ཀ་བའི་སྒོ་དང་པོ་བཤད་པ"],
[ "འདུལ་བ་གཞུང་དམ་པ་མ་ན་བི་ཀ་ཞེས་བྱ་བའི་འདུལ་བའི་རིམ་པ་བཤད་པ"],
[ "འདུལ་བ་གཞུང་དམ་པ་ལས་མ་ལྟ་བུ་བཤད་པ"],
[ "འདུལ་བ་གཞུང་དམ་པ་ལས་མ་ལྟ་བུའི་བསྙེན་པར་རྫོགས་པའི་ཕུང་པོ་དང་པོ་བཤད་པ"],
[ "མ་ལྟ་བུ་ལས་དངོས་པོ་གཉིས་ཀྱི་ལེའུ་བཤད་པ"],
[ "མ་ལྟ་བུའི་རབ་ཏུ་ལྡན་པའི་ཕུང་པོ་ཞེས་བྱ་བ་ཕུང་པོ་གཉིས་པ་བཤད་པ"],
[ "མ་ལྟ་བུའི་དུམ་བུ་གསུམ་པོའི་དངོས་པོ་བཤད་པ"],
[ "མ་ལྟ་བུའི་བྱ་བའི་ཕུང་པོ་ཞེས་བྱ་བའི་ཕུང་པོ་གསུམ་པ་བཤད་པ"],
[ "ཨུ་པཱ་ལིས་ཀུན་དྲིས་པ་བཤད་པ"],
[ "འཕགས་པ་བཟང་པོ་སྤྱོད་པའི་སྨོན་ལམ་གྱི་རྒྱལ་པོ།"],
[ "འཕགས་པ་བྱམས་པའི་སྨོན་ལམ།"],
[ "མཆོག་གི་སྤྱོད་པའི་སྨོན་ལམ།"],
[ "མར་མེའི་ལོ་རྒྱུས་དང་སྨོན་ལམ་གྱི་མདོ།"],
[ "འཕགས་པ་གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་ལས་གསུངས་པའི་སྨོན་ལམ"],
[ "འཕགས་པ་སྟོང་ཆེན་མོ་རབ་ཏུ་འཇོམས་པ་ལས་གསུངས།་་པའི་སྨོན་ལམ།"],
[ "རིགས་སྔགས་ཀྱི་རྒྱལ་མོ་རྨ་བྱ་ཆེན་མོ་ལས་གསུངས་པའི་སྨོན་ལམ་དང་བདེན་ཚིག །"],
[ "ཡངས་པའི་གྲོང་ཁྱེར་དུ་འཇུག་པའི་དེ་ལེགས་ཀྱི་ཚིགས་སུ་བཅད་པ།"],
[ "བདེ་ལེགས་ཀྱི་ཚིགས་སུ་བཅད་པ།"],
[ "བདེ་ལེགས་སུ་འགྱུར་བའི་ཚིགས་སུ་བཅད་པ།"],
[ "ཤིས་པར་བརྗོད་པའི་ཚིགས་སུ་བཅད་པ།"],
[ "དཀོན་མཆོག་གསུམ་གྱི་བཀྲ་ཤིས་ཀྱི་ཚིགས་སུ་བཅད་པ།"],
[ "ལྷའི་དབང་པོ་བརྒྱ་བྱིན་ལ་སོགས་པ་གསུམ་གྱིས་བཀྲ་ཤིས་ཚིགས་སུ་བཅད་པ།"],
[ "ལྷས་ཞུས་པའི་བཀྲ་ཤིས་ཀྱི་ཚིགས་སུ་བཅད་པ།"],
[ "སངས་རྒྱས་རབས་བདུན་གྱི་བཀྲ་ཤིས་ཚིགས་སུ་བཅད་པ།"],
[ "བཀྲ་ཤིས་ཚིགས་སུ་བཅད་པ།"],
[ "འབུམ།"],
[ "ཀ"],
[ "ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟོང་ཕྲག་བརྒྱ་པ།"],
[ "དང་པོ། གླེང་གཞིའི་ལེའུ།"],
[ "གཉིས་པ། ཤཱ་རིའི་བུའི་ལེའུ།"],
[ "གསུམ་པ། རབ་འབྱོར་གྱི་ལེའུ།"],
[ "ཁ"],
[ "བཞི་པ། སྐྱོན་མེད་པའི་ལེའུ།"],
[ "ལྔ་པ། ཀུན་ཏུ་རྒྱུ་བཟོ་སྦྱངས་ཀྱི་ལེའུ།"],
[ "དྲུག་པ། མཚན་མ་མེད་པའི་ལེའུ།"],
[ "ག"],
[ "བདུན་པ། སྒྱུ་མ་ལྟ་བུའི་ལེའུ།"],
[ "བརྒྱད་པ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ལེའུ།"],
[ "ང"],
[ "དགུ་པ། ཏིང་ངེ་འཛིན་གྱི་ལེའུ།"],
[ "བཅུ་པ། ལམ་དང་གཟུངས་ཀྱི་ལེའུ།"],
[ "བཅུ་གཅིག་པ། ངེས་འབྱུང་གི་ལེའུ།"],
[ "བཅུ་གཉིས་པ། ཟིལ་གྱིས་གནོན་པའི་ལེའུ།"],
[ "ཅ"],
[ "བཅུ་གསུམ་པ། གཉིས་སུ་མེད་པའི་ལེའུ།"],
[ "བཅུ་བཞི་པ། རབ་འབྱོར་གྱི་ལེའུ།"],
[ "ཆ"],
[ "བཅོ་ལྔ་པ། བརྒྱ་བྱིན་གྱི་ལེའུ།"],
[ "བཅུ་དྲུག་པ། རྟོགས་པར་དཀའ་བའི་ལེའུ། "],
[ "བཅུ་བདུན་པ། མཐའ་ཡས་ལུང་སྟོན་གྱི་ལེའུ། "],
[ "ཇ"],
[ "བཅོ་བརྒྱད་པ། ཡོན་ཏན་ཡོངས་སུ་གཟུང་བའི་ལེའུ། "],
[ "བཅུ་ད་གུ་པ། མཆོད་རྟེན་ལ་བསྙེན་བཀུར་བྱས་པའི་ལེའུ། "],
[ "ཉི་ཤུ་པ། བྱང་ཆུབ་ཀྱི་སེམས་ཀྱི་ཡོན་ཏན་ཡོངས་སུ་བརྗོད་པའི་ལེའུ། "],
[ "ཉེར་གཅིག་པ། ཀུན་དུ་རྒྱུ་བཟློག་པའི་ལེའུ། "],
[ "ཉེར་གཉིས་པ། མཆོད་རྟེན་གྱི་ལེའུ། "],
[ "ཉེར་གསུམ་པ། སྐུ་གདུང་གི་ལེའུ།"],
[ "ཉེར་བཞི་་པ། བསོད་ནམས་ཀྱི་རྣམ་གྲངས་ཀྱི་ལེའུ།"],
[ "ཉ"],
[ "ཉེར་ལྔ་པ། རྗེས་སུ་ཡི་རང་དང་བསྔོ་བའི་ལེའུ།"],
[ " ཉེར་དྲུག་པ། སྒྲུབ་པའི་ལེའུ།"],
[ "ཏ"],
[ "ཉེར་བདུན་པ། དམྱལ་བའི་ལེའུ།"],
[ "ཐ"],
[ "ཉེར་བརྒྱད་པ། རྣམ་པར་དག་པའི་ལེའུ།"],
[ "ད"],
[ "ཉེར་དགུ་པ། གནས་མེད་པའི་ལེའུ།"],
[ "སུམ་ཅུ་པ། དམིགས་པ་མེད་པའི་ལེའུ།"],
[ "སོ་གཅིག་པ། བྱང་ཕྱོགས་ཀྱི་རྒྱུད་ཀྱི་ལེའུ།"],
[ "ན"],
[ "སོ་གཉིས་པ། བདུད་ཀྱི་ལས་ཀྱི་ལེའུ།"],
[ "སོ་གསུམ་པ། འཇིག་རྟེན་སྟོན་པའི་ལེའུ།"],
[ "སོ་བཞི་པ། མི་མཉམ་པ་དང་མཉམ་པའི་ལེའུ།"],
[ "སོ་ལྔ་པ། འདུས་པའི་ལེའུ།"],
[ "སོ་དྲུག་པ། གྲུའི་ལེའུ།"],
[ "སོ་བརྒྱད་པ། ཆགས་པ་མེད་པའི་ལིའུ"],
[ "པ"],
[ "སོ་དགུ་པ། བྱང་ཆུབ་སེམས་ཀྱི་བསླབ་པ་རྣམ་པར་གཞག་པའི་ལེའུ།"],
[ "བཞི་བཅུ་པ། སྦྱོར་ལམ་གྱི་རྟགས་བསྟན་པའི་ལེའུ།"],
[ "ཞེ་གཅིག་པ། ཕྱིར་མི་ལྡོག་པའི་རྟགས་ཀྱི་ལེའུ།"],
[ "ཞེ་གཉིས་པ། ཐབས་ལ་མཁས་པའི་ལེའུ།"],
[ "ཞེ་གསུམ་པ། ཞིང་སྦྱོང་བའི་ཐབས་ལ་མཁས་པའི་ལེའུ།"],
[ "ཞེ་བཞི་པ། གང་གཱའི་ལྷ་མོའི་ལེའུ།"],
[ "ཞེ་ལྔ་པ། རྣམ་ཐར་སྒོ་གསུམ་གྱི་ཐབས་ལ་མཁས་པའི་ལེའུ།"],
[ "ཞེ་དྲུག་པ། རྣམ་པར་རྟོག་པ་སྤང་བའི་ལེའུ།"],
[ "ཞེ་བདུན་པ། སྤྱོད་པའི་ལེའུ།"],
[ "ཕ"],
[ "ཞེ་བརྒྱད་པ། བསླབ་པ་མཉམ་པའི་ལེའུ།"],
[ "ཞེ་དགུ་པ། རྣམ་པར་མི་རྟོག་པའི་ལེའུ།"],
[ "ལྔ་བཅུ་པ། ཆགས་པ་མེད་པའི་ལེའུ།"],
[ "ང་གཅིག་པ། ཡོངས་སུ་གཏད་པའི་ལེའུ།"],
[ "ང་གཉིས་པ། མི་ཟད་པའི་ལེའུ།"],
[ "ང་གསུམ་པ། ཐོད་རྒལ་གྱི་ལེའུ།"],
[ "ང་བཞི་པ། ཆོས་གཉིས་ཀྱི་ཞུ་བ་མང་བའི་ལེའུ།"],
[ "བ"],
[ "ང་ལྔ་པ། ཡང་དག་པར་བསྟན་པའི་ལེའུ།"],
[ "ང་དྲུག་པ། དགེ་བའི་བཤེས་གཉེན་ལ་བསྙིན་བཀུར་བའི་ལེའུ།"],
[ "ང་བདུན་པ། སྦྱིན་པའི་ལེའུ།"],
[ "ང་བརྒྱད་པ། ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གི་ཐབས་ཀྱི་ལེའུ།"],
[ "ང་དགུ་པ། རྣམ་འཕེལ་གྱི་ལེའུ།"],
[ "དྲུག་བཅུ་པ། མཐར་གྱིས་པའི་ལེའུ།"],
[ "རེ་གཅིག་པ། མཚན་མ་མེད་པའི་ལེའུ།"],
[ "རེ་གཉིས་པ། མཚན་ཉིད་མེད་པའི་ལེའུ།"],
[ "རེ་གསུམ་པ། མཚན་དཔེའི་ལེའུ།"],
[ "མ"],
[ "རེ་བཞི་པ། མཉམ་པ་ཉིད་ཀྱི་ལེའུ།"],
[ "རེ་ལྔ་པ། ཆོས་ཉིད་འཁྲུག་པ་མེད་པའི་ལེའུ།"],
[ "རེ་དྲུག་པ། མི་དམིགས་པ་དང་སེམས་ཅན་ཡོངས་སུ་སྨིན་པའི་བྱེད་པའི་ཕྲིན་ལས་སྟོན་པའི་ལེའུ།"],
[ "རེ་བདུན་པ། སངས་རྒྱས་ཀྱི་ཞིང་ད་ག་པའི་ལེའུ།"],
[ "རེ་བརྒྱད་པ།  སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པའི་ལེའུ།"],
[ "རེ་དགུ་པ། དངོས་པོ་དང་དངོས་པོ་མེད་པའི་སེམས་ཅན་ལེའུ།"],
[ "བདུན་ཅུ་པ། ཀུན་ན་ས་ཉོན་མོངས་དང་རྣམ་བྱང་མེད་པའི་ལེའུ།"],
[ "དོན་གཅིག་པ། དོན་དམ་པའི་རྣལ་འབྱོར་གྱི་ལེའུ།"],
[ "དོན་གཉིས་པ། ཆོས་ཉིད་མི་འགྱུར་བ་བསྟན་པའི་ལེའུ།"],
[ "ཀ"],
[ "ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟོང་ཕྲག་ཉི་ཤུ་ལྔ་པ།"],
[ "ལེའུ་དང་པོ།"],
[ "ལེའུ་གཉིས་པ།"],
[ "ལེའུ་གསུམ་པ།"],
[ "ལེའུ་བཞི་པ།"],
[ "ལེའུ་ལྔ་པ།"],
[ "ལེའུ་དྲུག་པ།"],
[ "ལེའུ་བདུན་པ།"],
[ "ལེའུ་བརྒྱད་པ།"],
[ "ལེའུ་དགུ་པ།"],
[ "འེའུ་བཅུ་པ།"],
[ "ལེའུ་བཅུ་གཅིག་པ།"],
[ "ཁ"],
[ "ལེའུ་བཅུ་གཉིས་པ།"],
[ "ལེའུ་བཅུ་གསུམ་པ།"],
[ "ལེའུ་བཅུ་བཞི་པ།"],
[ "ལེའུ་བཅོ་ལྔ་པ།"],
[ "ལེའུ་བཅུ་དྲུག་པ།"],
[ "ལེའུ་བཅུ་བདུན་པ།"],
[ "ལེའུ་བཅོ་བརྒྱད་པ།"],
[ "ལེའུ་བཅུ་དགུ་པ།"],
[ "ལེའུ་ཉི་ཤུ་པ།"],
[ "ལེའུ་ཉི་ཤུ་གཅིག་པ།"],
[ "ལེའུ་ཉི་ཤུ་གཉིས་པ།"],
[ "ལེའུ་ཉ྄ི་ཤུ་གསུམ་པ།"],
[ "ལེའུ་ཉི་ཤུ་བཞི་པ།"],
[ "ལེའུ་ཉི་ཤུ་ལྔ་པ།"],
[ "ལེའུ་ཉི་ཤུ་དྲུག་པ།"],
[ "ལེའུ་ཉི་ཤུ་བདུན་པ།"],
[ "ལེའུ་ཉི་ཤུ་བརྒྱད་པ།"],
[ "ག"],
[ "ལེའུ་ཉི་ཤུ་དགུ་པ།"],
[ "ལེའུ་སུམ་ཅུ་པ།"],
[ "ལེའུ་སུམ་ཅུ་གཅིག་པ།"],
[ "ལེའུ་སུམ་ཅུ་གཉིས་པ།"],
[ "ལེའུ་སུམ་ཅུ་གསུམ་པ།"],
[ "ལེའུ་སུམ་ཅུ་བཞི་པ།"],
[ "ལེའུ་སུམ་ཅུ་ལྔ་པ།"],
[ "ལེའུ་སུམ་ཅུ་དྲུག་པ།"],
[ "ལེའུ་སུམ་ཅུ་བདུན་པ།"],
[ "ལེའུ་སུམ་ཅུ་བརྒྱད་པ།"],
[ "ལེའུ་སུམ་ཅུ་དགུ་པ།"],
[ "ལེའུ་བཞི་བཅུ་པ།"],
[ "ལེའུ་བཞི་བཅུ་གཅིག་པ།"],
[ "ལེའུ་བཞི་བཅུ་གཉིས་པ།"],
[ "ལེའུ་བཞི་བཅུ་གསུམ་པ།"],
[ "ལེའུ་བཞི་བཅུ་བཞི་པ།"],
[ "ལེའུ་བཞི་བཅུ་ལྔ་པ།"],
[ "ལེའུ་བཞི་བཅུ་དྲུག་པ།"],
[ "ལེའུ་བཞི་བཅུ་བདུན་པ།"],
[ "ལེའུ་བཞི་བཅུ་བརྒྱད་པ།"],
[ "ལེའུ་བཞི་བཅུ་དགུ་པ།"],
[ "ལེའུ་ལྔ་བཅུ་པ།"],
[ "ལེའུ་ལྔ་བཅུ་གཅིག་པ།"],
[ "ལེའུ་ལྔ་བཅུ་གཉིས་པ།"],
[ "ལེའུ་ལྔ་བཅུ་གསུམ་པ།"],
[ "ང"],
[ "ལེའུ་ལྔ་བཅུ་བཞི་པ།"],
[ "ལེའུ་ལྔ་བཅུ་ལྔ་པ།"],
[ "ལེའུ་ལྔ་བཅུ་དྲུག་པ།"],
[ "ལེའུ་ལྔ་བཅུ་བདུན་པ།"],
[ "ལེའུ་ལྔ་བཅུ་བརྒྱད་པ།"],
[ "ལེའུ་ལྔ་བཅུ་དགུ་པ།"],
[ "ལེའུ་དྲུག་ཅུ་པ།"],
[ "ལེའུ་དྲུག་ཅུ་གཅིག་པ།"],
[ "ལེའུ་དྲུག་ཅུ་གཉིས་པ།"],
[ "ལེའུ་དྲུག་ཅུ་གསུམ་པ།"],
[ "ལེའུ་དྲུག་ཅུ་བཞི་པ།"],
[ "ལེའུ་དྲུག་ཅུ་ལྔ་པ།"],
[ "ལེའུ་དྲུག་ཅུ་དྲུག་པ།"],
[ "ལེའུ་དྲུག་ཅུ་བདུན་པ།"],
[ "ལེའུ་དྲུག་ཅུ་བརྒྱད་པ།"],
[ "ལེའུ་དྲུག་ཅུ་དགུ་པ།"],
[ "ལེའུ་བདུན་བཅུ་པ།"],
[ "ལེའུ་བདུན་ཅུ་གཅིག་པ།"],
[ "ལེའུ་བདུན་ཅུ་གཉིས་པ།"],
[ "ལེའུ་བདུན་ཅུ་གསུམ་པ།"],
[ "ལེའུ་བདུན་ཅུ་བཞི་པ།"],
[ "ལེའུ་བདུན་ཅུ་ལྔ་པ།"],
[ "ལེའུ་བདུན་ཅུ་དྲུག་པ།"],
[ "ལེའུ་བདུན་ཅུ་བདུན་པ།"],
[ "ཁྲི་བརྒྱད།"],
[ "ཀ"],
[ "འཕགས་པ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཁྲི་བརྒྱད་སྟོང་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"],
[ "དང་པོ། གླེང་གཞིའི་ལེའུ།"],
[ "གཉིས་པ། སེམས་བསྐྱེད་པའི་ལེའུ།"],
[ "གསུམ་པ། ཉེ་བར་བརྟག་པའི་ལེའུ།"],
[ "བཞི་པ། མི་མཉམ་པ་དང་མཉམ་པའི་ལེའུ།"],
[ "ལྔ་པ། ལྗགས་ཀྱི་ད་བང་པོའི་ཁེའུ"],
[ "དྲུག་པ། རབ་འབྱོར་གྱི་ཁེའུལེའུ།"],
[ "བདུན་པ། སྐྱོན་མེད་པ་ལ་འཇུག་པའི་ལེའུ།"],
[ "བརྒྱད་པ། ཀུན་ཏུ་རྒྱུ་བཟོ་སྦྱངས་ཀྱི་ལེའུ།"],
[ "དགུ་པ། མཚན་མའི་ལེའུ།"],
[ "བཅུ་པ། སྒྱུ་མ་ལྟ་བུའི་ལེའུ།"],
[ "བཅུ་གཅིག་པ། ཁྲེལ་ཡོད་པའི་ལེའུ།"],
[ "བཅུ་གཉིས་པ། ལྟ་བ་སྤོང་བའི་ལེའུ།"],
[ "བཅུ་གསུམ་པ། ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གི་ལེའུ།"],
[ "བཅུ་བཞི་པ། མ་བཅིངས་མ་གྲོལ་བའི་ཁེའུ"],
[ "བཅོ་ལྔ་པ། ཏིང་ངེ་འཛིན་གྱི་ལེའུ།"],
[ "བཅུ་དྲུག་པ། གཟུངས་ཀྱི་སྒོར་འཇུག་པའི་ལེའུ།"],
[ "བཅུ་བདུན་པ། ས་ཡོངས་སུ་སྦྱང་བའི་ལེའུ།"],
[ "བཅོ་བརྒྱད་པ། ཐེག་པ་ཆེན་པོའི་ས་ངེས་པར་འབྱུང་བ་བསྟན་པའི་ལེའུ།"],
[ "བཅུ་ད་གུ་པ། ཟིལ་གྱིས་གནོན་པའི་ལེའུ།"],
[ "ཉི་ཤུ་པ། གཉིས་སུ་མེད་པའི་ལེའུ།"],
[ "ཉི་ཤུ་རྩ་གཅིག་པ། གནས་བརྟན་རབ་འབྱོར་གྱི་ལེའུ།"],
[ "ཉི་ཤུ་རྩ་གཉིས་པ། བརྒྱ་བྱིན་གྱི་ལེའུ་དང་པོ།"],
[ "ཉི་ཤུ་རྩ་གསུམ་པ། རྟོགས་པར་ད་ཀའ་བ་ཞེས་བྱ་བའི་ལེའུ།"],
[ "ཉི་ཤུ་རྩ་བཞི་པ། མཐའ་ཡས་པའི་ལེའུ།"],
[ "ཉི་ཤུ་རྩ་ལྔ་པ། བརྒྱ་བྱིན་གྱི་ལེའུ་གཉིས་པ།"],
[ "ཉི་ཤུ་རྩ་དྲུག་པ། ཡོངས་སུ་བཟུང་བའི་ལེའུ།"],
[ "ཉི་ཤུ་རྩ་བདུན་པ། མཆོད་རྟེན་གྱི་ལེའུ།"],
[ "ཉི་ཤུ་རྩ་བརྒྱད་པ། བྱང་ཆུབ་ཀྱི་སེམས་ཀྱི་ཡོན་ཏ་ན་ཡོངས་སུ་བརྗོད་པའི་ལེའུ།"],
[ "ཉི་ཤུ་རྩ་དགུ་པ། གཞན་མུ་སྟེགས་ཅན་གྱི་ལེའུ།"],
[ "ཁ"],
[ "སུམ་ཅུ་པ། རི་མོ་བྱེད་པའི་ཕན་ཡོན་གྱི་ལེའུ།"],
[ "སུམ་ཅུ་རྩ་གཅིག་པ། སྐུ་གདུང་གི་ལེའུ།"],
[ "སུམ་ཅུ་རྩ་གཉིས་པ། བསོད་ནམས་ཀྱི་ཁྱད་པར་གྱི་ལེའུ།"],
[ "སུམ་ཅུ་རྩ་གསུམ་པ། ཡོངས་སུ་བསྔོ་བའི་ལེའུ།"],
[ "སུམ་ཅུ་རྩ་བཞི་པ། མངོན་པར་བསྒྲུབ་པའི་ཡོན་ཏ་ན་ཡང་ད་ག་པར་བསྔགས་པའི་ལེའུ།"],
[ "སུམ་ཅུ་རྩ་ལྔ་པ། སེམས་ཅན་ད་མྱལ་བའི་ལེའུ།"],
[ "སུམ་ཅུ་རྩ་དྲུག་པ། ཆོས་ཐམས་ཅད་རྣམ་པར་ད་ག་པར་བསྟན་པའི་ལེའུ།"],
[ "སུམ་ཅུ་རྩ་བདུན་པ། གན་ས་མེད་པའི་ལེའུ།"],
[ "སུམ་ཅུ་རྩ་བརྒྱད་པ། ད་མིགས་སུ་མེད་པའི་ལེའུ།"],
[ "སུམ་ཅུ་རྩ་དགུ་པ། བྱང་ཕྱོགས་ཀྱི་རྒྱུད་ཀྱི་ལེའུ།"],
[ "བཞི་བཅུ་པ། བདུད་ཀྱི་ཁེའུ"],
[ "བཞི་བཅུ་རྩ་གཅིག་པ། བདུད་ཀྱི་ཆོགས་པ་ད་ང་མི་ལྡན་པའི་ལེའུ།"],
[ "བཞི་བཅུ་རྩ་གཉིས་པ། འཇིག་རྟེན་སྟོན་པའི་ལེའུ།"],
[ "བཞི་བཅུ་རྩ་གསུམ་པ། བསམ་གྱིས་མི་ཁྱབ་པའི་ལེའུ།"],
[ "བཞི་བཅུ་རྩ་བཞི་པ། འདུས་པའི་ལེའུ།"],
[ "བཞི་བཅུ་རྩ་ལྔ་པ། གྲུའི་ལེའུ།"],
[ "བཞི་བཅུ་རྩ་དྲུག་པ། འདོད་ཆགས་འདུལ་བའི་ལེའུ།"],
[ "བཞི་བཅུ་བདུན་པ། འདོད་ཆགས་འདུལ་བའི་ལེའུ།"],
[ "བཞི་བཅུ་རྩ་བརྒྱད་པ། བྱང་ཆུབ་སེམས་དའི་བསླབ་པ་རྣམ་པར་གཞག་པའི་ལེའུ།"],
[ "བཞི་བཅུ་རྩ་དགུ་པ། ཕྱིར་མི་ལྡོག་པའི་ལེའུ།"],
[ "ལྔ་བཅུ་པ། ཕྱིར་མི་ལྡོག་པའི་རྟགས་བསྟན་པའི་ལེའུ།"],
[ "ལྔ་བཅུ་རྩ་གཅིག་པ། ཐབས་ལ་མཁས་པ་བསྟན་པའི་ལེའུ།"],
[ "ལྔ་བཅུ་རྩ་གཉིས་པ། ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གི་ཐབས་ཡོངས་སུ་རྫོགས་པའི་ལེའུ།"],
[ "ལྔ་བཅུ་རྩ་གསུམ་པ། གང་གཱའི་ལྷ་མོ་ལུང་བསྟན་པའི་ལེའུ།"],
[ "ལྔ་བཅུ་རྩ་བཞི་པ། ཐབས་ལ་མཁས་པ་སྒོམ་པ་བསྟན་པའི་ལེའུ།"],
[ "ལྔ་བཅུ་རྩ་ལྔ་པ། རྣམ་པར་རྟོག་པ་སྤང་བར་བསྟན་པའི་ལེའུ།"],
[ "ལྔ་བཅུ་རྩ་དྲུག་པ། བསླབ་པ་མཉམ་པའི་ལེའུ།"],
[ "ལྔ་བཅུ་རྩ་བདུན་པ། སྦྱོད་པའི་ལེའུ།"],
[ "ལྔ་བཅུ་རྩ་བརྒྱད་པ། རྣམ་པར་མི་རྟོག་པ་བསྟན་པའི་དཔེ་བརྗོད་པའི་ལེའུ།"],
[ "ལྔ་བཅུ་རྩ་དགུ་པ། ཆགས་པ་མེད་པའི་ལེའུ།"],
[ "དྲུག་ཅུ་པ། ཡོངས་སུ་གཏད་པའི་ལེའུ།"],
[ "དྲུག་ཅུ་རྩ་གཅིག་པ། མི་ཟད་པའི་ལེའུ།"],
[ "དྲུག་ཅུ་རྩ་གཉིས་པ། ཐོད་རྒལ་དུ་སྙོམས་པར་འཇུག་པའི་ཁེའུ"],
[ "དྲུག་ཅུ་རྩ་གསུམ་པ། ཆོས་གཉིས་ཀྱི་ཞུ་བ་མང་པོའི་ཁེའུ"],
[ "ག"],
[ "དྲུག་ཅུ་རྩ་བཞི་པ། ཡང་ད་ག་པར་བསྟན་པའི་ལེའུ།"],
[ "དྲུག་ཅུ་རྩ་ལྔ་པ། བསྙེན་བཀུར་བྱ་བའི་ཐབས་ཀྱི་ལེའུ།"],
[ "དྲུག་ཅུ་རྩ་དྲུག་པ། ཐབས་ལ་མཁས་པ་བསྟན་པའི་ལེའུ།"],
[ "དྲུག་ཅུ་རྩ་བདུན་པ། ཚུལ་ཁྲིམས་ཀྱི་ལེའུ།"],
[ "དྲུག་ཅུ་རྩ་བརྒྱད་པ། རྣམ་པར་འཕེལ་བའི་ལེའུ།"],
[ "དྲུག་ཅུ་རྩ་དགུ་པ། ལམ་བསྒོམ་པ་བསྟན་པའི་ལེའུ།"],
[ "བདུན་ཅུ་རྩ་གཅིག་པ། དམིགས་སུ་མེད་པའི་ཆོས་ཉིད་ཀྱི་ལེའུ།"],
[ "བདུན་ཅུ་རྩ་གཉིས་པ། མཚན་ཉིད་མེད་པ་བསྟན་པའི་ལེའུ།"],
[ "བདུན་ཅུ་རྩ་གསུམ་པ། ཡི་གེ་མངོན་པར་བསྒྲུབ་པ་བསྟན་པའི་ལེའུ།"],
[ "བདུན་ཅུ་རྩ་བཞི་པ། ཆོས་ཐམས་ཅད་མཉམ་པ་ཉིད་དུ་བསྟན་པའི་ལེའུ།"],
[ "བདུན་ཅུ་རྩ་ལྔ་པ། མི་འཁྲུགས་པ་བསྟན་པའི་ལེའུ།"],
[ "བདུན་ཅུ་རྩ་དྲུག་པ། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་གོ་ཆའི་ལེའུ།"],
[ "བདུན་ཅུ་རྩ་བདུན་པ། སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་ད་ག་པ་བསྟན་པའི་ལེའུ།"],
[ "བདུན་ཅུ་རྩ་བརྒྱད་པ། སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་བྱ་བའི་ཐབས་ལ་མཁས་པ་བསྟན་པ་ཞེས་བྱ་བའི་ལེའུ།"],
[ "བདུན་ཅུ་རྩ་དགུ་པ། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་བསྟན་པའི་ལེའུ།"],
[ "བརྒྱད་ཅུ་པ། ཀུན་ནས་ཉོན་མོངས་པ་ད་ང་རྣམ་པར་བྱང་བ་མེད་པའི་ཁེའུ"],
[ "བརྒྱད་ཅུ་རྩ་གཅིག་པ། དོན་དམ་པའི་རྣལ་འབྱོར་གྱི་ལེའུ།"],
[ "བརྒྱད་ཅུ་རྩ་གཉིས་པ། ཆོས་ཉིད་འགྱུར་བ་མེད་པ་བསྟན་པའི་ལེའུ།"],
[ "བརྒྱད་ཅུ་རྩ་གསུམ་པ། བྱང་ཆུབ་སེམས་དཔའི་བསླབ་པ་རབ་ཏུ་ད་བྱེ་་ བའི་ལེའུ།"],
[ "བརྒྱད་ཅུ་རྩ་བཞི་པ། སྡུད་པའི་ཚིགས་སུ་བ་ཅད་པའི་ལེའུ།"],
[ "བརྒྱད་ཅུ་རྩ་ལྔ་པ། རྟག་ཏུ་ངུའི་ལེའུ།"],
[ "བརྒྱད་ཅུ་རྩ་དྲུག་པ། ཆོས་འཕགས་ཀྱི་ལེའུ།"],
[ "བརྒྱད་ཅུ་རྩ་བདུན་པ། ཡོངས་སུ་གཏ་ད་པའི་ལེའུ།"],
[ "ཁྲི་པ།"],
[ "ག"],
[ "འཕགས་པ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཁྲི་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"],
[ "དང་པོ། གླེང་གཞིའི་ལེའུ།"],
[ "གཉིས་པ། ཆོས་ཐམས་ཅད་ཀྱི་ལེའུ།"],
[ "གསུམ་པ། མངོན་པར་ཞེན་པ་མེད་པའི་ལེའུ།"],
[ "བཞི་པ། རྣལ་འབྱོར་གྱི་ལེའུ།"],
[ "ལྔ་པ། བྱང་ཆུབ་སེམས་དཔའི་ཚིག་བླ་དྭགས་ཀྱི་ལེའུ།"],
[ "དྲུག་པ། བསླབ་པའི་ལེའུ།"],
[ "བདུན་པ། མི་དམིགས་པའི་ལེའུ།"],
[ "བརྒྱད་པ། སྐྱོན་མེད་པའི་ལེའུ།"],
[ "དགུ་པ། བསྟན་པའི་ལེའུ།"],
[ "ངཿ"],
[ "བཅུ་པ། མངོན་པར་ཤེས་པའི་ལེའུ།"],
[ "བཅུ་གཅིག་པ། མི་གནས་པའི་ལེའུ།"],
[ "བཅུ་གཉིས་པ། ཏིང་ངེ་འཛིན་གྱི་ལེའུ།"],
[ "བཅུ་གསུམ་པ། ནམ་མཁའ་ལྟ་བུ་ཞེས་བྱ་བའི་ལེའུ།"],
[ "བཅུ་བཞི་པ། འོང་བ་དང་འགྲོ་བ་མེད་པའི་ལེའུ།"],
[ "བཅོ་ལྔ་པ། བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་ལེའུ།"],
[ "བཅུ་དྲུག་པ། རྣམ་པར་རྟོག་པའི་ལེའུ།"],
[ "བཅུ་བདུན་པ། ཕན་ཡོན་གྱི་ལེའུ།"],
[ "བཅོ་བརྒྱད་པ། རྣམ་པར་དག་པའི་ལེའུ།"],
[ "བཅུ་དགུ་པ། བྱེད་པ་པོ་དང་བྱེད་པ་པོ་མེད་པའི་ལེའུ།"],
[ "ཉི་ཤུ་པ། ཡོན་ཏན་གྱི་ལེའུ།"],
[ "ཉི་ཤུ་གཅིག་པ། སྔ་ལྟས་ཀྱི་ལེའུ།"],
[ "ཉི་ཤུ་གཉིས་པ། བསྒོམ་པའི་ལེའུ།"],
[ "ཉི་ཤུ་གསུམ་པ། ཡོངས་སུ་གཟུང་བ་མེད་པ་དང་སྤང་བ་མེད་པའི་ལེའུ།"],
[ "ཉི་ཤུ་བཞི་པ། དང་པོ་འཇུག་པའི་ལེའུ།"],
[ "ཉི་ཤུ་ལྔ་པ། ཐབས་ལ་མཁས་པའི་ལེའུ།"],
[ "ཉི་ཤུ་དྲུག་པ། རྗེས་སུ་ཡི་རང་བའི་ལེའུ།"],
[ "ཉི་ཤུ་བདུན་པ། ཕ་རོལ་ཏུ་ཕྲིན་པ་ཡོངས་སུ་བསྡུ་བའི་ལེའུ།"],
[ "ཉི་ཤུ་བརྒྱད་པ། མཚན་ཉིད་མི་འདྲ་བའི་ལེའུ།"],
[ "ཉི་ཤུ་དགུ་པ། ཆོས་ཀྱི་སྦྱིན་པའི་ལེའུ།"],
[ "སུམ་ཅུ་པ། རང་བཞིན་གྱི་ལེའུ།"],
[ "སུམ་ཅུ་གཅིག་པ། ཕྱིར་མི་ལྡོག་པའི་ལེའུ།"],
[ "སུམ་ཅུ་གཉིས་པ། མངོན་པར་བྱང་ཆུབ་པའི་ལེའུ།"],
[ "སུམ་ཅུ་གསུམ་པ། མཇུག་སྡུད་ཀྱི་ལེའུ།"],
[ "བརྒྱད་སྟོང་པ།"],
[ "ཀ"],
[ "འཕགས་པ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་བརྒྱད་སྟོང་པ།"],
[ "དང་པོ། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་སྦྱོད་པའི་ལེའུ།"],
[ "གཉིས་པ། བརྒྱ་བྱིན་གྱི་ལེའུ།"],
[ "གསུམ་པ། ཕ་རོལ་ཏུ་ཕྲིན་པ་དང་མཆོད་རྟེན་ལ་བཀུར་སྟིར་བྱེད་པ་གཞལ་དུ་མེད་པའི་ཡོན་ཏ་ན་འཛིན་པའི་ལེའུ།"],
[ "བཞི་པ། ཡོན་ཏན་ཡོངས་སུ་བརྗོད་པ་ཞེས་བྱ་བའི་ལེའུ།"],
[ "ལྔ་པ། བསོད་ན་མས་ཀྱི་རྣམ་གྲང་ས་ཀྱི་ལེའུ།"],
[ "དྲུག་པ། རྗེས་སུ་ཡི་རང་བ་དང་ཡོངས་སུ་བསྔོ་བའི་ལེའུ།"],
[ "བདུན་པ། དམྱལ་བའི་ལེའུ།"],
[ "བརྒྱད་པ། རྣམ་པར་དག་པ་ཞེས་བྱ་བའི་ལེའུ།"],
[ "དགུ་པ། བསྟོད་པའི་ལེའུ།"],
[ "བཅུ་པ། འཛིན་པའི་ཡོན་ཏ་ན་ཡོངས་སུ་བརྫོད་པའི་ལེའུ།"],
[ "བཅུ་གཅིག་པ། བདུད་ཀྱི་ལས་ཀྱི་ལེའུ།"],
[ "བཅུ་གཉིས་པ། འཇིག་རྟེན་ཡང་ད་ག་པར་སྟོན་པ་ཞེས་བྱ་བའི་ལེའུ།"],
[ "བཅུ་གསུམ་པ། བསམ་གྱིས་མི་ཁྱབ་པའི་ལེའུ།"],
[ "བཅུ་བཞི་པ། ད་པེའི་ལེའུ།"],
[ "བཅོ་ལྔ་པ། ལྷའི་ལེའུ།"],
[ "བཅུ་དྲུག་པ། དེ་བཞིན་ཉིད་ཀྱི་ཁེའུ།"],
[ "བཅུ་བདུན་པ། ཕྱིར་མི་ལྗོག་པའི་རྣམ་པ་དང་རྟགས་ད་ང་མཚན་མའི་ལེའུ།"],
[ "བཅོ་བརྒྱད་པ། སྟོང་པ་ཉིད་ཀྱི་ལེའུ།"],
[ "བཅུ་དགུ་པ། སྲིང་མོ་གང་གཱའི་ལྷ་མོའི་ལེའུ།"],
[ "ཉི་ཤུ་པ། ཐབས་མཁས་པ་ལ་སྦྱོད་པའི་ལེའུ།"],
[ "ཉི་ཤུ་རྩ་གཅིག་པ། བདུད་ཀྱི་ལས་ཀྱི་ལེའུ།"],
[ "ཉི་ཤུ་རྩ་གཉིས་པ། དགེ་བའི་བཤེས་གཉེན་གྱི་ལེའུ།"],
[ "ཉི་ཤུ་རྩ་གསུམ་པ། བརྒྱ་བྱིན་གྱི་ལེའུ།"],
[ "ཉི་ཤུ་རྩ་བཞི་པ། མངོན་པའི་ང་རྒྱལ་གྱི་ལེའུ།"],
[ "ཉི་ཤུ་རྩ་ལྔ་པ། བསླབ་པའི་ལེའུ།"],
[ "ཉི་ཤུ་རྩ་དྲུག་པ། སྒྱུ་མ་ལྟ་བུའི་ལེའུ།"],
[ "ཉི་ཤུ་རྩ་བདུན་པ། སྙིང་པོའི་ཁེའུ།"],
[ "ཉི་ཤུ་རྩ་བརྒྱད་པ། མེ་ཏོག་བཀྲམ་པའི་ལེའུ།"],
[ "ཉི་ཤུ་རྩ་དགུ་པ། རྗེས་སུ་རིག་པའི་ལེའུ།"],
[ "སུམ་ཅུ་པ། རྟག་ཏུ་ངུའི་ལེའུ།"],
[ "སུམ་ཅུ་རྩ་གཅིག་པ། ཆོས་འཕགས་ཀྱི་ཁེའུ།"],
[ "སུམ་ཅུ་རྩ་གཉིས་པ། ཡོངས་སུ་གཏད་པའི་ལེའུ།"],
[ "ཤེས་རབ་སྣ་ཚོགས།"],
[ "ཀ"],
[ "འཕགས་པ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྡུད་པ་ཚིགས་སུ་བཅད་པ། །"],
[ "འཕགས་པ་རབ་ཀྱི་རྩལ་གྱིས་རྣམ་པར་གནོན་པས་ཞུས་པ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་བསྟན་པ།"],
[ "དང་པོ། གླེ་གཞིའི་ལེའུ།"],
[ "གཉིས་པ། ཀུན་དགའ་བོའི་ལེའུ།"],
[ "གསུམ་པ། དེ་བཞིན་ཉིད་ཀྱི་ལེའུ།"],
[ "བཞི་པ། དཔེའི་ལེའུ།"],
[ "ལྔ་པ། རབ་འབྱོར་གྱི་ལེའུ།"],
[ "དྲུག་པ། སྤྱོད་པའི་ལེའུ།"],
[ "བདུན་པ། ཕན་ཡོན་གྱི་ལེའུ།"],
[ "འཕགས་པ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་བདུན་བརྒྱ་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"],
[ "འཕགས་པ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལྔ་བརྒྱ་པ།"],
[ "འཕགས་པ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་རྡོ་རྗེ་གཅོད་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"],
[ "འཕགས་པ་བཅོམ་ལྡན་འདས་མ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལྔ་བཅུ་པ།"],
[ "དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཡུམ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་མ་ཡི་གེ་གཅིག་མ་ཞེས་བྱ་བ།"],
[ "འཕགས་པ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཉི་མའི་སྙིང་\nཔོ་ཐེག་པ་ཆེན་པོའི་མདོ།"],
[ "འཕགས་པ་ཟླ་བའི་སྙིང་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཐེག་པ་ཆེན་པོའི་མདོ།"],
[ "འཕགས་པ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཀུན་དུ་བཟང་པོ་ཐེག་པ་ཆེན་པོའི་མདོ།"],
[ "འཕགས་པ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལག་ན་རྡོ་རྗེའི་མདོ་ཐེག་པ་ཆེན་པོ།"],
[ "འཕགས་པ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་རྡོ་རྗེ་རྒྱལ་མཚན་གྱི་མདོ་ཐེག་པ་ཆེན་པོ།"],
[ "ཆོས་ཀྱི་འཁོར་ལོ་རབ་ཏུ་བསྐོར་བའི་མདོ།"],
[ "སྐྱེས་པ་རབས་ཀྱི་གླེང་གཞི།"],
[ "རིང་བའི་གླེང་གཞི་འཆད་པ།"],
[ "བར་མའི་གླེང་གཞི་འཆད་པ།"],
[ "ཉེ་བའི་གླེང་གཞི་འཆད་པ།"],
[ "ལྕང་ལོ་ཅན་གྱི་ཕོ་བྲང་གི་མདོ།"],
[ "ལྕང་ལོ་ཅན་གྱི་ཕོ་བྲང་གི་མདོ་ལས་སྐབས་རབ་མཆོག་དང་པོ་འཆད་པ།"],
[ "ལྕང་ལོ་ཅན་གྱི་ཕོ་བྲང་གི་མདོ་ལས་སྐབས་རབ་མཆོག་གཉིས་པ་འཆད་པ།"],
[ "འདུས་པ་ཆེན་པོའི་མདོ།"],
[ "བྱམས་པའི་མདོ།"],
[ "བྱམས་པ་བསྒོམ་པའི་མདོ།"],
[ "བསླབ་པ་ལྔའི་ཕན་ཡོན་གྱི་མདོ།"],
[ "རིའི་ཀུན་དགའ་བོའི་མདོ།"],
[ "ཀླུའི་རྒྱལ་པོ་དགའ་བོ་ཉེར་དགའ་འདུལ་བའི་མདོ"],
[ "འོད་སྲུང་ཆེན་པོའི་མདོ།"],
[ "ཉི་མའི་མདོ།"],
[ "ཟླ་བའི་མདོ།"],
[ "བཀྲ་ཤིས་ཆེན་པོའི་མདོ།"],
[ "མདོ་སྡེ།"],
[ "ཀ"],
[ "འཕགས་པ་བསྐལ་པ་བཟང་པོ་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"],
[ "ཁ"],
[ "འཕགས་པ་རྒྱ་ཆེར་རོལ་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"],
[ "དང་པོ། གླེང་གཞིའི་ལེའུ།"],
[ "གཉིས་པ། ཡང་དག་པར་སྤྲོ་བར་བྱ་བའི་ལེའུ།"],
[ "གསུམ་པ། རིགས་ཡོང་ས་སུ་དགཱ་པའི་ལེའུ།"],
[ "བཞི་པ། ཆོས་སྣང་བའི་སྒོའི་ལེའུ།"],
[ "ལྔ་པ། བསྐྱོད་པར་བརྩམས་པའི་ལེའུ།"],
[ "དྲུག་པ། ལྷུམས་སུ་འཇུག་པའི་པའི་ལེའུ།"],
[ "བདུན་པ། བལྟམ་པའི་ལེའུ།"],
[ "བརྒྱད་པ། ལྷ་ཁང་དུ་ཁྱེར་བའི་ལེའུ།"],
[ "དགུ་པ། རྒྱན་གྱི་ལེའུ།"],
[ "བཅུ་པ། ཡི་གེ་བསྟན་པའི་པའི་ལེའུ།"],
[ "བཅུ་གཅིག་པ། ཞིང་པའི་གྲོང་གི་ལེའུ།"],
[ "བཅུ་གཉིས་པ། སྒྱུ་རྩལ་བསྟན་པའི་ལེའུ།"],
[ "བཅུ་གསུམ་པ། བསྐུལ་བའི་ལེའུ།"],
[ "བཅུ་བཞི་པ། རྨི་ལམ་གྱི་ལེའུ།"],
[ "བཅོ་ལྔ་པ། མངོན་པར་འབྱུང་བའི་ལེའུ།"],
[ "བཅུ་དྲུག་པ། གཟུགས་ཙན་སྙིང་པོ་འོང་ས་པའི་ལེའུ།"],
[ "བཅུ་བདུན་པ། དཀའ་བ་སྤྱད་པའི་ལེའུ།"],
[ "བཅོ་བརྒྱད་པ། ནེེ་རན་ཛ་ནའི་ལེའུ།"],
[ "བཅུ་དགུ་པ། བྱང་ཆུབ་ཀྱི་སྙིང་པོར་བཞུད་པའི་ལེའུ།"],
[ "ཉི་ཤུ་པ། བྱང་ཆུབ་ཀྱི་སྙིང་པོར་བརྐོད་པའི་ལེའུ།"],
[ "ཉི་ཤུ་རྩ་གཅིག་པ། བདུད་བཏུལ་བའི་ལེའུ།"],
[ "ཉི་ཤུ་རྩ་གཉིས་པ། མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་པའི་སེའུ"],
[ "ཉི་ཤུ་རྩ་གསུམ་པ། མངོན་པར་བསྟོད་པའི་ལེའུ།"],
[ "ཉི་ཤུ་རྩ་བཞི་པ། ག་གོན་དང་བཟང་པོའི་ལེའུ།"],
[ "ཉི་ཤུ་རྩ་ལྔ་པ། བསྐུལ་བའི་ལེའུ།"],
[ "ཉི་ཤུ་རྩ་དྲུག་པ། ཚོས་ཀྱི་འཁོར་ལོ་བསྐརཱ་བའི་པེའུ"],
[ "t="],
[ "འཕགས་པ་འཇམ་དཔལ་རྣམ་པར་རོལ་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"],
[ "འཕགས་པ་འཇམ་དཔལ་རྣམ་པར་འཕྲུལ་པའི་ལེའུ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"],
[ "འཕགས་པ་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་བྱིན་གྱི་བརླབས་སེམས་ཅན་ལ་གཟིགས་ཤིང་སངས་རྒྱས་ཀྱི་ཞིང་གི་བཀོད་པ་ཀུན་ཏུ་སྟོན་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"],
[ "ག"],
[ "འཕགས་པ་བཅོམ་ལྡན་འདས་ཀྱི་ཡེ་ཤེས་རྒྱས་པའི་མདོ་སྡེ་རིན་པོ་ཆེ་མཐའ་ཡས་པ་མཐར་ཕྱིན་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"],
[ "འཕགས་པ་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཡུལ་ལ་འཇུག་པའི་ཡེ་ཤེས་སྣང་བའི་རྒྱན་ཅེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"],
[ "ང"],
[ "འཕགས་པ་དགེ་བའི་རྩ་བ་ཡོངས་སུ་འཛིན་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"],
[ "དང་པོ། གླེང་གཞིའི་ལེའུ།"],
[ "གཉིས་པ། རྫུ་འཕྲུལ་མངོན་པར་འདུ་མཛད་པའི་ཆེ་བའི་བདག་ཉིད་ཀྱི་བསྔགས་པ་བརྗོད་པའི་ལེའུ།"],
[ "གསུམ་པ། བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པ་དང་ད་མ་པའི་ཆོས་ཡོངས་སུ་ཚོལ་བའི་བསོད་ན་མས་ཀྱི་བསྔགས་པ་བརྗོད་པའི་ལེའུ།"],
[ "བཞི་པ། བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པ་བསྔགས་པའི་ལེའུ།"],
[ "ལྔ་པ། བྱང་ཆུབ་སེམས་ད་པའ་འདུས་པའི་ལེའུ།"],
[ "དྲུག་པ། བྱང་ཆུབ་སེམས་དཔའི་སྦྱོད་པ་ད་ང་། ལྷག་པའི་བསམ་པ་དང་།ད་མ་པའི་ཆོས་ཡོངས་སུ་ཆོལ་བ་ལ་མངོན་པར་བརྩོན་པའི་ལེའུ།"],
[ "བདུན་པ། ལྷག་པའི་བསམ་པ་ཡང་དག་པར་བསྟན་པའི་ལེའུ།"],
[ "བརྒྱད་པ། བྱང་ཆུབ་ཀྱི་སེམས་ཡང་དག་པར་འཛིན་དུ་གཞུག་པ་དང་།རྣམ་པར་བརྗོད་པ་དང་། བསྐྱེད་པ་བསླབ་པའི་ཁེའུ"],
[ "དགུ་པ། ཐབས་ལ་འཇུག་པ་དང་། དམ་པའི་ཆོས་སྤོང་བ་ད་ང་། བྱང་ཆུབ་སེམས་དཔའ་ཡང་དག་པར་འཛིན་དུ་གཞུག་པའི་ལེའུ།"],
[ "བཅུ་པ། བྱང་ཆུབ་སེམས་དཔའི་སྦྱོད་པའི་ལེའུ།"],
[ "བཅུ་གཅིག་པ། མངོན་པར་འབྱུང་བ་ཡང་དག་པར་བརྗོད་པའི་ལེའུ།"],
[ "བཅུ་གཉིས་པ། འཁོར་ད་ག་པའི་ལེའུ།"],
[ "བཅུ་གསུམ་པ། སྒོའི་ཚིག་མངོན་པར་སྒྲུབ་པའི་ལེའུ།"],
[ "བཅུ་བཞི་པ། ཏིང་ངེ་འཛིན་གྱི་ལས་ཀྱི་ལེའུ།"],
[ "བཅོ་ལྔ་པ། ཡོངས་སུ་གཏད་པའི་ཕན་ཡོན་གྱི་ལེའུ།"],
[ "འཕགས་པ་ཟུང་གི་མདོའི་ཆོས་ཀྱི་རྣམ་གྲངས།"],
[ "འཕགས་པ་ཁྱེའུ་སྣང་བ་བསམ་གྱིས་མི་ཁྱབ་པས་བསྟན་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་རྣམ་གྲངས།"],
[ "འཕགས་པ་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་བརྗོད་པའི་ཆོས་ཀྱི་རྣམ་གྲངས།"],
[ "འཕགས་པ་དཀྱིལ་འཁོར་བརྒྱད་ཅེས་བྱ་བའི་ཆོས་ཀྱི་རྣམ་གྲངས་ཐེག་པ་ཆེན་པོའི་མདོ།"],
[ "ཅ"],
[ "འཕགས་པ་དགོངས་པ་ངེས་པར་འགྲེལ་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"],
[ "དང་པོ། དོན་ཟབ་དགོངས་པ་ངེས་པར་འགྲེལ་གྱི་ལེའུ།"],
[ "གཉིས་པ། ཆོས་འཕགས་ཀྱི་ལེའུ།"],
[ "གསུམ་པ། བློ་གྲོས་ཤིན་ཏུ་རྣམ་ད་ག་གི་ལེའུ།"],
[ "བཞི་པ། ར་བ་འབྱོར་གྱི་ཁེའུ"],
[ "ལྔ་པ། བློ་གྲོས་ཡངས་པའི་ལེའུ།"],
[ "དྲུག་པ། ཡོན་ཏན་འབྱུང་གན་ས་ཀྱི་ལེའུ།"],
[ "བདུན་པ། དོན་ད་མ་ཡང་ད་ག་འཕགས་ཀྱི་ལེའུ།"],
[ "བརྒྱད་པ། བྱམས་པའི་ལེའུ།"],
[ "དགུ་པ། སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་ལེའུ།"],
[ "བཅུ་པ། འཇམ་ད་པལ་གྱི་ལེའུ།"],
[ "འཕགས་པ་ལང་ཀར་གཤེགས་པའི་ཐེག་པ་ཆེན་པོའི་མདོ། །"],
[ "དང་པོ། འབོད་འགྲོགས་ཀྱིས་གསོལ་བ་བཏབ་པའི་ལེའུ།"],
[ "གཉིས་པ། ཆོས་ཐམས་ཅད་བསྡུས་པ་ཞེས་བྱ་བའི་ལེའུ།"],
[ "གསུམ་པ། མི་རྟག་པའི་ལེའུ།"],
[ "བཞི་པ། མངོན་པར་རྟོགས་པའི་ལེའུ།"],
[ "ལྔ་པ། དེ་བཞིན་གཤེགས་པ་རྟག་པ་ད་ང་མི་རྟག་པར་འགྱུར་བ་ཞེས་བྱ་བའི་ལེའུ།"],
[ "དྲུག་པ། སྐད་ཅིག་མའི་ལེའུ།"],
[ "བདུན་པ། ཤ་མི་ཟ་བའི་ལེའུ།"],
[ "བརྒྱད་པ།"],
[ "འཕགས་པ་ལང་ཀར་གཤེགས་པ་རིན་པོ་ཆེའི་མདོ་ལས་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་གསུང་གི་སྙིང་པོ་ཞེས་བྱ་བའི་ལེའུ།"],
[ "ཕགས་པ་ག་ཡཱ་མགོའི་རི་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ། ས"],
[ "ཆ"],
[ "འཕགས་པ་རྒྱན་སྟུག་པོ་བཀོད་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"],
[ "དང་པོ། སྟུག་པོའི་རིས་ཀྱི་ཡེ་ཤེས་ཀྱི་རྒྱན་ལས་བྱུང་ཞེས་བྱ་བའི་ལེའུ།"],
[ "གཉིས་པ། སྦྱིན་པའི་ལེའུ།"],
[ "གསུམ་པ། སྟུག་པོར་འཇུག་པ་ཞེས་བྱ་བའི་ལེའུ།"],
[ "བཞི་པ། མངལ་གྱི་སྐྱེ་བ་འབྱུང་བ་ཞེས་བྱ་བའི་ལེའུ།"],
[ "ལྔ་པ། བད་ག་གི་ལས་ཀྱི་བྱ་བ་སྤྱད་པ་ཞེས་བྱ་བའི་ལེའུ།"],
[ "དྲུག་པ། རྣལ་འབྱོར་རྣམ་པར་ཕྱེ་བའི་སྦྱོད་པ་ཞེས་བྱ་བའི་ལེའུ།"],
[ "བདུན་པ། འཕགས་པ་རྒྱན་སྟུག་པོ་ལས་ལས་ལེའུ།"],
[ "བརྒྱད་པ། རང་གི་རྣམ་པར་རིག་པའི་ཡུལ་ཞེས་བྱ་བའི་ལེའུ།"],
[ "གཟུགས་མང་རྒྱལ་པོས་རྡོ་རྗེ་སྙིང་པོ་ལ་དྲི་བ་ད་ང་ལན་གན་ང་བ་སོགས་བརྗོད་པ།"],
[ "འཕགས་པ་སྙིང་རྗེ་ཆེན་པོའི་པད་མ་དཀར་པོ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"],
[ "དང་པོ་། ཚངས་པའི་ལེའུ།"],
[ "གཉིས་པ། དེད་ད་པོན་གྱི་ལེའུ།"],
[ "གསུམ་པ། བརྒྱ་བྱིན་གྱི་ལེའུ།"],
[ "བཞི་པ།སྒྲ་ག་ཅན་ཟིན་གྱི་ལེའུ།"],
[ "ལྔ་པ། འོད་སྲུང་གི་ལེའུ།"],
[ "དྲུག་པ། ད་མ་པའི་ཆོས་འཛིན་པའི་ལེའུ།"],
[ "བདུན་པ། སྐུ་གདུང་མེད་པར་མི་འགྱུར་བའི་ལེའུ།"],
[ "བརྒྱད་པ། ཕྱག་འཚལ་བའི་ལེའུ།"],
[ "དགུ་པ། དགེ་བའི་རྩ་བའི་ལེའུ།"],
[ "བཅུ་པ། ཡོན་གྱི་བསོད་ན་མས་ཀྱི་ལེའུ།"],
[ "བཅུ་གཅིག་པ། དགེ་བའི་རྩ་བ་སྐྱེད་པའི་ལེའུ།"],
[ "བཅུ་གཉིས་པ། དམ་པའི་ཆོས་ཡོང་ས་སུ་གཏད་པ་ཞེས་བྱ་བའི་ལེའུ།"],
[ "བཅུ་གསུམ་པ། བསྟན་པའི་ལེའུ།"],
[ "འཕགས་པ་སྙིང་རྗེ་པད་མ་དཀར་པོ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"],
[ "དང་པོ། ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བ་ཞེས་བྱ་བའི་ལེའུ།"],
[ "གཉིས་པ། གཟུང་ས་ཀྱི་སྒོའི་ལེའུ།"],
[ "གསུམ་པ། སྦྱིན་པ་གཏོང་བའི་ལེའུ།"],
[ "བཞི་པ། ལུང་བསྟན་པའི་ཁེའུ"],
[ "ལྔ་པ། སྦྱིན་པའི་ལེའུ།"],
[ "ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་དང་ཆོས་བཞིའི་དགོས་པ་བསྟུས་ཏེ་བསྟན་པ།"],
[ "ཇ"],
[ "དམ་པའི་ཆོས་པད་མ་དཀར་པོ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"],
[ "དང་པོ། གླེང་གཞིའི་ལེའུ།"],
[ "གཉིས་པ། ཐབས་ལ་མཁས་པའི་ལེའུ།"],
[ "གསུམ་པ། དཔེའི་ལེའུ།"],
[ "བཞི་པ། མོས་པའི་ལེའུ།"],
[ "ལྔ་པ། སྨན་གྱི་ལེའུ།"],
[ "དྲུག་པ། ཉན་ཐོས་ལུང་བསྟན་པའི་ལེའུ།"],
[ "བདུན་པ། སྔོན་གྱི་སྦྱོར་བའི་ལེའུ།"],
[ "བརྒྱད་པ། དགེ་སློང་ལྔ་བརྒྱ་ལུང་བསྟན་པའི་ལེའུ།"],
[ "དགུ་པ། ཀུན་དགའ་བོ་དང་སྒྲ་གཅན་ཟིན་དང་ངགེ་སློང་ཉིས་སྟོང་ལུང་བསྟན་པའི་ལེའུ།"],
[ "བཅུ་པ། ཆོས་སྨྲ་བའི་ལེཔུ"],
[ "བཅུ་གཅིག་པ། མཆོད་རྟེན་བསྟན་པའི་ལེའུ།"],
[ "བཅུ་གཉིས་པ། སྤྲོ་བར་བྱ་བའི་ལེའུ།"],
[ "བཅུ་གསུམ་པ། བདེ་བར་གནས་པའི་ལེའུ།"],
[ "བཅུ་བཞི་པ། བྱང་ཆུབ་སེམས་དཔའ་ས་རུམ་ནས་འཐོན་པའི་ལེའུ།"],
[ "བཅོ་ལྔ་པ། དེ་བཞེན་གཤེགས་པའི་སྐུ་ཚེའི་ཚད་ཀྱི་ལེའུ།"],
[ "བཅུ་དྲུག་པ། བསོད་ནམས་ཀྱི་རྣམ་གྲངས་ཀྱི་ལེའུ།"],
[ "བཅུ་བདུན་པ། རྗེས་སུ་ཡི་རང་བའི་བསོད་ནམས་བསྟན་པའི་ལེའུ།"],
[ "བཅོ་བརྒྱད་པ། སྐྱེ་མཆེད་དྲུག་རྣམ་པར་དག་པའི་ཕན་ཡོན་གྱི་ལེའུ།"],
[ "བཅུ་དགུ་པ། རྟག་ཏུ་བརྙས་པའི་ལེའུ།"],
[ "ཉི་ཤུ་པ། དེ་བཞིན་གཤེགས་པའི་རྫུ་འཕྲུལ་མངོན་པར་འདུ་བྱེད་པའི་ལེའུ།"],
[ "ཉི་ཤུ་རྩ་གཅིག་པ། གཟུངས་སྔགས་ཀྱི་ལེའུ།"],
[ "ཉི་ཤུ་རྩ་གཉིས་པ། སྨན་གྱི་རྒྱལ་པོའི་སྔོན་གྱི་སྦྱོར་བའི་ལེའུ།"],
[ "ཉི་ཤུ་རྩ་གསུམ་པ། སང་སང་པོའི་དབྱངས་ཀྱི་ལེའུ།"],
[ "ཉི་ཤུ་རྩ་བཞི་པ། སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་རྣམ་པར་འཕྲུལ་པ་བསྟན་པ་ཀུན་ནས་སྒོའི་ལེའུ།"],
[ "ཉི་ཤུ་རྩ་ལྔ་པ། རྒྱལ་པོ་དགེ་བ་བཀོད་པའི་སྔོན་གྱི་སྦྱོར་བའི་ལེའུ།"],
[ "ཉི་ཤུ་རྩ་དྲུག་པ། ཀུན་ཏུ་བཟང་པོས་སྤྲོ་བར་བྱ་བའི་ལེའུ།"],
[ "ཉི་ཤུ་རྩ་བདུན་པ། ཡོངས་སུ་གཏད་པའི་ལེའུ།"],
[ "འཕགས་པ་ཆོས་ཐམས་ཅད་ཀྱི་ཡོན་ཏན་བཀོད་པའི་རྒྱལ་པོ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"],
[ "འཕགས་པ་བདེ་བ་ཅན་གྱི་བཀོད་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"],
[ "འཕགས་པ་ཟ་མ་ཏོག་བཀོད་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ། "],
[ "སེམས་དཔའ་ཆེན་པོ་སའི་སྤྱན་མཆོག་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དབུགས་ཕྱིན་པའི་ལག་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱམས་པ་དང་། དེ་ལྟ་བུ་དག་ལ་སོགས་པ་བྱང་ཆུབ་\nསེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱེ་བ་རྣམས་ཀྱང་ཚོགས་སོ། །གཞན་ཡང་དབང་ཕྱུག་དང་། མཐུ་བོ་ཆེ་ལ་སོགས་པ་ལྷའི་སྡེ་སུམ་བཅུ་རྩ་གཉིས་ཀྱི་ལྷའི་སྲས་པོ་རྣམས་ཀྱང་ཚོགས་སོ། །གཞན་ཡང་ལྷའི་སྡེ་སུམ་བཅུ་རྩ་\nགསུམ་གྱི་ལྷའི་བུ་རྣམས་ཚོགས་ཏེ། ལྷའི་བུ་དབང་ཕྱུག་ཆེན་པོ་དང་། ཉི་མ་དང་ཟླ་བ་དང་། རླུང་གི་ལྷ་དང་། ཆུའི་ལྷ་ལ་སོགས་པ་ལྷའི་བུ་དེ་དག་ཚོགས་པ་དང་ལྷན་ཅིག་ཏུ་བརྒྱ་བྱིན་ལྷའི་དབང་པོ་དང་། ཚངས་པ་མི་མཇེད་ཀྱི་བདག་པོ་དག་ཀྱང་\nཚོགས་སོ། །འཁོར་དེ་ན་ཀླུའི་རྒྱལ་པོ་བརྒྱ་སྟོང་དུ་མ་ཚོགས་པ་རྣམས་འདི་ལྟ་སྟེ། ཀླུའི་རྒྱལ་པོ་ཨུད་པ་ལ་དང་། ཀླུའི་རྒྱལ་པོ་ཤིང་ཨེ་ལའི་ལོ་མ་ཅན་དང་། ཀླུའི་རྒྱལ་པོ་ཉ་ཟན་དང་། ཀླུའི་རྒྱལ་པོ་བ་ལང་གི་བདག་པོ་དང་། \nཀླུའི་རྒྱལ་པོ་མགོ་བརྒྱ་པ་དང་། ཀླུའི་རྒྱལ་པོ་ཧུ་ལུ་ཏ་དང་། ཀླུའི་རྒྱལ་པོ་འཇོག་པོ་དང་། ཀླུའི་རྒྱལ་པོ་གླང་མགོ་དང་། ཀླུའི་རྒྱལ་པོ་རི་དགས་མགོ་དང་། ཀླུའི་རྒྱལ་པོ་དགའ་བོ་དང་། བསྙེན་དགའ་བོ་དང་། ཀླུའི་རྒྱལ་པོ་བད་སའི་རིགས་\nཀྱི་བུ་དང་། ཀླུའི་རྒྱལ་པོ་མ་དྲོས་པ་དང་། ཀླུའི་རྒྱལ་པོ་རྒྱ་མཚོ་མཆིང་རྣམ་དང་། དེ་ལྟ་བུ་དག་ལ་སོགས་པ་ཀླུའི་རྒྱལ་པོ་བརྒྱ་སྟོང་དུ་མ་དག་ཀྱང་ཚོགས་སོ། །དྲི་ཟའི་རྒྱལ་པོ་བརྒྱ་སྟོང་དུ་མ་དག་ཀྱང་ཚོགས་པ་འདི་ལྟ་སྟེ། དྲི་ཟའི་\nརྒྱལ་པོ་རྔའི་དབྱངས་ཀྱི་རྒྱལ་པོ་དང་། དྲི་ཟའི་རྒྱལ་པོ་ཡིད་དུ་འོང་བའི་དབྱངས་དང་། དྲི་ཟའི་རྒྱལ་པོ་ལག་པ་སྟོང་པ་དང་། དྲི་ཟའི་རྒྱལ་པོ་བློ་གྲོས་ཆེན་པོ་དང་། དྲི་ཟའི་རྒྱལ་པོ་ལུས་སིམ་པར་བྱེད་པ་དང་། དྲི་ཟའི་རྒྱལ་པོ་སིལ་སྙན་སྒྲ་\nབསྒྲགས་དང་། དྲི་ཟའི་རྒྱལ་པོ་རྒྱན་གྱིས་བརྒྱན་པ་དང་། དྲི་ཟའི་རྒྱལ་པོ་གཞོན་ནུར་སྣང་བ་དང་། དྲི་ཟའི་རྒྱལ་པོ་ལག་པ་བཟང་པོ་དང་ལྡན་པ་དང་། དྲི་ཟའི་རྒྱལ་པོ་ཆོས་དགའ་དང་དེ་ལྟ་བུ་ལ་སོགས་པ་དྲི་ཟའི་རྒྱལ་པོ་བརྒྱ་སྟོང་དུ་མ་དག་ཚོགས་ཅན་གྱི་བཀོད་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆོན་པོའི་མདོ་རྫོགས་སོ།། །།རྒྱ་གར་སྐད་དུ། ཨཱརྱ་ཀ་རཎ་ཌ་བྱུ་ཧ་ནཱ་མ་མ་ཧཱ་ཡཱ་ན་སཱུ་ཏྲ། བོད་སྐད་དུ། འཕགས་པ་ཟ་མ་ཏོག་བཀོད་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་\nཔོའི་མདོ།"],
[ "ལེའུ་དང་པོ"],
[ "ལེའུ་གཉིས་པ།"],
[ "འཕགས་པ་དཀོན་མཆོག་གི་ཟ་མ་ཏོག་ཅེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"],
[ "འཕགས་པ་རིན་པོ་ཆེའི་མཐའ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"],
[ "ཉ"],
[ "འཕགས་པ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་ཆེན་པོའི་མདོ།"],
[ "དང་པོ། སྐུ་ཚེའི་ལེའུ།"],
[ "གཉིས་པ། རྡོ་རྗེའི་སྐུ་ཞེས་བྱ་བའི་ལེའུ།"],
[ "གསུམ་པ། མཚན་གྱི་ཡོན་ཏ་ན་བརྗོད་པ་ཞེས་བྱ་བའི་ལེའུ།"],
[ "ལྔ་པ། འཁོར་མང་པོས་ཀྱུན་ན་ས་དྲིས་པ་ཞེས་བྱ་བའི་ལེའུ།"],
[ "དྲུག་པ། འཕགས་པའི་སྦྱོད་པ་ཞེས་བྱ་བའི་ལེའུ།"],
[ "བདུན་པ། ཚངས་པར་སྦྱོད་པ་ཞེས་བྱ་བའི་ལེའུ།"],
[ "བརྒྱད་པ། བུས་པ་ཆུང་ངུ་སྦྱོད་པ་ཞེས་བྱ་བའི་ལེའུ།"],
[ "དགུ་པ།་་་་་་་་་་་་་་་་་་་་་་་་"],
[ "ཏ"],
[ "འཕགས་པ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་ཆེན་པོའི་མདོ།"],
[ "བཅུ་པ། བྱང་ཆུབ་སེམས་ད་པའ་ཀུན་དུ་སྣང་བ་མཐོ་བཙུན་ད་པལ་གྱི་རྒྱལ་པོ་ཞེས་བྱ་བས་ཡོང་ས་སུ་དྲིས་པའི་ལེའུ།"],
[ "བཅུ་གཅིག་པ། བྱང་ཆུབ་སེམས་ད་པའ་སེང་གེ་སྒྲ་ཞེས་བྱ་བས་ཡོང་ས་སུ་དྲིས་པའི་ལེའུ།"],
[ "བཅུ་གཉིས་པ། འོད་སྲུང་གིས་ཡོང་ས་སུ་དྲིས་པ་ཞེས་བྱ་བའི་ལེའུ།"],
[ "བཅུ་གསུམ་པ། ཚེ་ད་ང་ལྡན་པ་ཅང་ཤེས་ཀཽཎྡྲི་ནྱའི་ལེའུ།"],
[ "བཅུ་བཞི་པ། བསྟན་པ་གཞག་པའི་ལེའུ།"],
[ "བཅོ་ལྔ་པ། སྐུ་མྱ་ངན་ལས་འདས་ཤིང་ཞུགས་ལ་བཞེན་པའི་ལེའུ།"],
[ "ཐ"],
[ "འཕགས་པ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་ཆེན་པོ་ཐེག་པ་ཆེན་པོའི་མདོ།"],
[ "དང་པོ། འཚེ་བ་མེད་པའི་ཕུང་པོའི་ལེའུ།"],
[ "གཉིས་པ། རྡོ་རྗེ་ལྟར་མི་ཤིགས་པའི་སྐུའི་ཕུང་པོ་ཞེས་བྱ་བའི་ལེའུ།"],
[ "གསུམ་པ། མདོའི་མིང་གི་གཏན་ཚིགས་དང་ཡོན་ཏན་གྱི་ཚུལ་གྱི་ལེའུ།"],
[ "བཞི་པ། བྱང་ཆུབ་སེམས་དཔའ་སྣ་གྲངས་བཞིས་ཆོས་སྟོན་པའི་ལེའུ།"],
[ "ལྔ་པ། སྲིན་པོ་ལ་སོགས་པ་འདུས་པས་ཞུས་པ་ཞེས་བྱ་བའི་ལེའུ།"],
[ "འཕགས་པ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་ཆེན་པོའི་མདོ།"],
[ "འཕགས་པ་འདའ་ཀ་ཡེ་ཤེས་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"],
[ "སངས་རྒྱས་ཀྱི་མཛོད་ཀྱི་ཆོས་ཀྱི་ཡི་གེ །"],
[ "དང་པོ། ཆོས་སོ་ཅོག་གི་བདེན་པའི་མཚན་མའི་ལེའུ།"],
[ "གཉིས་པ། སངས་རྒྱས་བསམ་པའི་ལེའུ།"],
[ "གསུམ་པ། ཆོས་བསམ་པའི་ལེའུ།"],
[ "བཞི་པ། དགེ་འདུན་བསམ་པའི་ལེའུ།"],
[ "ལྔ་པ། ཚུལ་ཁྲིམས་ག་ཙང་མའི་ལེའུ།"],
[ "དྲུག་པ། ག་ཙང་མའི་ཆོས་ཀྱི་ལེའུ།"],
[ "བདུན་པ། གནའ་འདས་པའི་ལེའུ།"],
[ "བརྒྱད་པ། གཙང་མ་མཐོང་བའི་ལེའུ།"],
[ "དགུ་པ། དོགས་པ་བྱེ་བྲག་ཕྱེད་པའི་ལེའུ།"],
[ "བཅུ་པ། བཅོལ་བའི་ལེའུ།"],
[ "འཕགས་པ་དཀོན་མཆོག་འབྱུང་གནས་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"],
[ "འཕགས་པ་གསེར་གྱི་མདོ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"],
[ "འཕགས་པ་གསེར་གྱི་བྱེ་མ་ལྟ་བུ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"],
[ "ད"],
[ "འཕགས་པ་ཆོས་ཐམས་ཅད་ཀྱི་རང་བཞིན་མཉམ་པ་ཉིད་རྣམ་པར་སྤྲོས་པ་ཏིང་ངེ་འཛིན་གྱི་རྒྱལ་པོ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"],
[ "དང་པོ། གླེང་གཞིའི་ལེའུ།"],
[ "གཉིས་པ། སཱ་ལའི་དབང་པོའི་རྒྱལ་པོའི་ལེའུ།"],
[ "གསུམ་པ། སངས་རྒྱས་ཀྱི་ཡོན་ཏན་ཡང་དག་པར་བསྔགས་པའི་ལེའུ།"],
[ "བཞི་པ། ཏིང་ངེ་འཛིན་གྱི་ལེའུ།"],
[ "ལྔ་པ། དབྱངས་བྱིན་གྱ་ལེའུ།"],
[ "དྲུག་པ། ཏིང་ངེ་འཛིན་ཡོངས་སུ་སྦྱང་བ་བྱ་བའི་ལེའུ།"],
[ "བདུན་པ། བཟོད་པ་ལ་འཇུག་པའི་ལེའུ།"],
[ "བརྒྱད་པ། དངོས་པོ་མེད་པ་ལས་བྱུང་བའི་ལེའུ།"],
[ "དགུ་པ། ཆོས་ཟབ་མོ་ལ་བཟོད་པའི་ལེའུ།"],
[ "བཅུ་པ། གྲོང་ཁྱེར་དུ་གཤེགས་པའི་ལེའུ།"],
[ "བཅུ་གཅིག་པ། མདོ་སྡེ་འཛིན་པའི་ལེའུ།"],
[ "བཅུ་གཉིས་པ། ཏིང་ངེ་འཛིན་ལ་རྗེས་སུ་སློབ་པའི་ལེའུ།"],
[ "བཅུ་གསུམ་པ། ཏིང་ངེ་འཛིན་ངེས་པར་བསྟན་པའི་ལེའུ།"],
[ "བཅུ་བཞི་པ། འཛུམ་པ་བསྟན་པའི་ལེའུ།"],
[ "བཅོ་ལྔ་པ། འཛུམ་པ་ལུང་བསྟན་པའི་ལེའུ།"],
[ "བཅུ་དྲུག་པ། སྔོན་བྱུང་བའི་ལེའུ།"],
[ "བཅུ་བདུན་པ། སངས་རྒྱས་མང་པོའི་ཏིང་ངེ་འཛིན་གྱི་སྒོའི་ལེའུ།"],
[ "བཅྭ་བརྒྱད་པ། ཏིང་ངེ་འཛིན་རྗེས་སུ་གཏད་པའི་ལེའུ།"],
[ "བཅུ་དགུ་པ། སངས་རྒྱས་ཀྱི་ཆོས་བསམ་གྱིས་མི་ཁྱབ་པ་ངེས་པར་བསྟན་པའི་ལེའུ།"],
[ "ཉི་ཤུ་པ། དབང་པོའི་ཏོག་གི་རྒྱལ་མཚན་གྱི་རྒྱལ་པོའི་ལེའུ།"],
[ "ཉི་ཤུ་རྩ་གཅིག་པ། སྔོན་བྱུང་བའི་ལེའུ།"],
[ "ཉི་ཤུ་རྩ་གཉིས་པ། ལུས་ངེས་པར་བསྟན་པའི་ལེའུ།"],
[ "ཉི་ཤུ་རྩ་གསུམ་པ། དེ་བཞིན་གཤེགས་པའི་སྐུ་ངེས་པར་བསྟན་པའི་ལེའུ།"],
[ "ཉི་ཤུ་རྩ་བཞི་པ། དེ་བཞིན་གཤེགས་པ་བསམ་གྱིས་མི་ཁྱབ་པའི་ལེའུ།"],
[ "ཉི་ཤུ་རྩ་ལྔ་པ། སོ་སོ་ཡང་དག་པར་རིག་པ་ལ་འཇུག་པའི་ལེའུ།"],
[ "ཉི་ཤུ་རྩ་དྲུག་པ། རྗེས་སུ་ཡི་རང་བའི་ལེའུ།"],
[ "ཉི་ཤུ་རྩ་བདུན་པ། སྦྱིན་པའི་ཕན་ཡོན་གྱི་ལེའུ།"],
[ "ཉི་ཤུ་རྩ་བརྒྱད་པ། ཚུལ་ཁྲིམས་ངེས་པར་བསྟན་པའི་ལེའུ།"],
[ "ཉི་ཤུ་རྩ་དགུ་པ། ཕན་ཡོན་བཅུའི་ལེའུ།"],
[ "སུམ་ཅུ་པ། གཟི་བརྗིད་ཚོགས་ཀྱི་རྒྱལ་པོའི་ལེའུ།"],
[ "སུམ་ཅུ་རྩ་གཅིག་པ། ཕན་ཡོན་གྱི་ལེའུ།"],
[ "སུམ་ཅུ་རྩ་གཉིས་པ། ཆོས་ཐམས་ཅད་ཀྱི་རང་བཞིན་ངེས་པར་བསྟན་པའི་ལེའུ།"],
[ "སུམ་ཅུ་རྩ་གསུམ་པ། མདོ་སྡེ་འཛིན་པའི་ཕན་ཡོན་གྱི་ལེའུ།"],
[ "སུམ་ཅུ་རྩ་བཞི་པ། བདེ་བས་བྱིན་གྱི་ལེའུ།"],
[ "སུམ་ཅུ་རྩ་ལྔ་པ། ཡེ་ཤེས་ལྡན་གྱི་ལེའུ།"],
[ "སུམ་ཅུ་རྩ་དྲུག་པ། མེ་ཏོག་ཟླ་མཛེས་ཀྱི་ལེའུ།"],
[ "སུམ་ཅུ་རྩ་བདུན་པ། ཚུལ་ཁྲིམས་ཀྱི་ཕུང་པོ་ངེས་པར་བསྟན་པའི་ལེའུ།"],
[ "སུམ་ཅུ་རྩ་བརྒྱད་པ། སྙན་པའི་འོད་ཀྱི་ལེའུ།"],
[ "ལུས་དང་ངག་དང་ཡིད་ཀྱི་སྡོམ་པ་དང་ཚིག་སུམ་བརྒྱ་པོ་རྒྱས་པར་བསྟན་པ་སོགས་བཤད་པ།"],
[ "འཕགས་པ་ཆོས་ཉིད་རང་གི་ངོ་བོ་སྟོང་པ་ཉིད་ལས་མི་གཡོ་བར་ཐ་དད་པར་ཐམས་ཅད་ལ་སྣང་བའི་མདོ།"],
[ "འཕགས་པ་རབ་ཏུ་ཞི་བ་རྣམ་པར་ངེས་པའི་ཆོ་འཕྲུལ་གྱི་ཏིང་ངེ་འཛིན་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"],
[ "འཕགས་པ་སྒྱུ་མ་ལྟ་བུའི་ཏིང་ངེ་འཛིན་ཅེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"],
[ "ཕགས་པ་དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་ཀྱི་ཕྱག་རྒྱའི་ཏིང་ངེ་འཛིན་ཅེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"],
[ "འཕགས་པ་དཔའ་བར་འགྲོ་བའི་ཏིང་ངེ་འཛིན་ཅེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"],
[ "ན"],
[ "འཕགས་པ་ད་ལྟར་གྱི་སངས་རྒྱས་མངོན་སུམ་དུ་བཞུགས་པའི་ཏིང་ངེ་འཛིན་ཅེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"],
[ "ལེའུ་དང་པོ"],
[ "ལེའུ་གཉིས་པ།"],
[ "ལེའུ་གསུམ་པ།"],
[ "ལེའུ་བཞི་པ།"],
[ "ལེའུ་ལྔ་པ།"],
[ "ལེའུ་དྲུག་པ།"],
[ "ལེའུ་བདུན་པ།"],
[ "ལེའུ་བརྒྱད་པ།"],
[ "ལེའུ་དགུ་པ།"],
[ "ལེའུ་བཅུ་པ།"],
[ "ལེའུ་བཅུ་གཅིག་པ།"],
[ "ལེའུ་བཅུ་གཉིས་པ།"],
[ "ལེའུ་བཅུ་གསུམ་པ།"],
[ "ལེའུ་བཅུ་བཞི་པ།"],
[ "ལེའུ་བཅོ་ལྔ་པ།"],
[ "ལེའུ་བཅུ་དྲུག་པ།"],
[ "ལེའུ་བཅུ་བདུན་པ།"],
[ "ལེའུ་བཅྭ་བརྒྱད་པ།"],
[ "ལེའུ་བཅུ་དགུ་པ།"],
[ "ལེའུ་ཉི་ཤུ་པ།"],
[ "ལེའུ་ཉེར་གཅིག་པ།"],
[ "ལེའུ་ཉེར་གཉིས་པ།"],
[ "ལེའུ་ཉེར་གསུམ་པ།"],
[ "ལེའུ་ཉེར་བཞི་པ།"],
[ "ལེའུ་ཉེར་ལྔ་པ།"],
[ "འཕགས་པ་བསོད་ནམས་ཐམས་ཅད་བསྡུས་པའི་ཏིང་ངེ་འཛིན་ཅེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"],
[ "ལེའུ་དང་པོ"],
[ "ལེའུ་གཉིས་པ།"],
[ "རྡོ་རྗེའི་ཏིང་ངེ་འཛིན་གྱི་ཆོས་ཀྱི་ཡི་གེ།"],
[ "དང་པོ། གླེང་གཞིའི་ལེའུ།"],
[ "གཉིས་པ། མཚན་མ་མེད་པའི་ཆོས་ཀྱི་ལེའུ།"],
[ "གསུམ་པ། སྐྱེ་བ་མེད་པ་སྤྱོད་པའི་ལེའུ།"],
[ "བཞི་པ། ཕྱི་མོའི་ཚོར་བའི་ཕན་བསོད་ཀྱི་ལེའུ།"],
[ "ལྔ་པ། ཡང་དག་པ་བདེན་པའི་དབྱིངས་སུ་འཇུག་པའི་ལེའུ།"],
[ "དྲུག་པ། ཡང་དག་པའི་ངོ་བོ་ཉིད་སྟོང་པའི་ལེའུ།"],
[ "བདུན་པ། ཡང་དག་པར་གཤེགས་པའི་མཛོད་ཀྱི་ལེའུ།"],
[ "བརྒྱད་པ། མདོ་འཛིན་པའི་ལེའུ།"],
[ "འཕགས་པ་ཁྱེའུ་བཞིའི་ཏིང་ངེ་འཛིན་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"],
[ "འཕགས་པ་ཏིང་ངེ་འཛིན་མཆོག་དམ་པ།"],
[ "འཕགས་པ་འདུས་པ་ཆེན་པོ་རིན་པོ་ཆེ་ཏོག་གི་གཟུངས་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"],
[ "དང་པོ། བདུད་སྤ་བཀོང་བའིལེའུ།"],
[ "གཉིས་པ། སྔོན་བྱུང་བའི་ལེའུ།"],
[ "གསུམ་པ། བདུད་བཏུལ་བའི་ལེའུ།"],
[ "བཞི་པ། དྲང་སྲོང་སྐར་མ་ལ་དགའ་བའི་ལེའུ།"],
[ "ལྔ་པ། མཚན་ཉིད་ཀྱི་ལེའུ།"],
[ "དྲུག་པ། གཟུངས་ཀྱི་ལེའུ།"],
[ "བདུན་པ། དམ་པའི་ཆོས་ཡོངས་སུ་གཟུང་བའི་ལེའུ།"],
[ "བརྒྱད་པ། ལུང་བསྟན་པའི་ལེའུ།"],
[ "དགུ་པ། སྙིང་བརྩེ་བའི་ལེའུ།"],
[ "བཅུ་པ། ཀུན་ཏུ་བསྲུང་བའི་ལེའུ།"],
[ "བཅུ་གཅིག་པ། དམ་པའི་ཆོས་ཀྱི་ཚུལ་བསྲུང་བའི་ལེའུ།"],
[ "བཅུ་གཉིས་པ། འབྲོག་གནས་ཀྱི་ལེའུ།"],
[ "བཅུ་གསུམ་པ། མཐར་ཕྱིན་པའི་ལེའུ།"],
[ " འཕགས་པ་རྡོ་རྗེའི་སྙིང་པོའི་གཟུངས་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"],
[ "འཕགས་པ་སྒོ་མཐའ་ཡས་པ་སྒྲུབ་པ་ཞེས་བྱ་བའི་གཟུངས།"],
[ "འཕགས་པ་སྒོ་དྲུག་པ་ཞེས་བྱ་བའི་གཟུངས།"],
[ "པ"],
[ "འཕགས་པ་རྣམ་པར་མི་རྟོག་པ་འཇུག་པ་ཞེས་བྱ་བའི་གཟུངས།"],
[ "ཡང་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་སྟེ། རིགས་ཀྱི་བུ་དག་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པའི་རྣམ་པར་རྟོག་པ་ཐམས་ཅད་ཀྱིས་གང་རྣམ་པར་\nམ་བརྟགས་པ་དེ་རྣམ་པར་མི་རྟོག་པའི་ཆོས་ཀྱི་དབྱིངས་སོ་ཞེས་ཀྱང་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་། །དེ་ལྟར་འདི་ནི་རྣམ་པར་མི་རྟོག་པའི་དབྱིངས་ལ་འཇུག་པའི་ཚུལ་ཡིན་ཏེ། རིགས་ཀྱི་བུ་དག་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་རྒྱ་གར་སྐད་དུ། ཨཱརྱ་ཨ་བི་ཀལྤ་པྲ་བེ་ཤ་ནཱ་མ་དྷཱ་ར་ཎཱི། བོད་སྐད་དུ། འཕགས་པ་རྣམ་\nཔར་མི་རྟོག་པར་འཇུག་པ་ཞེས་བྱ་བའི་གཟུངས།"],
[ "ཚིགས་སུ་བཅད་པ་གཉིས་པའི་གཟུངས།"],
[ "འཕགས་པ་ཐེག་པ་ཆེན་པོ་ལ་དད་པ་རབ་ཏུ་སྒོམ་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"],
[ "དང་པོ། མཚན་ཉིད་རབ་ཏུ་དབྱེ་བའི་ལེའུ།"],
[ "གཉིས་པ། སྐྱེ་བའི་ལེའུ།"],
[ "གསུམ་པ། རབ་ཏུ་དབྱེ་བའི་ལེའུ།"],
[ "བཞི་པ།"],
[ "འཕགས་པ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་ཡུལ་གྱི་ཐབས་ཀྱི་ཡུལ་ལ་རྣམ་པར་འཕྲུལ་པ་བསྟན་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"],
[ "ང་དག་ལྷག་པའི་བསམ་པ་ཆེ་མེད་པ། །ཡིད་ཆེས་མེད་པ་མོས་པ་ཉམས་པས་ན་བ་ཞེས་བྱ་བར་ཡང་ཟུང་ཤིག །དེ་བས་ན་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཐེག་པ་ཆེན་པོ་ལ་དད་པ་རབ་ཏུ་སྒོམ་པ་ཞེས་བྱ་བའི་ཚིག་བླ་དགས་སོ། །བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་དང་། ཐམས་\nཅད་དང་ལྡན་པའི་འཁོར་དེ་དང་། ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་དང་། དྲི་ཟར་བཅས་པའི་འཇིག་རྟེན་བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པ་ལ་ཡི་རངས་ཏེ་མངོན་པར་བསྟོད་དོ། །འཕགས་པ་ཐེག་པ་ཆེན་པོ་ལ་དད་པ་རབ་ཏུ་སྒོམ་པ་ཞེས་བྱ་བ་\nཐེག་པ་ཆེན་པོའི་མདོ། རྫོགས་སོ།།  །།རྒྱ་གར་གྱི་མཁན་པོ་ཛི་ན་མི་ཏྲ་དང་། དཱ་ན་ཤཱི་ལ་དང་། ཞུ་ཆེན་གྱི་ལོཙྪ་བ་བན་དེ་ཡེ་ཤེས་སྡེ་ལ་སོགས་པས་ཞུས་ཤིང་བྲིས་ཏེ་གཏན་ལ་ཕབ་པ། ཞུས་ཏེ་དག་གོ།  །ཡང་ཞུས་སྙེ།  །སྐར་མས་\nཞུས། ཕྱིས་བཅོས་སོ།།  །།རྒྱ་གར་སྐད་དུ། །ཨཱརྱ་བོ་དྷི་ས་ཏྭ་གོ་ཙ་ར་ཨུ་པཱ་ཡ་བི་ཥ་ཡ་བི་ཀུརྦ་ཎ་ནི་རེད་དེ་ཤ་ནཱ་མ་མ་ཧཱ་ཡཱ་ན་སཱུ་ཏྲ། བོད་སྐད་དུ། འཕགས་པ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་ཡུལ་གྱི་ཐབས་ཀྱི་ཡུལ་ལ་རྣམ་པར་\nའཕྲུལ་པ་བསྟན་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"],
[ "དང་པོ། གླེང་གཞིའི་ལེའུ།"],
[ "གཉིས་པ། ཕ་རོལ་ཏུ་ཕྱིན་པ་བསྟན་པའི་ལེའུ།"],
[ "གསུམ་པ། ཐབས་ལ་མཁས་པའི་ལེའུ།"],
[ "བཞི་པ། ཐེག་པ་གཅིག་ཏུ་བསྟན་པའི་ལེའུ།"],
[ "ལྔ་པ། རྒྱལ་པོའི་དྲུང་དུ་ཕྱིན་པའི་ལེའུ།"],
[ "དྲུག་པ། རྒྱལ་པོའི་ཚུལ་གྱི་ལེའུ།"],
[ "བདུན་པ། བདིན་སྨྲ་མགྲོན་དུ་བོས་པའི་ལེའུ།"],
[ "བརྒྱད་པ། ཡོན་ཏན་དང་སྐྱོན་བསྟན་པའི་ལེའུ།"],
[ "འཕགས་པ་དེ་བཞིན་གཤེགས་པའི་སྙིང་རྗེ་ཆེན་པོ་ངེས་པར་བསྟན་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"],
[ "འཕགས་པ་ནམ་མཁའ་མཛོད་ཀྱིས་ཞུས་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"],
[ "འཕགས་པ་བྱམས་པས་ཞུས་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"],
[ "ིས། བསྒྱུར་དགོས་པ་བསྒྱུར་ཞིང་ད་མི་བཅོའོ།།  རྒྱ་གར་སྐད་དུ། ཨཱརྱ་མཻ་ཏྲི་པ་རི་པྲཱིཙྪ་ནཱ་མ་མ་ཧཱ་ཡཱ་ན་སཱུ་ཏྲ། བོད་སྐད་དུ།  འཕགས་པ་བྱམས་པས་\nཞུས་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"],
[ "འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གིས་ཞུས་པ་ཆོས་བདུན་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"],
[ "འཕགས་པ་སྤོབས་པའི་བློ་གྲོས་ཀྱིས་ཞུས་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"],
[ "ཕ"],
[ "འཕགས་པ་བློ་གྲོས་རྒྱ་མཚོས་ཞུས་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"],
[ "དང་པོ། ཐམས་ཅད་མཁྱེན་པའི་སེམས་རིན་པོ་ཆེ་ཡོངས་སུ་སྦྱང་བའི་ལེའུ།"],
[ "གཉིས་པ། གནོད་པ་བཟོད་པ་དང་ངེས་པར་འབིགས་པ་ཞེས་བྱ་བའི་ལེའུ།"],
[ "གསུམ་པ། ཏིང་ངེ་འཛིན་བསྟན་པའི་ལེའུ།"],
[ "བཞི་པ། དཔེ་བསྟན་པའི་ལེའུ།"],
[ "ལྔ་པ། བརྩོན་འགྲུས་བརྩམས་པའི་ལེའུ།"],
[ "དྲུག་པ། སངས་རྒྱས་ཀྱི་ཆོས་བསྟན་པའི་ལེའུ།"],
[ "བདུན་པ། ཡོངས་སུ་གཏད་པའི་ལེའུ།"],
[ "བརྒྱད་པ། ཆོས་ཀྱི་སྒོའི་ལེའུ།"],
[ "དགུ་པ། ཡོངས་སུ་བསྔོ་བའི་ལེའུ།"],
[ "བཅུ་པ། སྔོན་བྱུང་བའི་ལེའུ།"],
[ "བཅུ་གཅིག་པ། སངས་རྒྱས་ཀྱི་ཞིང་ཀུན་དུ་བསྟན་པའི་ལེའུ།"],
[ "བཅུ་གཉིས་པ། བྱིན་གྱི་རླབས་ཀྱི་ལེའུ།"],
[ "འཕགས་པ་ཀླུའི་རྒྱལ་པོ་རྒྱ་མཚོས་ཞུས་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"],
[ "དང་པོ། གླེང་གཞིའི་ལེའུ།"],
[ "གཉིས་པ། སྨོན་ལམ་གྱི་ལེའུ།"],
[ "གསུམ་པ། མི་ཟད་པའི་ཟ་མ་ཏོག་གི་གཟུངས་ཀྱི་ལེའུ།"],
[ "བཞི་པ། མི་ཟད་པའི་ཟ་མ་ཏོག་གི་གཟུངས་ཀྱི་ཕན་ཡོན་གྱི་ལེའུ།"],
[ "ལྔ་པ། ལུང་བསྟན་པའི་ལེའུ།"],
[ "དྲུག་པ། དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ལ་གན་ས་པ་ཞེས་བྱ་བའི་ལེའུ།"],
[ "བདུན་པ། ཀླུ་ཡོངས་སུ་བསྐྱབ་པ་ཞེས་བྱ་བའི་ལེའུ།"],
[ "བརྒྱད་པ། ཀླུའི་རྒྱལ་པོ་རྒྱ་མཚོ་ལུང་བསྟན་པའི་ལེའུ།"],
[ "དགུ་པ། ཆོས་ཐམས་ཅད་རང་བཞིན་གྱིས་ཡོངས་སུ་དག་པའི་ལེའུ།"],
[ "འཕགས་པ་ཀླུའི་རྒྱལ་པོ་རྒྱ་མཚོས་ཞུས་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"],
[ "འཕགས་པ་ཀླུའི་རྒྱལ་\n\n\nཔོ་རྒྱ་མཚོས་ཞུས་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"],
[ " འཕགས་པ་ཀླུའི་རྒྱལ་པོ་མ་དྲོས་པས་ཞུས་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"],
[ "དེ་དག་གིས་མངོན་པར་འཕགས་པ་ཡིན།དང་། ཆོས་ཐམས་ཅད་ལ་བདག་མེད་པར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་བསྟན་པ་མི་ཟད་པའི་ཤེས་པ་རབ་ཏུ་འཇུག་པ་དང་། མྱ་ངན་ལས་འདས་པ་ཞི་བར་བྱང་ཆུབ་སེམས་དཔའ་\nསེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་བསྟན་པ་མི་ཟད་པའི་ཤེས་པ་རབ་ཏུ་འཇུག་པ་སྟེ། ཀླུའི་བདག་པོ་ཆོས་ཀྱི་མདོ་བཞི་པོ་འདི་དག་བརྗོད་ན་གང་དག་བརྗོད་པས་ཆོས་ཀྱི་ཕུང་པོ་བརྒྱད་ཁྲི་བཞི་སྟོང་བརྗོད་པར་འགྱུར་\nབ་རྣམས་ཡིན་ནོ། །བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་ཅེས་བཀའ་སྩལ་ནས། དགེ་སློང་དེ་དག་དང་། བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ཡི་རངས་ཏེ། བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པ་ལ་མངོན་པར་བསྟོད་\nདོ།།  །།འཕགས་པ་ཀླུའི་རྒྱལ་པོ་རྒྱ་མཚོས་ཞུས་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ། རྫོགས་སོ།།  །།རྒྱ་གར་གྱི་མཁན་པོ་སུ་རེནྡྲ་བོ་དྷི་དང་། ཞུ་ཆེན་གྱི་ལོཙྪ་བ་བནྡེ་ཡེ་ཤེས་སྡེས་བསྒྱུར་ཅིང་ཞུས་ཏེ་\nགཏན་ལ་ཕབ་པ།།  །།རྒྱ་གར་སྐད་དུ། ཨཱརྱ་ཨ་ན་བ་ཏཔྟ་ནཱ་ག་རཱ་ཛ་པ་རི་པྲྀཙྪཱ་ནཱ་མ་མ་ཧཱ་ཡཱ་ན་སཱུ་ཏྲ། བོད་སྐད་དུ།  འཕགས་པ་ཀླུའི་རྒྱལ་པོ་མ་དྲོས་པས་ཞུས་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་\nམདོ།"],
[ "འཕགས་པ་མི་འམ་ཅིའི་རྒྱལ་པོ་སྡོང་པོས་ཞུས་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"],
[ "ལ་འཇུག་པའི་ཆོ་ག་\nཤེས་པ། ཕྱིར་མི་ལྡོག་པའི་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བ། མཚན་ཉིད་ཀྱི་ཕྱག་བརྒྱའི་ཏིང་ངེ་འཛིན་རབ་ཏུ་ཐོབ་པ། རྡོ་རྗེ་དཀྱིལ་འཁོར་གྱི་ཏིང་ངེ་འཛིན་ལ་འཇུག་པའི་ཡེ་ཤེས་ལ་མཁས་པ། ཆོས་ཐམས་ཅད་ལ་དབང་བྱེད་\nཔའི་ཏིང་ངེ་འཛིན་མངོན་དུ་གྱུར་པ། ཆོས་དཀོན་མཆོག་གི་སྒྲོན་མ་འཛིན་པ། སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་ཀྱི་རྒྱུད་ལ་རྣམ་པར་ལྟ་བ། སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་ཀྱི་བསམ་པ་ལ་རྣམ་པར་ལྟ་བར་མཁས་པ་\nསེམས་ཅན་ཐམས་ཅད་ལ་སངས་རྒྱས་ཀྱི་ཡེ་ཤེས་ཀྱི་བྱ་བས་སོ་སོར་ཉེ་བར་གནས་པ་རྣམ་པའི་མཆོག་ཐམས་ཅད་དང་ལྡན་པའི་ཡོན་ཏན་རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱིས་བརྒྱན་པ། བསྐལ་པ་ཐམས་ཅད་དུ་བལྡགས་པ་\nཡོངས་སུ་བརྗོད་ཀྱང་མཐར་མི་ཕྱིན་པ་ཤ་སྟག་ལ་འདི་ལྟ་སྟེ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དགའ་བྱེད་དང་། དགའ་འབྱུང་དང་། ལག་ན་རིན་པོ་ཆེ་དང་། རིན་ཆེན་མེ་ཏོག་དང་། རིན་པོ་ཆེའི་ཏོག་\nདང་། མཐོང་དགའ་དང་། མིག་གིས་མཐོང་དགའ་དང་། མཛེས་པའི་བློ་གྲོས་དང་། དགའ་ཞིང་མཆོག་ཏུ་དགའ་བྱེད་དང་། ས་འཛིན་དང་། སྤྱན་རས་གཟིགས་དབང་ཕྱུག་དང་། མཐུ་ཆེན་ཐོབ་དང་། དཔལ་ཆེན་དང་། \nབདུད་ཐུལ་དང་། མེ་ཏོག་མན་དཱ་ར་བའི་དྲི་དང་། རླུང་ལྷ་དང་། བདེན་དགའ་དང་། མཉམ་ལྟ་དང་། རི་རབ་རྩེ་འཛིན་དང་། རི་རབ་བརྩེགས་དང་། རི་རབ་མཆོག་དང་། དྲ་བ་ཅན་གྱི་འོད་དང་། རྒྱལ་བའི་བློ་གྲོས་དང་། སྐྱེ་བར་\nཚིམ་བྱེད་དང་། འགྲོ་བ་འཛིན་དང་ལྷའི་རྒྱལ་པོས་མཆོད་དང་། མཆོག་གི་བློ་གྲོས་དང་ཐོགས་མེད་སེམས་དང་། སྐྱ་རེང་བློ་གྲོས་དང་མི་སྐྱོབ་པ་དང་། དཔག་མེད་རིན་ཆེན་མཛོད་དང་། འོད་ཀྱི་ཏོག་དང་འོད་དཔལ་དང་།བགྱིས་ཏེ་གཏན་ལ་ཕབ་པ།།  །།རྒྱ་གར་སྐད་དུ། ཨཱརྱ་དྲུ་མ་ཀི་ན་ན་ར་རཱ་ཛ་པ་རི་པྲིཙྪཱ་ནཱ་མ་མ་ཧཱ་ཡཱ་སཱུ་ཏྲ། བོད་སྐད་དུ།  འཕགས་པ་མི་འམ་ཅིའི་རྒྱལ་པོ་སྡོང་པོས་ཞུས་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་\nཔོའི་མདོ།"],
[ "བ"],
[ "འཕགས་པ་ཚངས་པས་ཞུས་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"],
[ "འཕགས་པ་ཚངས་པས་བྱིན་གྱིས་ཞུས་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"],
[ "འཕགས་པ་ཚངས་པ་ཁྱད་པར་སེམས་ཀྱིས་ཞུས་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"],
[ "འཕགས་པ་ལྷའི་བུ་རབ་རྩལ་སེམས་ཀྱིས་ཞུས་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"],
[ "ཕགས་པ་དཔལ་དབྱིག་གིས་ཞུས་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ། ས"],
[ "འཕགས་པ་རིན་ཆེན་དྲ་བ་ཅན་གྱིས་ཞུས་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"],
[ "ཕགས་པ་རིན་ཆེན་ཟླ་བས་ཞུས་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ། ཐ"],
[ "ཕགས་པ་བདེ་བྱེད་ཀྱིས་ཞུས་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ། ས"],
[ "ཕགས་པ་ཡུལ་འཁོར་སྐྱོང་གིས་ཞུས་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ། ས"],
[ "ཕགས་པ་རྣམ་པར་འཕྲུལ་པའི་རྒྱལ་པོས་ཞུས་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ། བ"],
[ "ྲི་མ་མེད་པའི་འོད་ཀྱིས་ཞུས་པ། བ"],
[ "འཕགས་པ་ཐེག་པ་ཆེན་པོའི་མན་ངག་ཅེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"],
[ "ངས་མེད། བསམ་གྱིས་མི་ཁྱབ་པ། མཚུངས་པ་མེད། གཞལ་དུ་མེད། \nདཔག་ཏུ་མེད། བརྗོད་དུ་མེད་པ་དང་། ཡང་ཐབས་གཅིག་སྟེ། ཐམས་ཅད་ཀྱང་སེམས་ཀྱི་སྐད་གཅིག་གཅིག་ལ་སངས་རྒྱས་ཀྱི་ཞིང་མཐའ་ཡས་པར་འགྲོ་བ་ལ་ལས་བགྱིས་པའི་སྡིག་པ་ཇི་ཙམ་མཆིས་པ་བདག་ཅག་གིས་བགྱིས་པར་གྱུར་ཅིག །དེ་ནས་འོད་ཟེར་དེ་དག་ལས་ཚིག་ཏུ་བརྗོད་པ་འདི་སྐད་ཅེས་འབྱུང་ཏེ། གང་ན་མདོ་འདི་བརྗོད་པ་དེར་བདག་ཅག་འོང་ངོ་ཞེས་སྒྲ་སྒྲོགས་པར་འགྱུར་རོ། །\nདེ་ནས་ཀུན་དགའ་བོ་དང་། འཁོར་དེ་དག་ཐམས་ཅད་ཀྱིས་ཞུས་པ། བཅོམ་ལྡན་འདས་ཆོས་ཀྱི་རྣམ་གྲངས་འདིའི་མིང་ཅི་ལགས། ཅི་ལྟར་བཟུང་བར་བགྱི། བཀའ་སྩལ་པ། མདོ་འདིའི་མིང་ནི་ཆོས་ཀྱི་སྤྱི་བོ་ཞེས་ཀྱང་བྱ། སངས་རྒྱས་ཐམས་ཅད་\nཀྱི་ཆོས་ཀྱི་སྙིང་པོ་ཞེས་ཀྱང་བྱ། དྲི་མ་མེད་པའི་འོད་ཀྱིས་ཞུས་པ་ཞེས་ཀྱང་བྱའོ། །དེ་ནས་བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པས་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །ངས་ཆོས་གང་བཤད་པ་དེ་དག་ཐམས་ཅད་ནི་མདོ་འདི་ཉིད་ཀྱི་ནང་དུ་འདུས་སོ། །བཅོམ་ལྡན་\nའདས་ཀྱིས་དེ་སྐད་ཅེས་བཀའ་སྩལ་ནས། བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་དང་། ཚེ་དང་ལྡན་པ་དགའ་བོ་དང་། འཁོར་དེ་དག་ཐམས་ཅད་དང་། ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་ཡི་རངས་ཏེ། བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པ་ལ་མངོན་\nཔར་བསྟོད་དོ།།  །།ཐེག་པ་ཆེན་པོའི་མདོ་དྲི་མ་མེད་པའི་འོད་ཀྱིས་ཞུས་པ་ཞེས་བྱ་བ་རྫོགས་སྷོ།།  །།རྒྱ་གར་སྐད་དུ། ཨཱརྱ་མ་ཧཱ་ཡཱ་ནོ་པ་དེ་ཤ་ནཱ་མ་མ་ཧཱ་ཡཱ་ན་སཱུ་ཏྲ། བོད་སྐད་དུ།  འཕགས་པ་ཐེག་པ་ཆེན་པོའི་མན་ངག་ཅེས་བྱ་བ་ཐེག་པ་ཆེན་\nཔོའི་མདོ་ བ"],
[ "ཕགས་པ་བྲམ་ཟེ་མོ་དཔལ་ལྡན་མས་ཞུས་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ། ས"],
[ "ཕགས་པ་བགྲེས་མོས་ཞུས་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ། ས"],
[ "མ"],
[ "འཕགས་པ་འཇམ་དཔལ་གྱིས་དྲིས་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"],
[ "འཕགས་པ་བདག་མེད་པ་དྲིས་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"],
[ "འཕགས་པ་འཇིག་རྟེན་འཛིན་གྱིས་ཡོངས་སུ་དྲིས་པ་ཞེས་བྱ་བའི་མདོ།"],
[ "དང་པོ། གླེང་གཞིའི་ལེའུ།"],
[ "གཉིས་པ། ཕུང་པོ་ལྔ་ལ་བརྟགས་པའི་ལེའུ།"],
[ "གསུམ་པ། ཁམས་བཅོ་བརྒྱད་ཀྱི་ལེའུ།"],
[ "བཞི་པ། སྐྱེ་མཆེད་བཅུ་གཉིས་ཤེས་པར་བྱ་བའི་ལེའུ།"],
[ "ལྔ་པ། རྟེན་ཅིང་འབྲེལ་ཏེ་འབྱུང་བ་བཅུ་གཉིས་ཤེས་པར་བྱ་བའི་ལེའུ།"],
[ "དྲུག་པ། དྲན་པ་ཉེ་བར་བཞག་པ་ཞེས་བྱ་བའི་ལེའུ།"],
[ "བདུན་པ། དབང་པོ་ལྔ་ཞེས་བྱ་བའི་ལེའུ།"],
[ "བརྒྱད་པ། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་ཅེས་བྱ་བའི་ལེའུ།"],
[ "དགུ་པ། འཇིག་རྟེན་དང་འཇིག་རྟེན་ལས་འད་ས་པའི་ཆོས་ཞེས་བྱ་བའི་ལེའུ།"],
[ "བཅུ་པ། འདུས་བྱས་ད་ང་འདུས་མ་བྱས་པ་ཞེས་བྱ་བའི་ལེའུ།"],
[ "བཅུ་གཅིག་པ། སྔོན་བྱུང་བའི་བསྟན་པ་ཞེས་བྱ་བའི་ལེའུ།"],
[ "བཅུ་གཉིས་པ། གདམས་པ་ཞེས་བྱ་བའི་ལེའུ།"],
[ "འཕགས་པ་བློ་གྲོས་མི་ཟད་པས་བསྟན་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"],
[ "འཕགས་པ་དྲི་མ་མེད་པར་གྲགས་པས་བསྟན་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"],
[ "དང་པོ། སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་ད་ག་པ་གླེང་གཞིའི་ལེའུ།"],
[ "གཉིས་པ། ཐབས་མཁས་པ་བསམ་གྱིས་མི་ཁྱབ་པའི་ལེའུ།"],
[ "གསུམ་པ། ཉན་ཐོས་དང་བྱང་ཆུབ་སེམས་ད་པའ་གཏ་ང་བར་རྨས་པའི་ལེའུ།"],
[ "བཞི་པ། ན་བ་ཡང་དག་པར་དགའ་བར་བྱ་བའི་ལེའུ།"],
[ "ལྔ་པ། རྣམ་པར་ཐར་པ་བསམ་གྱིས་མི་ཁྱབ་པ་བསྟན་པའི་ལེའུ།"],
[ "དྲུག་པ། ལྷ་མོའི་ལེའུ།"],
[ "བདུན་པ། དེ་བཞིན་གཤེགས་པའི་རིགས་ཀྱི་ལེའུ།"],
[ "བརྒྱད་པ། གཉིས་སུ་མེད་པའི་ཆོས་ཀྱི་སྒོར་འཇུག་པའི་ལེའུ།"],
[ "དགུ་པ། སྤྲུལ་པས་ཞལ་ཟས་བླངས་པའི་ལེའུ།"],
[ "བཅུ་པ། ཟད་པ་དང་མི་ཟད་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་རྫོངས་ཀྱི་ལེའུ།"],
[ "བཅུ་གཅིག་པ། དེ་བཞིན་གཤེགས་པ་མི་འཁྲུགས་པ་བསྟན་པའི་ལེའུ།"],
[ "བཅུ་གཉིས་པ། སྔོན་གྱི་སྦྱོར་བ་དང་། དམ་པའི་ཆོས་གཏད་པའི་ལེའུ།"],
[ "འཕགས་པ་འཇམ་དཔལ་གྱིས་བསྟན་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའ་མདོ།"],
[ "ཕགས་པ་བྱང་ཆུབ་ཀྱི་ཕྱོགས་བསྟན་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ། ས"],
[ "འཕགས་པ་ཀུན་རྫོབ་དང་དོན་དམ་པའི་བདེན་པ་བསྟན་པ་བསྟན་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"],
[ "འཕགས་པ་ཆོས་ཐམས་ཅད་འབྱུང་བ་མེད་པར་བསྟན་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"],
[ "པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མར་མེ་མཛད་ཀྱི་དྲུང་དུ། ཆོས་ཐམས་ཅད་ནི་ཚུལ་གཅིག་པའོ་ཞེས་བྱ་\nབར་ཁོང་དུ་ཆུད་པར་གྱུར་ནས། དེའི་འོག་ཏུ་ངས་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་བོ། །རིགས་ཀྱི་བུ་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་པོ་ཐམས་ཅད་ཐོབ་པ་དང་། ཆོས་བསྟན་པ་འདི་ཐོས་པར་མཚུངས་ཏེ། རིགས་ཀྱི་བུ་ཚུལ་འདི་\nརྟོགས་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོངས་སུ་རྫོགས་པར་འགྱུར་བ་ངས་བཤད་དོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རིགས་ཀྱི་བུ་གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔས་བསྐལ་པ་\nགང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དུ་སྦྱིན་པ་བྱིན། ཚུལ་ཁྲིམས་བསྲུངས། བཟོད་པ་སྒྲུབས། བརྩོན་འགྲུས་བརྩམས། བསམ་གཏན་ལ་མཉམ་པར་བཞག །ཤེས་རབ་ཡང་དག་པར་བླངས་ཏེ་གནས་ཀྱང་། ཆོས་ཀྱི་ཚུལ་འདི་མ་\nཤེས་ན་དགེ་བའི་རྩ་བ་དེ་དག་ཐམས་ཅད་ཕྱིར་ཟད་པར་འགྱུར་རོ། །རིགས་ཀྱི་བུ་ལྷས་བྱིན་དགེ་བའི་རྩ་བ་དེ་ལྟ་བུ་དང་ལྡན་པར་གྱུར་པ་ལ་ལྟོས། རིགས་ཀྱི་བུ་ལྷས་བྱིན་ནི་མི་ཆེན་པོའི་མཚན་སུམ་བཅུ་དང་ལྡན་པར་གྱུར་ཏོ། ། \nདེ་ལྟ་བུའི་དགེ་བའི་རྩ་བ་དང་ལྡན་པ་དེ་ཡང་ཆོས་ཀྱི་ཚུལ་འདི་མ་ཤེས་པས། དགེ་བའི་རྩ་བ་དེ་དག་ཐམས་ཅད་ཡོངས་སུ་ཆུད་ནས། མནར་མེད་པའི་སེམས་ཅན་དམྱལ་བ་ཆེན་པོར་སྐྱེས་ཏེ། རིགས་ཀྱི་བུ་རྣམ་གྲངས་དེས་\nཀྱང་ཇི་ལྟར་ཆོས་ཀྱི་ཚུལ་འདི་ཁོང་དུ་མ་ཆུད་པ་རྣམས་ཀྱི་དགེ་བའི་རྩ་བ་ཆད་པར་འགྱུར་བར་རིག་པར་བྱའོ། །རིགས་ཀྱི་བུ་སྔོན་འདས་པའི་དུས་བསྐལ་པ་གྲངས་མེད་པ་ཤིན་དུ་བགྲང་བ་ལས་འདས་པ། ཚད་མེད་པ། ཡངས་པ།བཀའ་སྩལ་ནས། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་དང་། ཉན་ཐོས་ཆེན་པོ་དེ་དག་དང་། ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་དང་། འཁོར་དེ་དག་ཐམས་ཅད་དང་། ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་དང་། དྲི་ཟར་\nབཅས་པའི་འཇིག་རྟེན་ཡིད་རངས་ཏེ། བཅོམ་ལྡན་འདས་ཀྱིས་བཤད་པ་ལ་མངོན་པར་བསྟོད་དོ། །འཕགས་པ་ཀུན་རྫོབ་དང་དོན་དམ་པའི་བདེན་པ་བསྟན་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ། རྫོགས་སྷོ།།  །།རྒྱ་གར་གྱི་མཁན་པོ་\nཤཱཀྱ་པྲ་བྷ་དང་། འཛི་ན་མི་ཏྲ་དང་། ཞུ་ཆེན་གྱི་ལོ་ཙྪ་བ་བན་དེ་དྷརྨ་ཏ་ཤཱི་ལ་ལ་སོགས་པས་བསྒྱུར་ཅིང་ཞུས་ནས་གཏན་ལ་ཕབ་པ།།  །།རྒྱ་གར་སྐད་དུ། ཨཱརྱ་སརྦ་དྷརྨཱ་པྲ་བྲིད་ཏི་ནིར་དེ་ཤ་ནཱ་མ་མ་ཧཱ་ཡཱ་ན་སཱུ་ཏྲ། བོད་སྐད་དུ། འཕགས་པ་\nཆོས་ཐམས་ཅད་འབྱུང་བ་མེད་པར་བསྟན་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"],
[ "ཙ"],
[ "འཕགས་པ་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལྔ་བསྟན་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"],
[ "སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྲིན་པ་བསྟན་པ།"],
[ "དང་པོ། རྗེས་སུ་ཡི་རང་བའི་ལེའུ།"],
[ "གཉིས་པ། སྦྱིན་པའི་ཐབས་ལ་མགས་པའི་ལེའུ།"],
[ "གསུམ་པ། དཔེའི་ལེའུ།"],
[ "བཞི་པ། མཚན་མ་མེད་པའི་ལེའུ།"],
[ "ལྔ་པ། སྒྱུ་མ་ལྟ་བུར་བསྟན་པའི་ལེའུ།"],
[ "དྲུག་པ། འཇིག་རྟེན་གྱི་ཁམས་གྲངས་མེད་པར་བྱང་ཆུབ་སེམས་དཔའི་སྦྱོད་པ་དང་། སངས་རྒྱས་བསྟན་པ་ཞེས་བྱ་བའི་ལེའུ།"],
[ "བདུན་པ། ཕྱིར་མི་ལྔོག་པའི་སའི་ལེའུ།"],
[ "བརྒྱད་པ། བྱང་ཆུབ་སེམས་དཔའ་ཡོངས་སུ་སྦྱང་བར་བྱ་བའི་ལེའུ།"],
[ "དགུ་པ།"],
[ "ཆུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་བསྟན་པ།"],
[ "ལེའུ་དང་པོ།"],
[ "ལེའུ་གཉིས་པ།"],
[ "ལེའུ་གསུམ་པ།"],
[ "ལེའུ་བཞི་པ།"],
[ "ལེའུ་ལྔ་པ།"],
[ "ལེའུ་དྲུག་པ།"],
[ "ལེའུ་བདུན་པ།"],
[ "བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་བསྟན་པ།"],
[ "ལེའུ་དང་པོ"],
[ "ལེའུ་གཉིས་པ།"],
[ "ལེའུ་གསུམ་པ།"],
[ "བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་བསྟན་པ།"],
[ "བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྲིན་པ་བསྟན་པ།"],
[ "ལེའུ་དང་པོ"],
[ "ལེའུ་གཉིས་པ།"],
[ "ལེའུ་གསུམ་པ།"],
[ "ལེའུ་བཞི་པ།"],
[ "འཕགས་པ་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"],
[ "ལེའུ་དང་པོ"],
[ "ལེའུ་གཉིས་པ།"],
[ "འཕགས་པ་སྦྱིན་པའི་ཕན་ཡོན་བསྟན་པ།"],
[ "འཕགས་པ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་བསྟན་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"],
[ "འཕགས་པ་དེ་བཞིན་གཤེགས་པའི་ཡོན་ཏན་དང་ཡེ་ཤེས་བསམ་གྱིས་མི་ཁྱབ་པའི་ཡུལ་ལ་འཇུག་པ་བསྟན་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"],
[ "འཕགས་པ་སངས་རྒྱས་ཀྱི་སྟོབས་སྐྱེད་པའི་ཆོ་འཕྲུལ་རྣམ་པར་འཕྲུལ་པ་བསྟན་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"],
[ "འཕགས་པ་སངས་རྒྱས་ཀྱི་ཆོས་བསམ་གྱིས་མི་ཁྱབ་པ་བསྟན་པ།"],
[ "འཕགས་པ་མར་མེ་མཛད་ཀྱིས་ལུང་བསྟན་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"],
[ "འཕགས་པ་ཚངས་པའི་དཔལ་ལུང་བསྟན་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"],
[ "འཕགས་པ་བུད་མེད་འགྱུར་བ་ལུང་བསྟན་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"],
[ "འཕགས་པ་བུ་མོ་ཟླ་མཆོག་ལུང་བསྟན་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"],
[ "འཕགས་པ་བདེ་ལྡན་མ་ལུང་བསྟན་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"],
[ "རྒྱ་\nཆེ་བ། །འཕེལ་བར་གྱུར་ཏེ་བསྐྱོད་མི་ནུས། །དེ་བཞིན་ལྗོན་ཤིང་ཆེ་བཟང་འདི། །སངས་རྒྱས་ཆོས་ཉིད་འཚལ་བས་ན། །སེམས་ཅན་ཀུན་ལ་ཕན་པའི་ཕྱིར། །སྔོན་ནི་ལེགས་པར་བསྲུངས་པ་ལགས། །འདྲེན་པའི་བསོད་ནམས་\nལྗོན་ཤིང་འདིའི། །འབྲས་བུ་གཞན་ཡང་མཆིས་ལགས་ཏེ། །བདག་གིས་ཉམས་སུ་མྱོང་བ་འདི། །དེ་ཡི་མེ་ཏོག་ཙམ་དུ་བས། །དེ་ཡི་འབྲས་བུ་བྱང་ཆུབ་མཆོག །སངས་རྒྱས་བྱང་ཆུབ་བླ་མེད་ལགས། །དེ་ནི་བདག་གིས་\nཐོབ་པར་འགྱུར། །སྨད་པ་བུད་མེད་ཉིད་སྤངས་ནས། །སྐྱེས་པར་བདག་ཉིད་འགྱུར་བ་ལགས། །སེམས་ཅན་ཀུན་གྱི་དམ་པ་མཆོག །ཆོས་རྣམས་ཀུན་གྱི་ཕ་རོལ་ཕྱིན། །ཐམས་ཅད་མཁྱེན་པ་ཐམས་ཅད་གཟིགས། །\nསྡུག་བསྔལ་ཀུན་གྱི་ཉེན་པ་ཡི། །སེམས་ཅན་རྣམས་ནི་བདག་གིས་དགྲོལ། །འཇིག་རྟེན་ཀུན་ལ་སྙིང་བརྩེ་བའི། །སྐྱབས་སུ་བདག་ནི་འགྱུར་བ་ལགས། །དེ་སྐད་ཅེས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་རྒྱལ་པོའི་བཙུན་\nམོ་བདེ་ལྡན་མ་ལ་བཀའ་སྩལ་པ། བདེ་ལྡན་མ་གང་ཁྱོད་སྐྱེ་བོ་མང་པོ་ལ་ཕན་པ་དང་། སྐྱེ་བོ་མང་པོ་ལ་བདེ་བ་དང་། འཇིག་རྟེན་ལ་སྙིང་བརྩེ་བ་དང་། སྐྱེ་བོ་ཕལ་པོ་ཆེའི་ཚོགས་ཀྱི་དོན་དང་། ལྷ་རྣམས་དང་། མི་རྣམས་ལ་ཕན་པ་དང་། བདེ་བའི་ཕྱིར་ཞུགས་པ་ལེགས་སོ་དག་གོ། །དགེ་སློང་ལྔ་བརྒྱ་ནི་ལེན་པ་མེད་པར་ཟག་པ་རྣམས་ལས་སེམས་རྣམ་པར་གྲོལ་ལོ། །སྔོན་བྱང་ཆུབ་ཏུ་སེམས་མ་བསྐྱེད་པའི་དགེ་སློང་མ་ཉིས་བརྒྱ་དང་སྲོག་ཆགས་ཉི་ཁྲིས་ནི་བླ་ན་མེད་པ་ཡང་\nདག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དོ། །བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་ཅེས་བཀའ་སྩལ་ནས། བྱང་ཆུབ་སེམས་དཔའ་ཟླ་མཆོག་དང་། ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་དང་། ཉན་\nཐོས་ཆེན་པོ་དེ་དག་དང་། ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་དེ་དག་དང་། ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་དང་། དྲི་ཟར་བཅས་པའི་འཇིག་རྟེན་ཡི་རངས་ཏེ། བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པ་ལ་མངོན་པར་བསྟོད་དོ། །\nའཕགས་པ་བུ་མོ་ཟླ་མཆོག་ལུང་བསྟན་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ་རྫོགས་སོ།།  །།རྒྱ་གར་གྱི་མཁན་པོ་ཛི་ན་མི་ཏྲ་དང་། ཞུ་ཆེན་གྱི་ལོཙྪ་བ་བན་དྷེ་ཡེ་ཤེས་སྡེས་ཞུས་ཏེ་གཏན་ལ་ཕབ་པའོ།།  །།\nརྒྱ་གར་སྐད་དུ། ཨཱརྱ་ཀྵེ་མཱ་བ་ཏཱི་བྱཱ་ཀ་ར་ཎ་ནཱ་མ་མ་ཧཱ་ཡཱ་ན་སཱུ་ཏྲ། བོད་སྐད་དུ།"],
[ "འཕགས་པ་ལྷ་མོ་ཆེན་པོ་དཔལ་ལུང་བསྟན་པ།"],
[ "འཕགས་པ་རྒྱལ་བའི་བློ་གྲོས་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"],
[ "འཕགས་པ་སྤྱན་རས་གཟིགས་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"],
[ "འཕགས་པ་འཇམ་དཔལ་གནས་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"],
[ "འཕགས་པ་བདུད་རྩི་བརྗོད་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"],
[ "འཕགས་པ་བྱམས་པ་འཇུག་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"],
[ "འཕགས་པ་འཇིག་རྟེན་གྱི་རྗེས་སུ་འཐུན་པར་འཇུག་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"],
[ "ཚ"],
[ "འཕགས་པ་དད་པའི་སྟོབས་བསྐྱེད་པ་ལ་འཇུག་པའི་ཕྱག་རྒྱ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"],
[ "འཕགས་པ་ངེས་པ་དང་མ་ངེས་པར་འགྲོ་བའི་ཕྱག་རྒྱ་ལ་འཇུག་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"],
[ "འཕགས་པ་ཆོས་ཀྱི་ཕྱག་རྒྱ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"],
[ "འཕགས་པ་མར་མེ་འབུལ་བ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"],
[ "འཕགས་པ་གྲོང་ཁྱེར་གྱིས་འཚོ་བ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"],
[ "ཟས་ཀྱི་འཚོ་བ་རྣམ་པར་དག་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"],
[ "གླང་པོའི་རྩལ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"],
[ "འཕགས་པ་སྒྲ་ཆེན་པོ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"],
[ "འཕགས་པ་སེང་གེའི་སྒྲ་བསྒྲགས་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"],
[ "འཕགས་པ་སཱ་ལུའི་ལྗང་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"],
[ "རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་དང་པོ་དང་རྣམ་པར་དབྱེ་བ་བསྟན་པ་ཞེས་བྱ་བའི་མདོ།"],
[ "འཕགས་པ་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་ཞེས་བྱ་བའི་ཐེག་པ་ཆེན་པོའི་མདོ།"],
[ "འཕགས་པ་སོར་མོའི་ཕྲེང་བ་ལ་ཕན་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"],
[ "རྒྱལ་པོ་ལ་གདམས་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"],
[ "རྒྱལ་པོ་ལ་གདམས་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"],
[ "འཕགས་པ་མ་སྐྱེས་དགྲའི་འགྱོད་པ་བསལ་བ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"],
[ "འཕགས་པ་དཔལ་སྦས་ཞེས་བྱ་བའི་མདོ།"],
[ "འཕགས་པ་ལས་ཀྱི་སྒྲིབ་པ་རྣམ་པར་དག་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"],
[ "འཕགས་པ་ལས་ཀྱི་སྒྲིབ་པ་རྒྱུན་གཅོད་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"],
[ "ཛ"],
[ "སངས་རྒྱས་ཀྱི་སྡེ་སྣོད་ཚུལ་ཁྲིམས་འཆལ་པ་ཚར་གཅོད་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"],
[ "དང་པོ། གླེང་གཞིའི་ལེའུ།"],
[ "གཉིས་པ། དྲན་པ་བསྟན་པའི་ལེའུ།"],
[ "གསུམ་པ། དགེ་བའི་བཤེས་གཉེན་གྱི་ལེའུ།"],
[ "བཞི་པ། འཕགས་པའི་དགེ་འདུན་གྱི་ལེའུ།"],
[ "ལྔ་པ། འཆལ་པའི་ཚུལ་ཁྲིམས་ཀྱི་ལེའུ།"],
[ "དྲུག་པ། ཡོངས་སུ་མ་དག་པའི་ཆོས་བསྟན་པའི་ལེའུ།"],
[ "བདུན་པ། སྔོན་གྱི་སྦོར་བའི་ལེའུ།"],
[ "བརྒྱད་པ། དེ་བཞིན་གཤེགས་པ་ལ་བཀུར་སྟི་བྱས་པ་དང་། བླ་མར་བྱས་པ་དང་། རྗེད་པ་དང་། མཆོད་པ་དང་། མཉེས་པར་བྱས་པའི་ལེའུ།"],
[ "གས་པ་རྒྱལ་པོ་ལ་གདམས་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ། ས"],
[ "གས་པ་རྔ་བོ་ཆེ་ཆེན་པོའི་ལེའུ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ། བ"],
[ "འཕགས་པ་སུམ་བཅུ་རྩ་གསུམ་པའི་ལེའུ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"],
[ "འཕགས་པ་ལྷག་པའི་བསམ་པ་བརྟན་པའི་ལེའུ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"],
[ "ས་པ་གསུམ་ལ་སྐྱབས་སུ་འགྲོ་བ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ། དཀ"],
[ "གས་པ་སྲིད་པ་འཕོ་བ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ། ས"],
[ "གས་པ་རྣམ་པར་འཐག་པ་ཐམས་ཅད་བསྡུས་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ། ས"],
[ "འཕགས་པ་སངས་རྒྱས་བགྲོ་བ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"],
[ "དེ་བཞིན་གཤེགས་པ་བགྲོ་བ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"],
[ "འདུས་པ་ཆེན་པོ་ཐེག་པ་ཆེན་པོའི་མདོ་སྡེ་ལས་དེ་བཞིན་གཤེགས་པའི་དཔལ་གྱི་དམ་ཚིག་ཅེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"],
[ "དང་པོ། ཉན་ཐོས་མཚོན་པ།"],
[ "གཉིས་པ། བསམ་གཏན་མཚོན་པ།"],
[ "གསུམ་པ། ཐན་ཆེན་རབ་ཏུ་ཞི་བར་བྱེད་པའི་མཚོན་པ།"],
[ "བཞི་པ།"],
[ "ཝ"],
[ "འཕགས་པ་དཀོན་མཆོག་སྤྲིན་ཅེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"],
[ "འཕགས་པ་སྤྲིན་ཆེན་པོ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"],
[ "དང་པོ། ལྷ་ཐམས་ཅད་འདུས་པ་ཞེས་བྱ་བ་སྟེ་ཕུང་པོའི་ལེའུ།"],
[ "གཉིས་པ། ཏིང་ངེ་འཛིན་གྱི་ལེའུ།"],
[ "གསུམ་པ། གཟུངས་ཀྱི་གླེང་གཞིའི་ལེའུ།"],
[ "བཞི་པ། ལྡེམ་པོ་ངག་གི་གླེང་གཞིའི་ལེའུ།"],
[ "ལྔ་པ། སྲིད་པར་སྐྱེ་བའི་གླེང་གཞིའི་ལེའུ།"],
[ "དྲུག་པ། འཁོར་བ་ཉོན་མོངས་པའི་ཞིང་གི་ལས་ཀྱི་ས་འཐོབ་པའི་གླེང་གཞིའི་ལེའུ།"],
[ "བདུན་པ། ཡེ་ཤེས་ལ་རྨོང་པ་གཟུད་པའི་གླེང་གཞིའི་ལེའུ།"],
[ "བརྒྱད་པ། ཡེ་ཤེས་ཟབ་མོ་བརྟན་པ་འཐོབ་པ་ལ་འཇུག་པའི་རྣམ་པའི་གླེང་གཞིའི་ལེའུ།"],
[ "དགུ་པ། རྣམ་པར་ཐར་པའི་བསོད་ནམས་ཀྱི་མཛོད་ཀྱི་གླེང་གཞིའི་ལེའུ།"],
[ "བཅུ་པ། བསོད་ནམས་ཀྱི་རྣམ་པ་ཡོངས་སུ་བརྗོད་པའི་གླེང་གཞིའི་ལེའུ།"],
[ "བཅུ་གཅིག་པ། སྤྲིན་ཆེན་པོའི་ཚོགས་ནམ་མཁའ་ལས་འབྱུང་བའི་གླེང་གཞིའི་ལེའུ"],
[ "བཅུ་གཉིས་པ། གློག་གི་འོད་ཀྱི་གླེང་གཞིའི་ལེའུ།"],
[ "བཅུ་གསུམ་པ། སྤྲིན་ཆེན་པོའི་གློག་འགྱུ་བ་དང་ལྡན་ཞིང་མུན་པ་འཇོམས་པའི་གླེང་གཞིའི་ལེའུ།"],
[ "བཅུ་བཞི་པ། སྤྲིན་ཆེན་པོའི་གློག་གི་སྒྱུ་འཕྲུལ་གྱི་གླེང་གཞིའི་ལེའུ།"],
[ "བཅྭ་ལྔ་པ། ཆོ་འཕྲུལ་ཆེན་པོའི་གླེང་གཞིའི་ལེའུ།"],
[ "བཅུ་དྲུག་པ། ཆོས་ཀྱི་ཐོག་ཏོག་གི་འབེལ་བའི་གཏམ་གྱི་གླེང་གཞིའི་ལེའུ།"],
[ "བཅུ་བདུན་པ། ཡེ་ཤེས་རྡོ་རྗེའི་རྣམ་པ་ལ་འཇུག་པའི་གླེང་གཞིའི་ལེའུ།"],
[ "བཅྭ་བརྒྱད་པ། ལོངས་སྤྱོད་མི་ཟད་པའི་རྣམ་པ་ལ་འཇུག་པ་རྣམ་པར་འཕྲུལ་བའི་རྒྱལ་པོའི་ཆོས་ཀྱི་སྒོའི་གླེང་གཞིའི་ལེའུ།"],
[ "བཅུ་དགུ་པ། ཡང་དག་པའི་ལམ་གྱི་རྣམ་པ་མངོན་པར་མཚོན་པ་ལ་འཇུག་པའི་ཆོས་ཀྱི་སྒོའི་གླེང་གཞིའི་ལེའུ།"],
[ "ཉི་ཤུ་པ། ཕྲ་ཞིང་ཟབ་པའི་གླེང་གཞིའི་རྣམ་པ་ལ་འཇུག་པའི་ལེའུ།"],
[ "ཉི་ཤུ་གཅིག་པ། སེང་གེ་རྣམ་པར་རྩེ་བ་ལ་དམིགས་པའི་གླེང་གཞིའི་ལེའུ།"],
[ "ཉི་ཤུ་གཉིས་པ། མཚམས་སྦྱར་བ་ཚོགས་པའི་རྣམ་པ་འཇིག་རྟེན་དང་འཐུན་པར་འཇུག་པར་བྱ་བ་ལ་འཇུག་པའི་མདོའི་གླེང་གཞིའི་ལེའུ།"],
[ "ཉི་ཤུ་གསུམ་པ། མངོན་པར་རྩེ་བ་རིན་པོ་ཆེའི་མཛོད་ལ་འཇུག་པའི་གླེང་གཞིའི་ལེའུ།"],
[ "ཉི་ཤུ་བཞི་པ། ནམ་མཁའ་ལྡིང་གི་རྩལ་ཆེན་པོའི་སྟོབས་ལ་འཇུག་པའི་གླེང་གཞིའི་ལེའུ།"],
[ "ཉི་ཤུ་ལྔ་པ། སྒྲ་ཆེན་པོའི་དུས་རྣམ་པར་བསྒྲགས་པ་བཀོད་པའི་རྒྱལ་པོའི་གླེང་གཞིའི་ལེའུ།"],
[ "ཉི་ཤུ་དྲུག་པ། མི་འཇིགས་པ་ཆེན་པོའི་སྟོབས་ཀྱི་རྣམ་པར་འཕྲུལ་པ་ལ་འཇུག་པའི་གླེང་གཞིའི་ལེའུ།"],
[ "ཉི་ཤུ་བདུན་པ། གནས་ཀྱི་རྣམ་པ་དང་བཅས་པ་ཡངས་པའི་ཆོས་ཀྱི་སྒོའི་གླེང་གཞིའི་ལེའུ།"],
[ "ཉི་ཤུ་བརྒྱད་པ།ལྷག་པའི་བསམ་པའི་ཆོ་ག་ལ་འཇུག་པའི་གླེང་གཞིའི་ལེའུ།"],
[ "ཉི་ཤུ་དགུ་པ། དམག་ཆེན་པོ་དཔའ་བའི་རྒྱལ་པོ་སྟོབས་བཀོད་པའི་གླེང་གཞིའི་ལེའུ།"],
[ "སུམ་བཅུ་པ། བཟང་པོའི་རྣམ་པའི་རྣམ་པར་འཕྲུལ་པའི་རྒྱལ་པོའི་ཆོས་ཀྱི་སྒོའི་གླེང་གཞིའི་ལེའུ།"],
[ "སུམ་བཅུ་གཅིག་པ། རྩེ་བ་དང་བཅས་པ་ཡང་དག་པར་སྦས་པ་སྟོན་པའི་དཔུང་བསྐྱེད་པ་ལ་འཇུག་པའི་གླེང་གཞིའི་ལེའུ།"],
[ "སུམ་བཅུ་གཉིས་པ། ཡེ་ཤེས་རྩོམ་པའི་ཆོ་ག་ལ་ཞུགས་པའི་རྣམ་པའི་གླེང་གཞིའི་ལེའུ།"],
[ "སུམ་བཅུ་གསུམ་པ། ཡེ་ཤེས་ཀྱི་ནོར་བསྒྲིམས་ཏེ་བསྒྲུབ་པའི་མཛོད་ཀྱི་གླེང་གཞིའི་ལེའུ།"],
[ "སུམ་བཅུ་བཞི་པ། ཡང་དག་པའི་མཆོད་སྦྱིན་ལ་ཕན་པའི་ཆོ་ག་བཀོད་པའི་གླེང་གཞིའི་ལེའུ།"],
[ "སུམ་བཅུ་ལྔ་པ། སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡང་དག་པའི་ས་བོན་རབ་ཏུ་སྐྱེད་པའི་གླེང་གཞིའི་ལེའུ།"],
[ "སུམ་ཅུ་དྲུག་པ། དེ་ཁོ་ནའི་སྙིང་པོའི་ཚུལ་གྱིས་མངོན་པར་རྩེ་བ་ལ་དགའ་བའི་རྒྱལ་པོའི་རྣམ་པར་འཕྲུལ་པ་ལ་འཇུག་པའི་གླེང་གཞིའི་ལེའུ།"],
[ "སུམ་བཅུ་བདུན་པ། དམ་པའི་ཆོས་ཀྱི་དཀྱིལ་འཁོར་གྱི་ཕུང་པོའི།"],
[ "འཕགས་པ་སྤྲིན་ཆེན་པོའི་མདོ་ལས་ཕྱོགས་བཅུའི་བྱང་ཆུབ་སེམས་དཔའ་རྒྱ་མཚོ་འདུས་པའི་དགའ་སྟོན་ཆེན་པོ་ལ་རྩེ་བ་ཞེས་བྱ་བའི་ལེའུ།"],
[ "འཕགས་པ་སྤྲིན་ཆེན་པོ་རླུང་གི་དཀྱིལ་འཁོར་གྱི་ལེའུ་ཀླུ་ཐམས་ཅད་ཀྱི་སྙིང་པོ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"],
[ "འཕགས་པ་སྤྲིན་ཆེན་པོ།"],
[ "བཅོམ་ལྡན་འདས་ཀྱི་གཙུག་ཏོར་ཆེན་པོ་དེ་བཞིན་གཤེགས་པའི་གསང་བསྒྲུབ་པའི་དོན་མངོན་པར་ཐོབ་པའི་རྒྱུ་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་སྤྱོད་པ་དཔའ་བར་འགྲོ་བའི་མདོ་ལེའུ་སྟོང་ཕྲག་བཅུ་པ་ལས་ལེའུ་བཅུ་པ།"],
[ "གཙུག་ཏོར་ཆེན་པོ་བམ་པོ་དགུ་པ་ལས་བདུད་ཀྱི་ལེའུ་ཉི་ཚེ་ཕྱུང་བ།"],
[ "ཞ"],
[ "འཕགས་པ་ཆོས་ཡང་དག་པར་སྡུད་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"],
[ "འདུས་པ་ཆེན་པོ་ལས་སའི་སྙིང་པོའི་འཁོར་ལོ་བཅུ་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"],
[ "དང་པོ། གླེང་གཞིའི་ལེའུ།"],
[ "གཉིས་པ། འཁོར་ལོ་བཅུའི་ལེའུ།"],
[ "གསུམ་པ། གནས་ཤིང་སྤྱད་ཕར་མི་བྱ་བའི་ལེའུ།"],
[ "བཞི་པ། གནས་པ་དང། སྤྱད་པའི་ལེའུ།"],
[ "དྲུག་པ། དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ཞེས་བྱ་བའི་ལེའུ།"],
[ "བདུན་པ། བསོད་ནམས་ཀྱི་ཞིང་གི་མཚན་ཉིད་ཀྱི་ལེའུ།"],
[ "བརྒྱད་པ། བདེ་བའི་དོན་ཐོབ་པ་ཡོངས་སུ་གདམས་པ་ཞེས་བྱ་བའི་ལེའུ།"],
[ "འཕགས་པ་ཕྱིར་མི་ལྡོག་པའི་འཁོར་ལོ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"],
[ "འཕགས་པ་ཏིང་ངེ་འཛིན་གྱི་འཁོར་ལོ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"],
[ "ཕགས་པ་ཡོངས་སུ་བསྔོ་བའི་འཁོར་ལོ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ། ས"],
[ "ཟ"],
[ "དམ་པའི་ཆོས་ཀྱི་རྒྱལ་པོ་ཐེག་པ་ཆེན་པོའི་མདོ།"],
[ "འཕགས་པ་ཆོས་ཀྱི་ཚུལ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"],
[ "འཕགས་པ་ཆོས་ཀྱི་ཕུང་པོ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"],
[ "འཕགས་པ་དོན་དམ་པའི་ཆོས་ཀྱིས་རྣམ་པར་རྒྱལ་བ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"],
[ "འཕགས་པ་ཆོས་དང་དོན་རྣམ་པར་འབྱེད་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"],
[ "བྱང་ཆུབ་སེམས་དཔའི་སོ་སོར་ཐར་པ་ཆོས་བཞི་སྒྲུབ་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"],
[ "འཕགས་པ་ཆོས་བཞི་བསྟན་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"],
[ "ཆོས་བཞི་པའི་མདོ།"],
[ "འཕགས་པ་ཆོས་བཞི་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"],
[ "འཕགས་པ་བཞི་པ་སྒྲུབ་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"],
[ "ཆོས་གསུམ་པ་ཞེས་བྱ་བའི་མདོ།"],
[ "འཕགས་པ་ཆོས་ཀྱི་རྒྱལ་མཚན་གྱི་མདོ་ཐེག་པ་ཆེན་པོའོ། །"],
[ "ཐེག་པ་ཆེན་པོའི་མདོ་ཆོས་རྒྱ་མཚོ་ཞེས་བྱ་བ།"],
[ "ཆོས་ཀྱི་རྒྱ་མོ།"],
[ "འཕགས་པ་ཤིན་ཏུ་རྒྱས་པ་ཆེན་པོའི་སྡེ་ཉི་མའི་སྙིང་པོ་ཞེས་བྱ་བའི་མདོ།"],
[ "དང་པོ། དམ་པའི་ཆོས་བསྲུང་བའི་ལེའུ།"],
[ "གཉིས་པ། ཕོ་ཉའི་ལེའུ།"],
[ "གསུམ་པ། གཟུངས་སྔགས་ཀྱི་ལེའུ།"],
[ "བཞི་པ། ལས་འབྱང་བའི་ལེའུ།"],
[ "ལྔ་པ། ཀུན་ཏུ་བསྲུང་བའི་ལེའུ།"],
[ "དྲུག་པ།"],
[ "བདུན་པ། རྒྱུ་སྐར་གྱི་སྦྱོར་བ་རྣམ་པར་གཞག་པའི་ལེའུ།"],
[ "བརྒྱད་པ།"],
[ "དགུ་པ། སངས་རྒྱས་རྗེས་སུ་དྲན་པའི་ལེའུ།"],
[ "བཅུ་བ། རི་རབ་ལ་གཤེགས་པའི་ལེའུ "],
[ "བཅུ་གཅིག་པ། ཀླུ་སྐྱབས་སུ་འགྲོ་བའི་ལེའུ།"],
[ "འཕགས་པ་དེ་བཞིན་གཤེགས་པའི་སྙིང་པོ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"],
[ "འཕགས་པ་ཡི་གེ་མེད་པའི་ཟ་མ་ཏོག་རྣམ་པར་སྣང་མཛད་ཀྱི་སྙིང་པོ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"],
[ "འཕགས་པ་ནམ་མཁའི་སྙིང་པོ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"],
[ "འཕགས་པ་ཐབས་མཁས་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"]]
